{
 "name": "I CRASHED MY DJI SPARK IN BANGKOK",
 "description": "Please like share and subscribe to TrekTrendy for more worldwide travel vlogs: http://bit.ly/1WNqym8\n\nAs I walked into the DJI flagship store in Hong Kong, just days after the Spark's international release, I didn't think that the following day, i'd be crashing it into the Chao Phraya River... but hey, that's what happens when you pair an idiot, with an expensive bit of new tech! \n\nSo whilst it pains me to rewatch that video, I thought that I'd share it with you guys, I await the shouts of \"you tw*t\" and \"you stupid english d*ck\" in the comments but such is the world of Youtube I share the good and the bad... \n\nAt the same time, I've just received my new DJI spark, so I thought it was worth sharing this. It's boxed very much like an Apple product, minimalistic, and quite intuitive to set up. There's a couple of niggles which I have, the battery is pretty poor at 16minutes flight time, and then there's the fact the standalone off the shelf drone, doesn't come with a remote controller, you have to use your phone. You can grab this separately or purchase the fly more package but this does substantially increase the cost. That said, I do really love this drone, it's tiny, shoot good quality footage in 1080p, and it's very portable so for my frequent travels, i can throw it in my backpack and go. \n\nDo learn from my experience though, and practise a lot before trying anything too ambitious, I know it seems like a toy, but it still requires quite a lot of skill to use properly. Hope you like the video guys :) \n\nJust to note, this is not an ad (quite why anyone would pay me to show this crash I don't know!) I just wanted to share with you my experience of unboxing the new drone, and the pain of crashing my old one!\n\nBACKGROUND MUSIC:\n\nUkulele Hakuna Matata by HookSounds hooksounds.com/\nCreative Commons — Attribution 4.0 International — CC BY 4.0",
 "source": "youtube",
 "source_id": "PN_3BALOZCQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-14T19:18:28Z"
}