{
 "name": "The Ultimate ASMR Airport Walk - Atlanta (ATL) - All Gates, All Concourses, No Interruptions!",
 "description": "Thanks for joining me for one of my biggest ambient airport walks ever; welcome to Hartsfield--Jackson Atlanta International Airport! This is the busiest airport in the world by passenger count, and it needs lots of concourses to quickly and safely transport tens of millions of people every year!\n\nUnlike other tours I do, this one covers every terminal as I explore it; no music, no narration, no interruptions! However, this time I've included a little optional trivia game for airport nerds!\n\nWhether you want to see the detailed layout of this airport, you're curious about what's around the corner, or you want to relax to the sights and sounds of travel, I hope you enjoy this video and those to come! \n\n***Please note the audio may be suboptimal in some places to cover claimed music; my apologies!***\n\nPlease comment and tell me what you liked or didn't like about this video. Do you like more annotations as we walk? Maybe better footage of the art and exhibits? Is metadata interesting to you, like the time of the walk, direction, distance walked, etc.? \n\nCheck the chapters if you're interested in something specific!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every few weeks!\n\nThis video was recorded in September 2023.\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: marshmallowbat\n\n00:00 - Intro\n00:30 - Concourse T (American, United, Delta, JetBlue, Alaska)\n18:20 - Concourse A (Delta)\n33:05 - Concourse B (Delta)\n49:00 - Concourse C (Southwest, Delta)\n01:02:25 - Concourse D (Delta, Spirit, Frontier, Alaska)\n01:16:15 - Concourse E (Delta, International, Spirit, Frontier, Southern Airways)\n01:40:20 - Concourse F (Delta, International, Air Canada)\n01:49:05 - Conclusion and End Screen\n\nThanks again for watching, and keep moving forward!\n\n#atlanta #atl  #airport #aviation #ambient #travel  \n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nNikon D3200 (18-55/55-200mm)\nFeiyuTech G6 Gimbal\nAdobe Premiere Pro\nIrfanView",
 "source": "youtube",
 "source_id": "3qcB92eqAIQ",
 "type": "Aiport Tour",
 "company": "",
 "stops": ["ATL"],
 "postdate": "2024-01-27T16:00:05Z"
}