{
 "name": "Biman Bangladesh Full Flight | McDonnell Douglas DC-10 | Final DC10 Passenger Flight",
 "description": "A full length, full flight video in real time onboard Biman Bangladesh Airlines Douglas DC10 S2-ACR, operating the last ever passenger carrying flight of the McDonnell Douglas DC10 from Birmingham on 24 February 2014.  The flight, operated by Biman Bangladesh Airlines DC-10-30 S2-ACR from Birmingham (BHX), was arranged for enthusiasts and people involved in the history of this magnificent aircraft to have the opportunity to fly on her one last time before she is scrapped in Bangladesh.\n\nThe video includes the full flight including pushback, taxi, takeoff, the cruise and landing back at Birmingham, as well as a water canon salute as we taxied onto stand.  As you will see the flight was mostly spent by people savouring every inch of this marvellous aircraft, with not a lot of sightseeing being done!\n\nThe flight attracted a great deal of media interest and there were numerous TV crews on the flight and on the ground to broadcast our arrival live.\n\nWindow shots are taken from seat 15A.\n\nPlease comment/subscribe!\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "q6PFs_eGnBY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-02-25T10:00:07Z"
}