{
 "name": "British Airways Full Flight | London to Madrid | Boeing 767-300ER *With ATC*",
 "description": "A full length full flight video in real time with British Airways from London Heathrow to Madrid, onboard Boeing 767-300ER G-BNWZ operating flight BA456 on October 18 2014.\n\nATC is included for the approach and landing into Madrid.\n\nWe pushback from gate A15 at Heathrow's Terminal 5, before taxying straight out to runway 27R for departure.  After departure we turn left towards Brighton as the sun starts to rise.  After crossing the English Channel we head towards Paris climbing to 35,000ft, before a right turn takes us in the direction of the Pyrenees and the Spanish border.  We commence our approach around 60 miles out of Madrid, making a series of turns before making a final approach to runway 32R at Madrid, with a smooth touchdown and taxi into Barajas's Terminal 4 Satellite pier.\n\nVideo taken from seat 6A.\n\n//\nCompleto vídeo vuelo de puerta a puerta a bordo de British Airways Boeing 767-300 G-BNWZ, operando BA456 vuelo de Londres Heathrow (LHR) a Madrid Barajas (MAD) el 18 de octubre de 2014. * Cada minuto del vuelo incluido de puerta a puerta, y el ATC en el enfoque en Madrid *\n\nNos retroceso de A15 puerta en la Terminal 5 de Heathrow, antes del rodaje directamente a la pista 27R para la salida. Después de la salida giramos a la izquierda hacia Brighton como el sol comienza a subir. Después de cruzar el Canal Inglés nos dirigimos hacia París escalada a 35,000ft, antes de girar a la derecha nos lleva en la dirección de los Pirineos y la frontera española. Comenzamos nuestro enfoque a unos 60 kilómetros de Madrid, por lo que una serie de vueltas antes de hacer una aproximación final a la pista de aterrizaje 32R en Madrid, con un touchdown suave y taxis en la Terminal 4 de Barajas muelle de satélite.\n\nVídeo tomado de 6A asiento.\n\n//\n\nAirline:  British Airways\nFlight:  BA456\nAircraft:  Boeing 767-300 G-BNWZ\nFrom:  London Heathrow (LHR)\nTo:  Madrid Barajas (MAD)\nDeparture:  06:43\nArrival:  09:46\nFlight Time:  02:03\nSeat:  6A\nFlight Path:  http://goo.gl/LzDiuc\n\nPlease enjoy the flight and feel free to subscribe/comment!\n\nGoPro Hero 3\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "uhFAecZv-Cw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-11-07T09:17:17Z"
}