{
 "name": "Flybe Full Flight | Edinburgh to Birmingham | Embraer E175",
 "description": "A full length full flight video in real time with Flybe, from Edinburgh to Birmingham, operating flight BE852 on October 31 2014.\n\n*Every minute of the flight included from gate to gate*\n\nWe start our flight on stand at Edinburgh, and after pushback we taxi to runway 24, where after a short delay we commence our flight.  Once above the clouds we get a good view of the sun starting to set.  After a brief period inside of cloud at 27,000ft, we emerge just in time to see the last moments of daylight.  The sky is still bright but the ground is in darkness under the cloud in a unique view.  We commence our approach to Birmingham making twists and turns over the bright neon lights of the city, illuminated beautifully by thousands of streetlights with the sky still bright above.  Once we land on runway 15 we taxi to the terminal, pulling alongside an Eastern Airways Jetstream, pushing back for her flight to Scotland.\n\nVideo taken from seat 16D.\n\nAirline:  Flybe\nFlight:  BE852\nAircraft:  Embraer E-175 G-FBJE\nFrom:  Edinburgh (EDI)\nTo:  Birmingham (BHX)\nDeparture:  16:37\nArrival:  17:23\nFlight Time:  00:46\nSeat:  16D\nFlight Path:  http://goo.gl/P6BN4M\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "Jbbp7N5sjuU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-12-19T08:59:41Z"
}