{
 "name": "Germanwings Full Flight - Birmingham to Berlin Tegel (Airbus A319)",
 "description": "Full length, uncut flight on 4U8331 from Birmingham to Berlin Tegel on Monday, July 21 2014, onboard Germanwings Airbus A319 D-ACNQ.  Includes the entire flight, from pushback in Birmingham to engine shutdown in Berlin.  Video taken from seat 11A.  \n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\n*Every minute of the flight included from pushback to pulling on stand.*\n\nFull Flight Video auf 4U8331 von Birmingham nach Berlin Tegel am Montag, 21. Juli 2014 an Bord von Germanwings Airbus A319 D-ACNQ. Umfasst die gesamte Flug, aus Pushback in Birmingham nach Abschalten des Motors in Berlin. Video vom Sitz 11A. * Jede Minute des Fluges von Pushback enthalten, um Ziehen am Ständer. *\n\nFull route:  http://goo.gl/S5m3Cw\nFlight Details:  http://goo.gl/Ygtda5\n\nPlease comment/subscribe!\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "7-tnhRfG24U",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-07-21T21:51:50Z"
}