{
 "name": "Baltimore/Washington International Airport - BWI - Complete 4K Airport Tour",
 "description": "Thanks for joining me on this complete airport tour of Baltimore Washington Airport! Today we're exploring one of the busiest airports in the country and a primary hub for Southwest Airlines, including all five of its airside terminals, ground transportation, baggage, and navigating between it all. Baltimore's 80+ destinations and 14 different airline offerings keep Baltimore and the capitol region connected with the rest of the country and internationally. Despite its primary identity as a Southwest hub, there's a lot more to see at BWI!\n\nCheck the times below to jump to the area you need!\n\n00:00 - Intro\n00:40 - Terminal Overview\n01:15 - Delta\n01:35 - United\n02:00 - Frontier, Sun Country, Alaska\n02:25 - Allegiant\n02:40 - Spirit\n03:05 - Boutique/Southern Airways\n03:35 - International/AMC\n04:30 - American/Contour\n05:00 - Southwest\n07:00 - Observation Gallery and Thurgood Marshall Exhibit\n07:30 - Baggage Claims and Ground Transportation Shuttles\n08:25 - Commuter Rail Station\n08:55 - Light Rail Station\n\nI try to cover what I can in a ten-minute video, but I'm sure there are things I've missed; please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about BWI!\n\nFinally, let me know where you'd like to see next! Now that COVID-19 cases remain low and I've been vaccinated, I'm able to travel with more confidence. Stay tuned for new flight and airport videos every two weeks!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\nThanks again for watching, and keep moving forward!\n\n#airport #airporttour #aviation #travel #bwi #baltimore #southwestairlines #southwest \n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nClip Studio Paint\nAdobe Premiere Pro\nIrfanView\nAudacity\n\nMusic\nEkans - Molife\nMemories Warm You - Molife\nImprint - Molife\nSwerve - Molife\n\nSources\nbwiairport.org\nflightaware.com\nmiamiherald.com\nallegiantair.com\nflyfrontier.com\nwikipedia.com",
 "source": "youtube",
 "source_id": "_UTQhCszbYY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-08-15T23:59:46Z"
}