{
 "name": "Memphis International Airport - Complete HD Airport Tour",
 "description": "Thanks for joining me on this airport tour of Memphis International Airport! Today's tour covers the busiest cargo airport on Earth thanks to the FedEx Superhub located at MEM, but it's no slouch for passengers either! \n\nThe airport's retro feel and historic design complements a service profile across eight airlines totaling around 600 weekly flights. This video covers the terminals, services, and facilities available for travelers at MEM, whether you're coming or going!\n\nI try to cover what I can in a short video, but I'm sure there are things I've missed; please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about MEM!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every two weeks!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n00:58 - Landside Terminals\n02:15 - Airside Terminals\n02:45 - American Airlines\n03:05 - United and Air Canada\n03:30 - Low-Cost Carriers\n04:10 - Delta\n04:50 - Southwest\n05:10 - New Airside Concourse\n05:35 - Arrivals, Baggage, and Ground Transportation\n06:30 - Parking and Rental Cars\n07:20 - Planespotting\n08:00 - Outro\n09:00 - End Screen\n\nThanks again for watching, and keep moving forward!\n\n#memphis #mem #airport #aviation #fedex #airporttour \n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nClip Studio Paint\nAdobe Premiere Pro\nIrfanView\nAudacity\n\nMusic\nCue Points - Dusty Decks\nCrate Concerto - Dusty Decks\nStone Cookies - Dusty Decks\nGramophone Glamour - Dusty Decks\n\nSources\nflymemphis.com\nflightaware.com\naa.com\nunited.com\ndelta.com\nflyfrontier.com\nsouthwest.com\naircanada.com\nallegiantair.com\nwikipedia.com",
 "source": "youtube",
 "source_id": "Zw2NSgJrwG8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-12-19T18:15:03Z"
}