{
 "name": "Raleigh-Durham International Airport - RDU - Complete Airport Tour",
 "description": "UPDATE 5/6/2022 ***Spirit now flies out of Terminal 1*** (thanks, @StefenScotten!)\n\nThanks for joining me on this complete airport tour of Raleigh-Durham International Airport, now in 4K! Today's tour covers one of the busiest and most modern airports in the Carolinas, whose two terminals offer comprehensive service to nearly fifty destinations around the US and internationally. RDU proves that investing in the future pays off now!\n\nCheck the times below to jump to the area you need!\n\n00:00 - Intro\n01:00 - Terminal 1 (Southwest, Spirit)\n02:00 - Transit between Terminals 1 and 2\n02:30 - Terminal 2 Overview\n03:10 - Fun Puzzle! Check the comments below!\n03:30 - Terminal 2 Security and Airside\n04:00 - Delta\n04:50 - American\n05:30 - United\n05:55 - JetBlue\n06:25 - Air Canada/Alaska\n06:40 - Frontier\n07:00 - Sun Country\n07:20 - Terminal 2 Airside\n07:50 - Airline Lounges\n08:00 - Arrival & Baggage Claim\n08:20 - Ground Transportation (Check if you're renting a car!)\n09:00 - Summation\n\nI try to cover what I can in a ten-minute video, but I'm sure there are things I've missed; please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about RDU!\n\nFinally, let me know where you'd like to see next! Now that I've been vaccinated, I'm able to travel with more confidence. Stay tuned for new flight and airport videos every two weeks!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\nThanks again for watching, and keep moving forward!\n\n#airport #airporttour #aviation #travel #rdu #raleigh \n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nClip Studio Paint\nAdobe Premiere Pro\nIrfanView\nAudacity\n\nMusic\nInner Circle - Tape Machines\nFrom the Cliffside - Tape Machines\nBorrowed Matches - Tape Machines\n\nSources\nrdu.com\nflightaware.com\naa.com\nunited.com\ndelta.com\nflyfrontier.com\nwikipedia.com",
 "source": "youtube",
 "source_id": "oQi6uQPz1lE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-08-29T17:00:32Z"
}