{
 "name": "Delta CRJ700 Full Flight Experience - Louisville (SDF) to Detroit (DTW)",
 "description": "Thanks for watching this Full Flight Experience!  For our ninth anniversary, my wife Beth and I decided to use some Delta miles and head over to Europe for a three-country tour. Our trip in November 2018 is one we'll never forgot; we still talk about it and reminisce fondly of the beautiful places we visited, fun people we met, and the time we spent together.\n\nThe fun started at our home airport in Louisville, and it never let up. This seven-flight, one-train journey started at SDF on a quiet fall day. This first leg is one I've flown many times before, but the thrill of the trip spurs me on!  Detroit is a frequent jumping-off point for international trips to Europe and Asia, so it's a great place to get this trip going.\n\nWhile I've done a photo tour on my blog Miles By Foot, I took the opportunity to show you Louisville's humble two concourses, a day in the life of a bustling, regional airport. You'll follow us from boarding to pushback, take-off to landing, and taxiing up before deplaning for our next great adventure.\n\nThanks for flying in, and stay tuned for the upcoming legs of this journey to and from the British Isles!\n\n--------------------------------\n\nFlight Information\nAirline: Delta Airlines (GoJet Airlines)\nFlight Number: DAL6177\nDate of Flight: Tuesday, November 6th, 2018\n\nOrigin Airport: Louisville International Airport (KSDF/SDF)\nDestination Airport: Detroit Metropolitan Wayne County Airport (KDTW/DTW)\n\nDeparting Gate: A5\nBoarding Time: 14:03 EST\nScheduled Departure: 14:22 EST\nActual Departure from Gate: 14:24 EST\nTakeoff Runway and Time: RWY 29 / 14:34 EST\n\nLanding Runway and Time: RWY 22R / 15:24 EST\nScheduled Arrival: 15:47 EST\nActual Arrival at Gate: 15:48 EST\nArriving Gate: A61\n\n--------------------------------\n\nAircraft Information\nType: Bombardier CRJ-700\nRegistration: N3##CA \nAircraft Delivery: Fall 2012\nEngines: 2x GE CF34-8C\nSeat: 10C & 10D\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm\nCanon Vixia HFM30\nEdited in Adobe Premiere Pro/IrfanView\n\nAircraft and flight information from Planespotters.net and flightaware.com\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "ReAsR62Fu80",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-05-23T12:47:55Z"
}