{
 "name": "Full Flight Prague to Venice - Czech Airlines ATR-72 - Beautiful Alps, Approach over Venice!",
 "description": "Thanks for watching this Full Flight Experience!  For our ninth anniversary, my wife Beth and I decided to use some Delta miles and head over to Europe for a three-country tour. Our trip in November 2018 is one we'll never forgot; we still talk about it every day and reminisce fondly of the beautiful places we visited, the wonderful people we met, and the time we spent together.\n\nWe spent four days in Berlin, took a train to Prague and spent four more days in the Czech Republic. The last stop on our trip was Venice for three last days in Europe before heading home to the U.S. Thankfully, this short flight to our final destination covered some beautiful landscape, including the Italian Alps, the Bohemian countryside, and finally, a parallel descent right next to the world-famous Venetian lagoon.\n\nThis video covers our arrival at PRG, Prague International Airport, some diverse planespotting, then a take-off to landing review of our flight, as well as in-flight materials and procedures. The roar of a turboprop ATR72 always gets me excited for the trip ahead; thanks for flying in, and stay tuned for the upcoming legs of this journey to and from Europe!\n\n\n--------------------------------\n\nFlight Information\nAirline: Czech Airlines\nFlight Number: CSA734\nDate of Flight: Friday, November 16th, 2018\n\nOrigin Airport: Václav Havel Airport Prague (LKPR/PRG)\nDestination Airport: Venice Marco Polo Airport (LIPZ/VCE)\n\nDeparting Gate: C14\nBoarding Time: 12:50 CET\nScheduled Departure: 12:20 CET\nActual Departure from Stand: 13:17 CET\nTakeoff Runway and Time: RWY 30 / 13:23 CET\nLanding Runway and Time: RWY 04R / 14:59 CET\nScheduled Arrival: 14:00 CET\nActual Arrival at Remote Stand: 15:08 CET\n\n--------------------------------\n\nAircraft Information\nType: ATR72-500\nRegistration: OK-NFV\nAircraft Delivery: April 2008\nSeat: 5D & 5F\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm\nCanon Vixia HFM30\nEdited in Adobe Premiere Pro/IrfanView\n\nAircraft, airline, and flight information from airfleets.net and flightaware.com, and wikipedia.com.\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "BM85upS99Cw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-09-07T23:22:22Z"
}