{
 "name": "Glasgow (GLA) to Amsterdam (AMS) on a KLM Boeing 737 Full Flight",
 "description": "Thanks for watching this Full Flight Experience!  In May 2017 I had the opportunity to take a research trip to the Highlands of Scotland and experience some of my favorite locales in the world!  There were plenty of opportunities for walking, exploring, and recording my discoveries, and the fun started even before I arrived.\n\nThis six-part journey continues after a fun flex day in Glasgow, a wonderful city to visit if you ever get the chance: many free museums, historic buildings, great food, and excellent people! No matter your interests, Glasgow is a great place to visit in transit or as a destination.\n\nThis KLM flight took off the following morning, Sunday, and takes out of cloudy, gray Scotland, over the English Channel, and into the Netherlands. Our destination, Schiphol Airport, is one of the world's busiest and most enjoyable airports to transit or spend some time in! The flight takes us low over the channel, over picturesque Dutch suburbia, and down to a soft, on-time landing, with the return to America just a few minutes later!\n\nThanks for flying in, and stay tuned for the final leg of this journey to and from the British Isles!\n\n--------------------------------\n\nFlight Information\nAirline: KLM\nFlight Number: 1472\nDate of Flight: Sunday, May 21st, 2017\n\nOrigin Airport: Glasgow International Airport (EGPF/GLA)\nDestination Airport: Amsterdam Airport Schiphol (EHAM/AMS)\n\nDeparting Gate: 36\nBoarding Time: 08:58 BST\nScheduled Departure: 09:15\nActual Departure from Gate: 09:18 \nTakeoff Runway and Time: RWY 23 / 09:27 \nLanding Runway and Time: RWY 18 (Polderbaan) / 11:36 CEST\nScheduled Arrival: 11:50\nActual Arrival at Gate: 11:50 CEST\nArriving Gate: D5\n\n--------------------------------\n\nAircraft Information\nName: Koningsieder\nType: Boeing 737-700\nRegistration: PH-BGG\nAircraft Manufacture: Mar 2009\nAircraft Delivery: Mar 2009\nEngines: 2x CFM56-7\nSeat: 8F Assigned / 8A Actual\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm\nCanon Vixia HFM30\nEdited in Adobe Premiere Pro/IrfanView\n\nAircraft, flight information, and facts developed from Planespotters.net, flightaware.com, Google Maps, and wikipedia.com.\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy to work with you!",
 "source": "youtube",
 "source_id": "xM_tgPCvV4Q",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-02-07T08:04:31Z"
}