{
 "name": "KLM 737 Full Flight Experience - Amsterdam (AMS) to Berlin Tegel (TXL)",
 "description": "Thanks for watching this Full Flight Experience!  For our ninth anniversary, my wife Beth and I decided to use some Delta miles and head over to Europe for a three-country tour. Our trip in November 2018 is one we'll never forgot; we still talk about it every day and reminisce fondly of the beautiful places we visited, the wonderful people we met, and the time we spent together.\n\nA brief layover in Amsterdam let us stretch our legs, pick up some Holland souvenirs, and grab a snack before our final hop to Berlin Tegel aboard a KLM Boeing 737, a short, one-hour flight to our final destination. \n\nThis video will take you from the pre-board to pushback, takeoff to landing and taxi at Berlin's Tegel Airport. It's a truly unusual international airport, one soon to be retired, as Berlin's Brandenburg Airport's imminent opening will consolidate the city's two airports. The final approach was beautiful, descending over the autumn trees north of Berlin.\n\nThanks for flying in, and stay tuned for the upcoming legs of this journey to and from Europe!\n\nVideo Timeline\n00:30 - Boarding\n00:45 - Pushback\n03:00 - Takeoff\n06:00 - At Altitude\n07:30 - Approach\n09:00 - Landing\n10:45 - Gate Arrival\n--------------------------------\n\nFlight Information\nAirline: KLM\nFlight Number: KLM984\nDate of Flight: Wednesday, November 7th, 2018\n\nOrigin Airport: Amsterdam Schiphol Airport (EHAM/AMS)\nDestination Airport: Berlin Tegel Airport (EDDT/TXL)\n\nDeparting Gate: D48\nBoarding Time: 09:32 CET\nScheduled Departure: 09:50 CET\nActual Departure from Gate: 09:54 CET\nTakeoff Runway and Time: RWY 24 \"Kaagbaan\"/ 10:00 CET\nLanding Runway and Time: RWY 26R / 10:58 CET\nScheduled Arrival: 11:10 CET\nActual Arrival at Gate: 11:03 CET\nArriving Gate: 11\n\n--------------------------------\n\nAircraft Information\nType: Boeing 737-9K2\nRegistration: PH-BXS \nAircraft Delivery: October 2001\nEngines: 2 x CFM56-7B26\nSeat: 24E & 24F\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm\nCanon Vixia HFM30\nEdited in Adobe Premiere Pro/IrfanView\n\nAircraft and flight information from airfleets.net and flightaware.com.\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "WgXwOlERMk4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-07-27T17:16:45Z"
}