{
 "name": "SPECTACULAR Rainy Plane Spotting at Dublin Airport! Aer Lingus, Etihad, and more!",
 "description": "A very special thank you to Jonathan Winton for making the trip over to Dublin for some spotting with me! This video wouldn't have been nearly as watchable had he not let me borrow his tripod for a few of the aircraft that day. Go check out his channel: https://www.youtube.com/flyhellas101\n\nA few days after arriving from Calgary on the inaugural WestJet 787 flight, I met up with Jonathan to get a morning's worth of action at Dublin Airport before I left for a short side trip to Poland. The forecast was not at all promising, as you'll see it wasn't bad early in the morning, but it ended up pouring and we eventually gave in, but not before getting some amazing rain spray shots.\n\nOur arrangement was that I could film the \"less interesting\" aircraft with his tripod, while I took photos of the things he wanted to film on his own. Having zero Aer Lingus footage on my channel until now, I was perfectly fine with that arrangement! Enjoy this special Irish plane spotting compilation.\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nSOCIAL MEDIA\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\nFacebook: https://www.facebook.com/AlexPAviation\n\nOFFICIAL WEBSITE: http://www.alexpraglowski.ca\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\n- EI-EWR Aer Lingus A330-200 - from Toronto-Pearson (CYYZ)\n- D-AEAS EAT Leipzig A300B4-600R(F) - from East Midlands (EGNX)\n- TF-BBL Bluebird Nordic B737-400 - to Reykjavik-Keflavik (BIKF)\n- EI-EAV Aer Lingus A330-300 - from Newark Liberty (KEWR)\n- EI-CVC Aer Lingus A320-200 - to Catania-Fontanarossa (LICC)\n- EI-GAL Aer Lingus A320-200 - to Lyon (LFLL)\n- EI-DWO Ryanair B737-800 - to Munich (EDDM)\n- EI-RJD Aer Lingus (CityJet) Avro RJ85 - to London City (EGLC)\n- EI-CPE Aer Lingus A321-200 - to Rome-Fiumicino (LIRF)\n- EI-DEI Aer Lingus A320-200 - to Amsterdam-Schiphol (EHAM)\n- EI-DHR Ryanair B737-800 - from London-Luton (EGGW)\n- EI-DUZ Aer Lingus A330-300 - to Malaga (LEMG)\n- EI-DVM Aer Lingus A320-200 - to Naples (LIRN)\n- A6-ETH Etihad Airways B777-300ER - from Abu Dhabi (OMAA)\n- N287AY American A330-200 - from Charlotte/Douglas (KCLT)\n- A7-BCT Qatar Airways B787-8 - from Doha (OTHH)\n- EI-FJV Norwegian B737-800 - from Hamilton (CYHM)\n- EI-GAJ Aer Lingus A330-300 - from New York (KJFK)\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2019\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission.\n\nMEDIA: Please contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "dIVr2pRFpP8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-06-18T23:00:05Z"
}