{
 "name": "Summertime Heavy Aircraft at Calgary International Airport! 20+ Minutes of Plane Spotting",
 "description": "While searching for footage for my earlier videos on the potential deals regarding WestJet and Air Transat, I came across a day's worth of footage from 2017 that I had never posted... Until now!\n\nThe summertime traffic hasn't changed a whole lot since 2017, with the obvious exception of WestJet's brand new Dreamliners, and Air Canada 787s in place of the 777s.\n\nNonetheless, I hope you enjoy these 12 heavy aircraft (Yes, the 757 is a grey area) arriving and/or departing a sunny Calgary International Airport.\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nSOCIAL MEDIA\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\nFacebook: https://www.facebook.com/AlexPAviation\n\nOFFICIAL WEBSITE: http://www.alexpraglowski.ca\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nAIRCRAFT INFORMATION:\n(in order of appearance)\n\n- C-GUFR Air Transat A330-243 - From London-Gatwick (LGW/EGKK)\n- C-FIUJ Air Canada B777-200LR - From Frankfurt (FRA/EDDF)\n- PH-AKF KLM Royal Dutch Airlines A330-303 - To Amsterdam-Schiphol (AMS/EHAM)\n- HB-JMG Edelweiss Air A340-313 - From Zurich-Kloten (ZRH/LSZH)\n- C-FIVM Air Canada B777-333ER - To London-Heathrow (LHR/EGLL)\n- HB-JMG Edelweiss Air A340-313 - To Zurich-Kloten (ZRH/LSZH)\n- C-FCAF Air Canada B767-375ER - From Toronto (YYZ/CYYZ) * now retired\n- N342UP UPS B767-34AERf(WL)  - To Sioux Falls (FSD/KFSD)\n- C-FIUJ Air Canada B777-233LR - To Frankfurt (FRA/EDDF)\n- C-FOGJ WestJet B767-338ER(WL) - To London-Gatwick (LGW/EGKK)\n- C-GCJT Cargojet Airways B757-223PCF(WL) - To Cincinatti (CVG/KCVG)\n- C-FCAF Air Canada B767-375ER - To Toronto (YYZ/CYYZ) * now retired\n- N656FE Federal Express A300f4-605R - To Memphis (MEM/KMEM)\n- C-FMEK Morningstar Air Express B757-2B7SF - To Winnipeg (YWG/CYWG)\n- G-ZBJC British Airways B787-8 Dreamliner - From London-Heathrow (LHR/EGLL)\n- C-FIVM Air Canada B777-333ER - To London-Heathrow (LHR/EGLL)\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2019\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission.\n\nMEDIA: Please contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "eCZ7_4xldaA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-06-07T23:00:05Z"
}