{
 "name": "Delta Air Lines Refurbished 777 from SYD to LAX - NEW Delta One Suites",
 "description": "First of all, enjoy the special guest appearance by my friend -- and YouTube Star - Dennis Bunnik. Check out his channel here:\nhttps://www.youtube.com/channel/UCQrk97MBH6DToctKRfQJcNQ\n\nNow, on to the flight: This one had something special in store for me: My first trip on one of Delta Air Lines' refurbished Boeing 777's with Delta's new Delta One Suites. This is Delta Air Lines' flagship business class product, which has been expanded from its introduction on the Airbus A350. \n\nSlowly, Delta are upgrading their 777 fleet to incorporate these new cabins. The route between LAX and SYD isn't supposed to be served by these upgraded 777's with the Delta One Cabin until April of 2019, but today was my lucky day because the aircraft I was on - N706DN - had just been refurbished to incorporate the latest Delta Air Lines cabin interiors.\n\nIn this video, we'll explore the Delta One 777's cabins: The Delta Air Lines Economy Cabin, which is laid out in an industry-leading 3-3-3 configuration. The Delta Air Lines Premium Select cabin, which is laid out in a 2-4-2 configuration. And the Delta Air Lines Delta One - or Business Class - cabin, which is laid out in a 1-2-1 configuration. \n\nI'll share my impressions of Delta Air Lines Refurbished 777 with the New Delta One Suites: The good, the bad, and the ugly!\n\nWe'll go in-depth into the Delta One Suite, checking out the seat itself, the lie-flat bed, the food, the inflight entertainment, and the business class service. Was Delta's new Delta One Suite worth it? You be the judge!\n\nFor more trip reports, please subscribe to my channel!\nhttps://www.youtube.com/jebbrooksflies\n\nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n\nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nMusic:\nSun Ray Falls - Roral Ceef\nStarting Point - Roral Ceef\nAll Day in Bed - Bang Bang\nHey Ally - Roral Ceef",
 "source": "youtube",
 "source_id": "65zaL9EqB3I",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-12-15T14:03:01Z"
}