{
 "name": "Malaysia Airlines A350 FIRST CLASS from KUL - SYD",
 "description": "Ever since they launched it, I wanted to try Malaysian Airlines A350.\n\nAnd...I recently learned from the website \"One Mile At a Time,\" that Malaysian Airlines A350 would fly, on a limited basis, from its home in Kuala Lumpur to Sydney. \n\nBecause was heading to Singapore (on the inaugural SQ21 from Newark, \"The Longest Flight in the World\") and needed to get to Sydney, I decided to book Seat 1A, which is ordinarily a First Class seat. This was a particularly great opportunity because Malaysian Airlines A350 includes a First Class seat, but there's no First Class service on this flight. Instead, the \"soft product\" would be Business Class. \n\nI figured this would be a great idea to get a sense of how Malaysian Airlines A350 was to fly. I really like the A350 from a passenger experience perspective, so the opportunity to experience how Malaysian Airlines A350 felt was one that excited me.\n\nJoin me in this video to experience the incredible Malaysian hospitality on the short, 35 minute flight from Singapore to Kuala Lumpur (on a Malaysia Airlines 737) and then the longer eight hour, 20 minute flight to Sydney (on a Malaysia Airlines A350-900).\n\nWe'll also explore the Business Class AND First Class lounges at KUL.  \n\nLet me know what you think of this (somewhat) unusual service from Malaysia Airlines!\n\nPaul Stewart's FIRST CLASS Malaysia Airlines Review:\nhttps://www.youtube.com/watch?v=bf5D-t8_0J4\n\nOne Mile At a Time:\nhttps://onemileatatime.com/\n\nThe World's Longest Flight:\nhttps://www.youtube.com/watch?v=xyWyonGkHmM&t=224s\n\nFor more trip reports, please subscribe to my channel!\nhttps://www.youtube.com/jebbrooksflies\n\nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n\nAnd for planes on Instragram:\nhttps://www.instagram.com/jebbrooksfl...\n\nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nMusic:\nEnglish Breakfast - Jobii\nSnake Plant - Jobii\nExcitement - Traditional\nColumbus Park - Jobii\nBrunch - Jobii",
 "source": "youtube",
 "source_id": "iAoRZOrHtBA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-10-19T09:02:54Z"
}