{
 "name": "Porter Airlines Bombardier Q400 Trip Report",
 "description": "Are you considering a trip to Toronto, Canada? If so, you may want to consider what may be North America's Best Regional Airline! \n\nA Porter Airlines Bombardier Q400 may be a great choice. Porter Airlines' fleet of Q400 's will take you from many cities throughout North America straight into Billy Bishop Airport located within Toronto's city center. Further, Porter Airlines offers a free shuttle (ferry and bus) into the heart of downtown Toronto!\n\nThe Porter Airlines Bombardier Q400 even offers a unique view of Toronto's skyline on approach. Be sure to watch to the end to see it! \n\nJoin me on this flight from Washington Dulles International Airport to Billy Bishop Toronto City Airport. Porter Airlines serves Billy Bishop Airport from cities throughout Canada and the United States with their fleet of Bombardier Q400 Turboprops.\n\nThe Bombardier Q400 is a remarkable airplane because of its short runway performance, exceptional passenger comfort, and its quiet operation. Let me know what you think of the airplane in the comments!\n\nPorter Airlines takes the Bombardier Q400 to a new level with unique passenger focus for such a short flight. The hour I spent in the Porter Airlines Bombardier Q400 was simply not enough. This may just be the best regional airline on the planet, but judge for yourself.\n\nYou'll be able to check out incredible Canadian snacks and wine as well as the impressive service and unique views from the window. \n\nBe sure to watch the video to the end so you don't miss the approach into Billy Bishop Toronto City Airport. It's beautiful from the window seat in row 5 of the Porter Airlines Bombardier Q400.\n\nBut, what do you think?\n\nThumbnail image from Wiki Commons\n\nFor more trip reports, please subscribe to my channel!\nhttps://www.youtube.com/jebbrooksflies\n\nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n\nAnd for planes on Instragram:\nhttps://www.instagram.com/jebbrooksfl...\n\nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nMusic:\nGreen Summer Waves – Qeeo",
 "source": "youtube",
 "source_id": "PokekGdS1k0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-10-06T02:05:42Z"
}