{
 "name": "The Longest Flight in the World | A350-900ULR Business Class Singapore Airlines",
 "description": "How do you survive the longest flight in the world? By flying with Singapore Airlines onboard their brand new Airbus A350-900ULR, of course! The plane has advanced technology to support such an epic journey and the meals are carefully planned to help reduce jetlag. \n\nBut, check all of that out for yourself by watching this video about the longest flight in the world, the inaugural New York to Singapore flight onboard a brand new Airbus A350-900ULR Singapore Airlines.\n\nSingapore Airlines held a very impressive party. The video includes coverage of all of the festivities at the gate as well as the action onboard. You'll see the food served on the longest flight in the world as well as the entertainment and amenities provided on the inaugural New York to Singapore longest flight in the world. \n\nPerhaps the highlight of the Longest Flight in the World are the views from the Singapore Airlines Airbus A350-900ULR's massive windows. You'll see Canadian landscapes, icebergs, and the vastness of the Russian and Mongolian Steppe. \n\nI wasn't alone on this trip. I was joined by many other #AvGeeks including my friend Sam Chui who was also on the flight so he could experience the Longest Flight in the World with Singapore Airlines!\n\nLeave me a comment. How do you think you'd fare on the longest flight in the world? Would you feel refreshed afterwards? Or would you be wiped? How do you think the Singapore Airlines Airbus A350-900ULR did? Let me know!\n\nFor more trip reports, please subscribe to my channel!\nhttp://jebbrooksflies.com\n\nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n\nAnd for planes on Instragram:\nhttps://www.instagram.com/jebbrooksfl...\n\nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nMusic:\nRising Spirit - Josef Falkenskold\nTriumphant Orchestral 2 - Gavin Luke\nPerfect Moment 3 - Josef Falkenskold\nFlying Freedom - Anders Ekengren\nPerfect Moment 1 - Josef Falkenskold",
 "source": "youtube",
 "source_id": "xyWyonGkHmM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-10-13T14:52:07Z"
}