{
 "name": "6 HOURS ON A 737! Flying the Alaska Milk Run!",
 "description": "Try Dashlane free on your first device: https://www.dashlane.com/noel Use the coupon code ‘NOEL’ to get 25% off Dashlane Premium\nI took the Alaska Milk Run on Alaska Airlines Boeing 737s, hopping up the coast of Alaska!\n\n=====\nCURVE: Get £5 free and your free Curve card!  https://www.curve.app/en-gb/join#NOEL5\n(affiliate links)\n\nEARLY ACCESS, MERCH AND MORE - SUPPORT ME ON PATREON! http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE!\n\nBig thanks to my Patrons!  Join them at patreon.com/inflightvideo\n\n#Travel 15,Aaron Adams, Alan Williamson, Alyssa Parssinen, Andrew Laybourne, Andrew S, Anthony Cavaco, Bob Barton, Brandon Promeneur, Daniel Hornett, Daniel Juschus, David Anderson, Eirik Christoffersen, Elliot Marsh, Graham brownlow, Grant Kennedy, Jake Paul, James Cardwell, Jandus Jacobsen, Joao Pedro Wilshusen , Joshua bedel, Kieran Butterfield\nMark Weatherley, Matthew Ogilvie, Max Lavallee, Mellows, Mike Meloni, Mike Up, Mike Wooldridge, Nathan Say, Neil Turner, Paul Fitchen, Pete Chadwick, Peter Smets, QFS Aviation, Rafal K, Ryan Wylde, Sam Morris, Sam Robinson\nSam Yates, Sarah Clark, Simon Casey, th3bubbanator, Vic German, Will Sparrow, Zarniwoop B\n=====\nCHECK OUT PRIORITY PASS FOR LOUNGE ACCESS - 10% DISCOUNT FOR MY VIEWERS: https://bit.ly/2SVYYqc \nCURVE: Get £5 free and your free Curve card!  https://www.curve.app/en-gb/join#NOEL5\n(affiliate links)\n\nEARLY ACCESS, MERCH AND MORE - SUPPORT ME ON PATREON! http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY TRIP REPORTS!\n\nBig thanks to my Patrons!  Join them at patreon.com/inflightvideo\n\nAaron Adams, Aaron Loo, Alan Williamson, Andrew S, Anthony Cavaco, Bob Barton, Brandon, Brandon Promeneur, Chris Armstrong, Daniel Holm, Daniel Hornett, Daniel Juschus, Dkentflyer, Graham brownlow, Grant Kennedy, Ice Hole, James Cardwell, Jay Shepherd, Jeffrey R. Williams. Joao Pedro Wilshusen, Johnathan Hugh Bray, Jon Clarke, Jonathan, Joseph Dawson, Jude, Kieran Butterfield, Kimmo Blom, M.van.Cappellen, Mark Weatherley, Max Lavallee, Max Vaitseshyk, Michael Alley, Mike Wooldridge, Neil Turner, Paul Birkbeck, Paul Fitchen, Peter Alden, Peter Smets, Phillip Ressler, QFS Aviation. Ryan Wylde, Sam Stevens, Sam Yates, Sarah Clark\n\nEQUIPMENT (affiliate links)\nGoPro Hero 7 https://amzn.to/2SVH1er\nFeiyutech G6 Gimbal https://amzn.to/2NsNXd7",
 "source": "youtube",
 "source_id": "Ooj3CUmh6dc",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-03-21T11:59:46Z"
}