{
 "name": "Lufthansa 747-8i [D-ABYL] Firm Windy Landing at Chicago O'Hare ᴴᴰ",
 "description": "Hello everybody, happy Halloween and Happy Heavy Aircraft Friday! Here is first flight on the 747-8 landing in Chicago, the home of the very man who started Heavy Aircraft Friday, O'Hare Aviation himself. The flight was very nice and the service was exceptional for economy, as it always is with Lufthansa! The approach was spectacular as well, with the whole airport visible right in front of my eyes. Final approach was very windy though, and as you'll see, the ailerons were all over the place! I managed to get a picture in picture view of the nose camera on my IFE screen as well, like I did with the A380. So, I hope you enjoy and watch in HD!\n\nThanks for watching! Please comment, rate, and subscribe!\n____________________________________________________\n\nFLIGHT INFO\nAirline: Lufthansa (DLH/LH)\nAircraft: Boeing 747-8 Intercontinental\nAircraft Name: \"Hessen\"\nLivery: Standard\nEngines: 4x GEnx-2B67\nSeat: 30K\nRegistration: D-ABYL \nRoute: FRA-ORD\nCallsign: Lufthansa 430 Heavy\nRunway used: 10C\nTaxiway(s) used: HH, P, GG, D, D4\nFlightAware: http://flightaware.com/live/flight/DABYL\n____________________________________________________\n\nVIDEO LOG: \n00:13 - Flying over Lake Michigan on approach\n00:20 - Still approaching/descending, and Chicago O'Hare International Airport comes into view, several close up shots\n01:09 - Banking, heading west, ORD visible just above the wing\n02:30 - ORD comes back into view, under the wing. If you hear a camera shutter clicking, that's me attempting to take pictures while filming :P\n03:24 - Zooming in on the SE Cargo Ramp\n03:50 - Making a quick bank to the right, flaps begin extending\n05:25 - Banking to the north now, getting ready to line up with Runway 10C\n07:35 - Lined up with the runway, beginning approach\n08:13 - Full flaps selected\n08:44 - Picture in picture view of my IFE screen, showing the view from the nose camera, lots of aileron action going on\n09:36 - Short final, tons of aileron movement\n10:01 - A firm but not too hard of a touchdown\n10:22 - Eva Air Cargo 747 visible in the background\n11:00 - Exiting Runway 10C at Taxiway HH, post-landing announcement begin\n12:40 - Asiana Airlines 777-200ER close up after departing Runway 4R (looks like it)\n13:30 - Turning into our gate\n14:04 - Final stop\n____________________________________________________\n\nPrevious video: https://www.youtube.com/watch?v=_NilBsHcB-w\nFacebook: http://www.facebook.com/dude8472productions\nMy Channel: http://www.youtube.com/dude8472productions\nGoogle Plus: http://www.google.com/+dude8472productions\nSubscribe: http://www.youtube.com/subscription_center?add_user=dude8472productions\nMy Website: http://www.dude8472productions.com\n____________________________________________________\n\n© dude8472productions 2014\n\nThis video is the property of dude8472productions and may not be used in any way without permission.",
 "source": "youtube",
 "source_id": "sM3XX48b6Ko",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-11-01T03:49:23Z"
}