{
 "name": "Lufthansa 747-8i [D-ABYL] Powerful Cloudy Takeoff from Frankfurt! ᴴᴰ",
 "description": "My very first flight on the 747-8 Intercontinental! The flight was very pleasant, although we left about 30 minutes late due to, what the captain told us, was crowded skies over the UK that day. Those clouds that you can see during the taxi are quite menacing, but thankfully the captain avoided the worst of it. This video features a head-on look at the aircraft from the terminal, a very fast pushback, the full taxi to the runway, with close ups of several aircraft, and finally, the takeoff roll and climb out, with the flaps retracting. I hope you enjoy, and watch in high definition!\n\nThanks for watching! Please comment, rate, and subscribe!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFO\nAirline: Lufthansa (DLH/LH)\nAircraft: Boeing 747-8 Intercontinental\nAircraft Name: \"Hessen\"\nLivery: Standard\nEngines: 4x GEnx-2B67\nSeat: 30K\nRegistration: D-ABYL \nRoute: FRA-ORD\nCallsign: Lufthansa 430 Heavy\nRunway used: 25C\nTaxiway(s) used: N8, L, L1\nFlightAware: http://flightaware.com/live/flight/DABYL\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nVIDEO LOG: \n00:13 - Exterior head-on view of our aircraft\n00:50 - Pushback commences, surprisingly fast\n02:28 - Hopefully we're not flying into those clouds...\n02:58 - Flaps begin extending, and flight controls are checked\n03:40 - Flaps fully extended\n03:45 - Taxi begins\n05:15 - After passing several Lufthansa jumbos sitting at their gates, we pass the Lufthansa Technik hangar\n05:50 - A Condor 757-300 in their new livery! I still think grey and yellow is a strange combination for an airline livery.\n06:20 - Turning onto Taxiway Lima\n08:15 - Zooming in on a US Airways A330-200 taxiing slightly faster than us\n09:15 - Zooming in on aircraft at the remote stands on the south side of the airport\n09:17 - B-2047: One of Air China's many aircraft in special liveries, this one celebrating the relations between China and France.\n10:06 - Lufthansa A380-800 D-AIMG (again!) departs in front of us, with some pretty sweet water spray.\n11:04 - D-AIMG lifts off from 25C, as we line up.\n12:14 - Lined up and ready to go.\n12:40 - Takeoff power is applied to the 4 GEnx-2B67 engines\n13:24 - Rotation, after a bumpy 44 second takeoff roll\n14:00 - Climbing away, making a right turn, Runway 07L/26R visible\n14:40 - Into the clouds we go!\n15:10 - Flaps retracting\n16:03 - Flaps fully retracted\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2014\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "z5ICRjaXkuQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-10-25T17:53:09Z"
}