{
 "name": "CrossCountry HST First Class train review (and how I saved TONS of money!)",
 "description": "Book cheap TRAIN and COACH tickets on the Trainpal app. Download: https://www.mytrainpal.com/web-pages/campaign-winginit\n\nCheck out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nThanks for joining me on this trip! This is a classic High Speed Train, or HST journey between Newcastle and Bristol, with CrossCountry. The Class 43 HST is far superior to travel on than the regular 220/221 Voyager trains, and can generally be found on the following weekday departures:\n\n0606 from Edinburgh (the train I took in this video)\n0610 from Leeds\n1153 from Plymouth\n1225 from Plymouth\n1527 from Plymouth\n1642 from Birmingham New Street\n\nSplit ticketing is totally legal and allowed for expressly under the National Rail Conditions of Travel, which say: \"...you may use a combination of two or more Tickets to make a journey provided that the train services you use call at the station(s) where you change from one Ticket to another.\" It used to be the case that enthusiasts like me would have to work out where to split tickets manually with lots of trial and error. Now, Trainpal will do it for you, and ensure every ticket it sells you is totally valid and legal for your trip.\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "aA6MoteaJwU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-10-11T08:58:17Z"
}