{
 "name": "The INDIAN PACIFIC: Australia's Greatest Train - Sydney to Perth | Full Trip Video",
 "description": "WATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nCheck out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\n\nThe Indian Pacific is one of the world's finest train journeys, carrying passengers on a three night, four day excursion, the full 4,352km across Australia between Sydney and Perth. This is a must-take trip for the rail enthusiast, being in the top five longest trains in the world, and traversing the world's longest straight piece of track (478km) on the Trans Australian Railway on the Nullarbor Plain. It's a luxury experience, encompassing several off-train stops and excursions at places of interest along the route.\n\nOn this trip, I was kindly hosted by Great Southern Rail, who operate this magnificent train. Tickets and journey information can be found at: https://journeybeyondrail.com.au/journeys/indian-pacific/\n\nThis video is not sponsored and all editorial and commentary is my own, and not approved by the hosting company.\n\nI hope you enjoy the video!\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "_r1-M5lnSyo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-06-28T08:34:45Z"
}