{
 "name": "The NEW Caledonian Sleeper - London to Inverness Review (Club Solo Ensuite)",
 "description": "Get a FREE WEEK trial of Blinkist and 25% OFF full membership by going to http://blinkist.com/wingin'it!paullucas\n\nCheck out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\nWATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nTip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nHelp me out by buying something - anything! on Amazon through my referral link? Use this link as your entry point and browse... https://amzn.to/2JK5lYCa\n\nMega thanks to my current $5+ Patrons: \n\nCliff Hope, Ryan Wylde, Gunter Hanke, Anthony Crawford, Victor Petersen, Robert Stretton, Peter Harrison, Stephen Newton, Ben Marcus, Natalie Napolitano, Daniel Westermann Strandby, Quintin Soloviev, Tore Morten, Henry Bollington, Mike Wooldridge, Anna Smith, Neil Smith, Doug Gard, David Mager, Laila Bergman, Dan, Joseph O'Brien, Jonathan O'Connor, DL James, Apmann Paul, Anonymous Donor, Steve Cooksley, Maulin Agrawal, David Hackett, Corne Adema, Bailey Courtney, Amber Watts, James Emery, Jose Nanin, Kodzo, Tom Freeborough, Steven Steffen, Phil Kitchen, Harald Evensen, Dirk Monson, Jack Gott, David F Bird, Jimmy Taylor, Jim Hawkins, Steve Carlson, Dominic Cozzi, Craig Colligan, Brendan J Becker, Jim Hastings, Gwailo Ang Mo, Alan Millar, Tomas Tandstad, Perry Howard, Andreas Pietsch, Lewis Whyte, Daniel Robinson, Greg Dash, Johnny Legg, Alexandre Huguet, John Brophy, Christer Whitworth, Ben Koo, Reint van Dijk, Paul Oates, Billy Smith, Philly Peter, James Patch, Robert Smith, Daniel Barrington-Garbutt, William Hyslop, Graham McKenzie, Will Phillips, Ricky Baptiste, Kyriakos Adamou, Paul Williams, Benjamin Hart, Rick Cornell, Oliver Brandt, Eric Weinmann , David Rivas-Liber, “abzy”, Alexander Hagen, Frazer Horswell, David Bowlus, Jake Evans, Wenrui Calvin Yu, Jos Bowmaster, Blake Prosch, Christopher Adams, Kevin Schlemmer, Chris Martin, beautyatyourtips.com, Damien Paul Croft, QFS Aviation, Scott Mulligan, Daniel Ferry, Nathan Moddison, Alan Maier, “Fan From Japan”, Joaquin Wells Doerr, Fahim Khair, Jean, John Clyde, David Miller, Simon Jordan, Jeff Ridder, Tim Stapersma, Zack Wischnia, Alan Gilchrist, Simon O, David Martin, Arthur Dent, Gary Walker, Killua, Brian Glas, Robe Farrugia, Mark Thompson, Stewart Stevenson, rc, Ardis Ostrom, Tracey Abel, Michael Holt, Tiezheng Bu, Eidgenosse, James McInnes, Patricia Noon, Matthew Davey, lowfire, Max Lavallee, Patrick J Gallagher, Robert Deering, Adam Goody, Matt O Callaghan, Andreas, Patricia Navarro, John Murdoch, Kevin, Nick, Alexander James Ewing, Dustin Bowles, Syam Murty, Robert Stone, That Concert Life, James Cardwell, AmmaLittleOwl, Bluee C, Wayne Meehan, Alex Irwin, James Patterson, Jonathan Asbridge, Dave Parkinson, James McIntosh, Daniel Zou, Ash Penstone, A D Thomas, Tony Hash, Panda Phil Podcast, James Emery, Craig Riley, Rab Macleod, Karl Black, Solon Merikas, Glen Biddiscombe, Miguel Haruki Yamaguchi, Daniel Zou, Joshua Bedel, Richard Harris, Kyle, Tom, Robert GP Taylor, Anthony Cavaco, Lauren Wright, Thomas Clark, Joe Pantry, adhocs, Eleanor Hepinstall, liza, Gareth Walker, Eric Chen, Delaney Archer, Gareth Walker Michael Goldsmith, Clive Hardwick, Mike Garofalo, Louise Innes\n\nJoin them on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nJoin me onboard the NEW Mark 5 Caledonian Sleeper for a trip from London to Inverness...and see how such a supposedly great train fails to deliver on its promises.\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "0AZPfYnRR-4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-02-05T17:24:29Z"
}