{
 "name": "The SHORTEST RUNWAY in the WORLD! Flying the Winair Twin Otter: St Maarten to Saba [2020]",
 "description": "Try Dashlane for FREE on your first device by heading to http://www.dashlane.com/paul\nthen, when you want to upgrade to Premium use my code PAUL for a discount!\n\n**This video is from February 2020 before the lockdown**\n\nI hope you are all doing well during lockdown/quarantine or during whatever situation you currently have in your country. I'm excited to see the first green shoots of recovery, with some countries in Europe beginning to reopen for tourists next month! Stick with it and we will be back in the air soon! Today's video features a Winair Twin Otter trip to Saba, the world's shortest runway and one of the most \"dangerous\" airports to fly into! \n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nDate of Travel: 19 FEB 2020\nAirline: Winair\nLivery: Standard Winair\nRoute: SXM-SAB-SXM\nAircraft: DHC-6 Twin Otter\nFlight Number: WM 435, WM 442\nMiles: 28+28\nAirborne time: 0h13m, 0h12m\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "7oVOTjeDEuc",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-05-24T08:29:16Z"
}