{
 "name": "airBaltic Airbus A220-300 Inaugural Full Flight | Riga to Amsterdam (with ATC)",
 "description": "A full length, full flight video from Riga to Amsterdam, with airBaltic onboard the first ever commercial flight of the Airbus A220-300/Bombardier CS300, operating flight BT619 on December 14 2016.\n\n**Every moment of the flight included from airport to airport. ATC for the full flight, multiple angles throughout the flight and landing**\n\nI was very fortunate to be invited by airBaltic to the inaugural flight of the Bombardier CS300 from Riga to Amsterdam on December 14 2016 to film the full flight.  This is the entire flight, in full length, from outside the terminal at Riga to the terminal at Amsterdam, with multiple angles of the entire flight.  Sit back, relax and enjoy the party flight!\n\nOur journey today begins outside the terminal at Riga's International Airport (RIX).  It's a cold day, with snow on the ground.  We enter the terminal, and head to the security checkpoint.  From there we walk through the modern terminal at Riga to our gate, where the party is already underway.  We enjoy a champagne reception with canapés, as well as a celebration cake.  We enjoy the speeches from senior figures at Riga Airport and airBaltic.\n\nOnce the speeches are completed we are invited to board and are given our gift bag containing some memorabilia from airBaltic.  We walk to the aircraft along the red carpet and board through the forward doors.  We have plenty of time to take photos and video of the A220 as we board, and make our way to our initial seat, 24F.  \n\nBefore long the doors are closed and we are handed our menu for the celebratory meal on today's flight.  We push back from the stand and taxi to runway 36, before being cleared to take off by Riga Tower on ATC.\n\nWe climb out to the north before making a left turn in the thick cloud towards Amsterdam.  When we eventually break through the top of the cloud the sunset is still (just) visible on the right hand side of the aircraft.  I reposition the camera to the left hand side around 20 minutes in seat 25A where it is still daylight.  We climb to 38,000ft (FL380) and chase the sunset across the Baltic Sea to the south of Sweden and Copenhagen, as we enjoy the festivities on board.\n\nWe receive our meal, a beautifully presented and tasting salmon canapé.  The festivities continue as we are treated to an illusionist onboard the flight to entertain the guests, and a competition to win flights on airBaltic.  We enjoy a nice chat with airBaltic VP of Marketing Janis Vanags, who talks in detail about the CS300 with airBaltic.\n\nBefore long we commence our approach into Amsterdam, contacting Amsterdam Radar on ATC as we cross the border from Germany into the Netherlands.  We enjoy an incredibly smooth touchdown on runway 36, the Polderbaan, and are escorted by an incredible fleet of airport vehicles to the terminal.  As we pull onto the stand we enjoy a water cannon salute, as we are filmed by Dutch and Latvian TV crews.  We disembark through the forward door into the terminal, being presented with a 'first to fly' certificate, postcard, and inside the terminal a wooden tulip from Schiphol Airport.\n\nAirline:  airBaltic \nFlight:  BT619\nAircraft:  Bombardier CS300 YL-CSA\nFrom:  Riga (RIX)\nTo:  Amsterdam (AMS)\nDeparture:  16:40\nArrival:  17:30\nFlight Time:  1:50\nSeat:  24F (takeoff) 25A (landing)\nFlight Path:  https://goo.gl/OaDxHT\n\nKey moments:\n\n0:00:03  Outside Riga Airport, walking into terminal\n0:01:00  Walking to security inside the airport\n0:02:58  After security, walking to C pier gates\n0:11:25  Entering gate C5 where the party is underway\n0:13:21  Advisor to chairman of board at Riga Airport cuts the celebratory cake\n0:14:56  Speeches from Martin Gauss, Janis Vanags, Artus Kokas and Her Excellency Ilze Rūse\n0:19:53  Receiving our gift bag and walking out to aircraft\n0:21:41  Walking the red carpet and boarding the CS300\n0:44:19  Pushback and engine start\n0:50:20  Taxi to runway 36\n0:54:30  Lining up runway 36 and takeoff clearance from Riga Tower\n1:23:56  Move across from seat 24F to 25A\n1:32:12  Passenger in front chatting with Janis Vanags, VP of Marketing at airBaltic\n1:37:00-1:40:00  Meal Service\n2:08:10  Illusionist performing tricks\n2:26:59  ATC: Contacting Amsterdam Radar and commencing descent into Schiphol\n2:45:44  Landing filmed inside and outside on runway 36R, taxi to terminal area with external footage from chase car\n3:01:39  Pulling onto stand with water cannon salute, filmed from inside and outside\n3:05:47  Disembarking aircraft and receiving certificate, walking into airport and to central terminal area\n\nCREDITS\n\nairBaltic for the incredible opportunity to fly with you and participate in the launch of the CS300!\nThumbnail Photo: Aleksi Hamalainen (https://goo.gl/ZHXrSq)\nExternal footage at landing: NH Airtime (https://www.youtube.com/channel/UCBZWabGWByTp5EJNIHP7vew)\nATC: LiveATC.net archives - EVRA and EHAM\nGuest appearance throughout video: Window Seat (https://www.youtube.com/user/WindowSeatVideo)\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "T-Ys7OMsizY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-12-16T09:31:23Z"
}