{
 "name": "Eurowings Full Flight | Dusseldorf to Manchester | Airbus A320 (with ATC)",
 "description": "A full length full flight video in real time with Eurowings, from Düsseldorf to Manchester, onboard Airbus A320 D-AEWD operating flight EW1346 on July 29 2016.\n\n**Every moment of the flight included from airport to airport. ATC for full flight.**\n\nOur journey today begins outside the terminal at the Düsseldorf International Airport, before we walk the length of the terminal to the security checkpoint at the A pier to take us airside.\n\nWe make our way down to our gate, passing a passport check before entry to the gate area, and take our seat to wait for boarding.\n\nThe gate area soon fills up and we are called for boarding, riding a bus across to our waiting brand new Airbus A320, D-AEWD.  We board using the forward stairs, and after being welcomed aboard take our seat in 8A.\n\nBefore too long the doors are closed and we receive our ATC clearance to push and start, before getting taxi clearance to taxi to runway 23L.  We are cleared to take off and climb out to the west, getting a lovely view over Germany as we climb to our cruising altitude of 37,000ft.  We get a small snack during the cruise, and we make our way over the North Sea.\n\nIt isn't long before we are contacting London Control on ATC, and after crossing the UK coast near to London we make a right turn towards Manchester, and start getting our clearances to descend.  We contact Manchester Approach and are instructed to hold at DAYNE before our approach, but after one circuit of the hold our hold is cancelled and we continue our approach.  Tower clears us to land on runway 23R at Manchester, and after a smooth landing we have a lengthy taxi due to ground congestion.\n\nOnce on stand, we disembark through an airbridge into Terminal 1 at Manchester, before hitting the usual long queue for passport control and immigration.  We finally emerge after a 20 minute wait, making our way through the Skylink to the railway station, where we board our train to take us to our parked car.\n\nKey moments in video:\n\n0:00:03  Outside the terminal at Dusseldorf airport\n0:00:22  Entering the terminal, walking to security\n0:05:41  After security, walking to A gates\n0:08:03  Passport control\n0:09:21  At gate A84, waiting for aircraft\n0:13:19  Boarding commenced, boarding bus to aircraft and bus ride to aircraft\n0:19:11  Walking to aircraft, boarding through the front door\n0:24:47  Cabin overview during boarding\n0:30:47  Captain's welcome annoucement in German and English\n0:32:27  Safety briefing in German and English\n0:33:30  Clearance to push and start, pushback and start\n0:39:12  Taxi clearance, commence taxi to runway\n0:47:26  Takeoff clearance, departure to west from runway 23L\n1:03:08  Meal service: Snack pack\n1:13:39  Cabin overview\n1:24:16  ATC: Contacting London Control\n1:26:26  Rear cabin overview\n1:29:29  Commencing descent\n1:42:10  ATC: Contacting Manchester Approach\n1:51:55  ATC: Instructions to hold at DAYNE\n1:54:54  ATC: Hold cancelled, continue approach\n1:58:42  ATC: Contacting Director\n2:01:27  Commencing ILS approach for runway 23R\n2:02:50  Contacting tower\n2:05:59  Cleared to land runway 23R\n2:07:12  Vacating runway, contacting ground, taxi clearance to stand\n2:15:32  Disembarking aircraft via jetway, walking to immigration\n2:22:25  Walking through baggage claim and out of airport\n2:24:41  Walking to train station through Skylink\n2:27:16  Walking to and boarding train\n\nAirline:  Eurowings \nFlight:  EW1346\nAircraft: Airbus A320 D-AEWD\nFrom:  Dusseldorf (DUS)\nTo:  Manchester (MAN)\nDeparture:  19:12\nArrival:  19:31\nFlight Time:  01:19\nSeat:  8A\nFlight Path:  https://goo.gl/4W7o3B\n\n\n\n✈ ✈\nEquipment used:\n\nCameras: \nWindow footage: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nAirport and onboard footage: GoPro Hero Session http://amzn.to/2eBZTag\nMount: Generic suction mount http://goo.gl/E2vRBs\nYou need this for the suction mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nGorillaPod for GoPro: http://amzn.to/2ev9QpN\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\nScanner for ATC: Yupiteru MVT-7300\nRecorder for ATC: Olympus VN-741PC http://amzn.to/2fb4Lab\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "VxDMvfNE7Oo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-11-04T11:55:39Z"
}