{
 "name": "Full Flight on a Private Jet! | Cessna Citation CJ4 | Luxembourg to Dusseldorf (with ATC)",
 "description": "A full length full flight video in real time, from Luxembourg to Dusseldorf, onboard Hahn Air Cessna Citation CJ4 D-CHRB operating flight HR311 on July 29 2016.\n\n**Every moment of the flight included from airport to airport. ATC for full flight.**\n\nBOOK THIS FLIGHT: https://goo.gl/QjBwq4\n\nOur journey begins outside the terminal at Luxembourg International Airport, before we enter the terminal to check in at the  Luxair desks.  From there it's an easy transition through security to the departure lounge, which is pretty quiet.  We make our way to the gate for today's flight, where the passenger service agent soon arrives and informs me that I'm the only passenger on today's flight! \n\nThe very quick boarding is completed and I make my way down to the bus, on which I'm the only passenger, to be driven out to today's ride, Cessna Citation CJ4 D-CHRB.  The captain is waiting to welcome me onboard, and I climb aboard the luxurious private jet to take my pick of the aircraft's 6 seats!\n\nThe captain shuts the door behind me and welcomes me aboard, giving me information about the aircraft's route, and a brief safety briefing showing the position of the exits, and how to operate the seat and seatbelt.\n\nHe then takes his place in the flight deck and fires up the engines to take us on our short flight to Dusseldorf.  We taxi out to runway 24, holding short for a couple of arrivals, before we line up on the runway.  After our take off clearance, the pilots push the throttles open, and we power down the runway like a rocket, getting airborne after only a few seconds.  Within a couple of minutes we're at 10,000ft and the seatbelt sign is switched off as we climb away to our cruising altitude of 23,000ft.\n\nThe captain pops his head back into the cabin and asks if I'd like to go and watch them on the flight deck for a bit, of course I said yes!  \n\nWe then get a good chance to have a look around the cabin, trying out various features such as the tables, seat positions, and the very cool electric window blinds!\n\nWe soon begin our descent into Dusseldorf, contacting Dusseldorf Approach to get our vectors for an ILS approach onto runway 23R.  We get a fantastic view of the approach through the flight deck, and touch down smoothly on runway 23R before getting instructions to taxi to the GAT (General Aviation Terminal) at Dusseldorf.  We taxi to the GAT, eventually pulling up alongside a number of other private jets.  The captain opens the door to let me off, introducing me to the bus, which again I have all to myself!\n\nThe bus takes me in to the terminal, where I walk through to the street outside the terminal.\n\nAirline:  Hahn Air\nFlight:  HR331\nAircraft:  Cessna Citation CJ4 D-CHRB\nFrom:  Luxembourg (LUX)\nTo:  Dusseldorf (DUS)\nDeparture:  15:52\nArrival:  16:19\nFlight Time:  00:27\nSeat:  All of them!\nFlight Path:  http://goo.gl/kirzff\n\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "McxUjhprEl4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-09-02T08:34:40Z"
}