{
 "name": "KLM Full Flight | Amsterdam to London Heathrow | Fokker 70 **With ATC**",
 "description": "A full length, real time full flight video onboard KLM Fokker 70 PH-KZE operating flight KL1023 from Amsterdam Schiphol to London Heathrow on January 30 2016.\n\n**Every minute of the flight included from terminal to terminal, as well as ATC for the full flight**\n\nOur flight begins with a bus ride out to the KLM Cityhopper ramp at Amsterdam's Schiphol airport, before we board and take our seat in seat 15A.  We receive our departure clearance before getting clearance to start, and taxi out to runway 24 (Kaagbaan) at Schiphol.  We blast off into a beautiful sunset, rocketing out of Schiphol towards FL240.\n\nAs we cross the North Sea we hand over to London ATC, and commence our approach over London as the sun starts to set.  We line up for a landing on runway 27L, and touchdown ahead of schedule before taxying into Heathrow's Terminal 4.  We deboard and have a long wait for immigration before we exit Terminal 4 on a cold January evening.\n\nAirline:  KLM Cityhopper\nFlight:  KL1023\nAircraft:  Fokker 70 PH-KZE\nFrom:  Amsterdam Schiphol (AMS)\nTo:  London Heathrow (LHR)\nDeparture:  16:59\nArrival:  16:55\nFlight Time:  00:56\nSeat:  15A\nFlight Path: http://goo.gl/ipCIgD\n\nFilmed from seat 15A.\n\n\n********************************************************************\nPlease subscribe, comment and like, and follow me for regular full flight and behind the scenes videos!\n\nFacebook:  facebook.com/inflightvideo\nTwitter: twitter.com/inflightvideo\nG+: plus.google.com/+inflightvideo\nInstagram: instagram.com/inflightvideo\n********************************************************************\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "gQD7APMNdqo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-04-29T08:30:00Z"
}