{
 "name": "Timelapse Flight | Las Vegas to Dallas Fort-Worth | American Airlines B737-800",
 "description": "A timelapse flight from Las Vegas to Philadelphia onboard an American Airlines Boeing 737-800, operating flight AA70 on April 4 2016.\n\nOur journey begins at the terminal at Las Vegas' McCarran International Airport.  \n\nIt isn't long before we pushback and get our taxi clearance to runway 1R, getting an amazing view of the entire Las Vegas strip as we climb away to the north.  We then make a right turn and are treated to a great view of Lake Mead, and then the entire Grand Canyon unfolding beneath us.\n\nFrom there we continue in an easterly direction over Arizona and into New Mexico, with the desert unfolding beneath us.  We pass the town of Gallup, NM, and shortly afterward Albuquerque, NM.  We receive a small snack about halfway through the flight with coffee, before we enter Texas.  The ground gets less brown and more green as we head towards Wichita Falls, TX, and even greener as we start our descent towards the Dallas area.  We contact DFW approach, and are vectored towards the ILS for runway 18R, approaching over Lewisville, TX.  We touch down on schedule, and then have to hold for a short while for departing traffic before we can taxi to our gate.  We then get a gate change and are instructed to hold pending our new gate, and eventually make our way into the gate.\n\nVideo taken from seat 9A.\n\nAirline:  American Airlines\nFlight:  AA70\nAircraft:  Boeing 737-800 N946AN\nFrom:  Las Vegas (LAS)\nTo:  Dallas Ft Worth (DFW)\nDeparture:  09:56\nArrival:  14:02\nFlight Time:  02:06\nSeat:  9A\nFlight Path:  http://goo.gl/xup0Ae\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "P0IpkhdBO3g",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-07-29T08:32:12Z"
}