{
 "name": "Timelapse Flight | Manchester to Zurich | Swiss Bombardier C Series CS100 (with ATC)",
 "description": "A timelapse flight with Swiss, from Manchester to Zurich, onboard Bombardier C-Series CS100 HB-JBA operating flight LX391 on July 29 2016.\n\nOur journey today begins at Manchester Airport \n\nBefore long we push back and taxi out to runway 23L.  We make a powerful departure from Manchester, climbing away like a rocket thanks to the CS100's powerful PW1000G engines.  We climb to our cruising altitude of 39,000ft for today's flight.\nWe commence our descent down into Zurich, and make our approach to runway 14.  As we cross the threshold of runway 14, the pilot initiates a go-around due to another aircraft on the runway that didn't vacate in time.  We once again climb like a rocket, reaching 4,000ft in around 30 seconds!  We then get a scenic second approach into Zurich, touching down eventually 40 minutes late.\n\nVideo taken from seat 1F.\n\nAirline:  Swiss\nFlight:  LX391\nAircraft:  Bombardier C Series CS100 HB-JBA\nFrom:  Manchester (MAN)\nTo:  Zurich (ZRH)\nDeparture:  09:41\nArrival:  12:33\nFlight Time:  01:52\nSeat:  1F\nFlight Path:  http://goo.gl/8RFmdx\n\n\n********************************************************************\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n********************************************************************",
 "source": "youtube",
 "source_id": "ZB3c6W6HI3o",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-10-07T08:29:12Z"
}