{
 "name": "The World's #1 FIRST CLASS? *Emirates $20,000 plane ticket*",
 "description": "I flew First Class on Emirates' A380 with my own private bedroom suite, shower and onboard bar! Here’s my review:\n\n#Emirates #FirstClass #EmiratesFirstClass\n\nToday we’re trying out the iconic Emirates First Class onboard their A380 from Seoul, South Korea over to Dubai. I’ve always wanted to try this out, largely because of the unique features such as being able to shower on a plane, drink at the onboard bar and sleep in the privacy of your own suite (complete with electronic closing doors). \n\nCome with me as I’ll provide you my honest account of what it’s like to fly in Emirates First Class on the A380. Emirates were not aware that I was reviewing this product, and this was a self funded trip so rest assured this is no choreographed experience and is exemplary of a typical First Class flight with Emirates. \n\nIn summary and as you’ll see in the video I was super impressed by Emirates First Class, it surpassed my expectation - highlights being the amazing crew, incredible food and of course getting to shower at 40,000 feet! \n\nMake sure you smash that subscribe button for plenty more luxury travel content. The second part of this video is incoming, where I try out the brand new Emirates First Class on their 777-300ER known as the Game Changer. Also, do let me know what your thoughts to my First Class experience in the comments below, I’m always looking to improve the videos I create and if there’s something specific you’d like to see in future vlogs let me know! \n\nFollow my trips live on IG\n@will.luxurytravel\n\nMUSIC USED:\n\n\"Relax\"\nInstrumental by Temper Beats\nYoutube - https://youtu.be/semPBDoFgOE\nSpotify - https://spoti.fi/2SVDkjS\n\nEmirates A380 First Class\nFirst Class Emirates\n£20,000 plane ticket\nEmirates A380\nFirst Class \nEmirates First Class",
 "source": "youtube",
 "source_id": "Qoj6cjfA7s8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-03-05T21:46:37Z"
}