{
 "name": "Oakland Airport to Coliseum - The BART Connector",
 "description": "A bonus short video here, showing the journey from Oakland Airport station to Coliseum station on the BART connector shuttle. The video features the full journey with a forward-facing camera, taking you up to the main BART platforms at Coliseum. Enjoy the video and THANK YOU for subscribing - next flight trip report upload is due this weekend! \nCheck out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\n\nFrom Wikipedia:\n\nThe Coliseum–Oakland International Airport AGT system is operated by BART and is integrated into BART’s existing fare system. However, it does not utilize existing BART rolling stock and it is not physically connected with existing BART tracks. Instead it has its own fleet of AGT vehicles that operate on fixed guideways and are cable-drawn. The guideways and Cable Liner vehicles were built by DCC Doppelmayr Cable Car. The line is designed to have an approximate headway of 4.5 minutes (though it is currently operated with a headway of 5 minutes) and to complete a one-way trip in approximately 8 minutes, with an on-time performance of more than 99.5%.\n\nInitially there will be four 3-car trains (113 passengers each train),[3] but the system can accommodate an expansion to four 4-car trains (148 passengers each train). The system has four cable loops and one train per cable. The system uses a pinched-loop configuration, with two tracks that switch down to a single track just before each terminus. Cars switch cables during dwell time at the station. The trains automatically switch cables four times: once at each end, and halfway between the two stops at the wheelhouse, near the intersection of Hegenberger Road and Airport Access Road. The wheelhouse has four giant wheels with spinning cables.\n\nThe 3.2-mile (5.1 km) AGT route between Oakland Coliseum Station and the airport is mostly elevated, largely in the median of Hegenberger Road, with one underground section as it passes under Doolittle Drive, and one at-grade section just west of that point, before the AGT enters airport property on an elevated guideway. A maintenance and storage facility is located near the midpoint of the system. A two-person team monitors operation of the system from a central control room.\n\nThe AGT’s connection to the existing BART system at Coliseum Station resembles the AirTrain JFK and AirTrain Newark airport people movers' existing off-airport connections to other rail transit lines. In this case however, both the airport people mover and connecting rail transit will be operated by BART and share the same fare system. The AGT's platform at Coliseum Station connects to the south end of the original BART platform via an elevated walkway above San Leandro Street.\n\nYou can also follow me on:\n\nTwitter, @pauls_trips\n\nSnapchat: pauls_trips",
 "source": "youtube",
 "source_id": "DP2jXjr30a8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-08-31T09:27:21Z"
}