{
 "name": "INCREDIBLE Overnight Sleeper Bus (with beds!) to Washington DC",
 "description": "Get Surfshark VPN at https://surfshark.deals/winginit - Enter promo code WINGINIT for a special deal for the holidays: 85% off + THREE EXTRA MONTHS for free!\n\nMerry Christmas and Happy New Year! I hope, like me, you've had time to spend time during the holidays with people close to you. Here's to a super 2023 and a taste of something different this today's video! I took Napaway just after US Thanksgiving between Nashville and Washington DC, and what did I make of this remarkable, unique American sleeper bus? Find out in today's video!\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\nMerch store: https://wingin-it.teemill.com/collection/all-products/\n\n0:00 Intro\n1:11 Bus arrives!\n1:59 Boarding Napaway premium sleeper bus\n3:03 Surfshark sponsored segment\n3:58 On the road\n5:11 Tickets, prices, seat advice!\n6:07 Bus toilet...yep, it has a toilet!\n6:45 Bed time\n9:10 Next morning approaching DC\n10:01 End of the trip, conclusions, thanks!\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "NQmnduFGZJk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-12-26T13:00:15Z"
}