{
 "name": "The business class Qatar Airways doesn't talk about.",
 "description": "Get Surfshark VPN at https://surfshark.deals/winginit - Enter promo code WINGINIT for 83% off + before the end of June get 3 months & Antivirus for FREE!\n\nQatar Airways' business class is the best in the world, right? I mean, if you're not getting their QSuite - the \"World's Best Business Class\" (my upcoming ANA review may throw some shade there!), you'll be in a reverse herringbone solo seat, one of the best in the sky. Some of those even have doors now! But Qatar has a fleet it doesn't talk about. Nowhere on their website can you find pictures of their A330 business class, a forgotten, somewhat embarrassing 2-2-2 configuration this airline just does not want to advertise it has! I had a flight on this recently, so let's check out the world's best airline's....\"worst\" business class.\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\nMerch store: https://wingin-it.teemill.com/collection/all-products/\n\n0:00 Intro\n0:17 Al Mourjan Lounge\n2:52 Hamad Airport\n4:06 Bus-boarding our A330-200\n5:45 Qatar A330-200 business class cabin\n6:23 \"Secret\" business class?\n7:47 Pushback, taxi, takeoff\n9:20 The seat...is not so bad...?\n10:02 Breakfast service\n11:16 BED MODE!\n11:46 IFE and headphones\n12:37 Descent, landing, conclusions\n\nSpecial thanks to Flying Fab for making his footage available on Creative Commons: https://www.youtube.com/watch?v=fWupHyBuEqM&t=38s\n\nMy website: www.winginit.me\n\nDate of Travel: 9 MARCH 2022\nAirline: Qatar Airways\nLivery: Qatar Airways standard\nRoute: DOH-ATH\nAircraft: Airbus A330-200\nFlight Number: QR 203 \nMiles: 1,979\nAirborne time: 4h47m\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "kwlA9TYZut8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-06-30T15:54:49Z"
}