{
 "name": "American Airlines First Class in 2020",
 "description": "Safe Travel in 2020 seems daunting. But it doesn’t have to be. Thanks to the incredible efforts of aviation professionals in airports and on airlines, it’s a very safe proposition to travel in 2020.\n\nIn this video, I’ll go “behind the scenes” to see how airports like Raleigh Durham International (RDU) and airlines like American Airlines are working to ensure that air travel is as safe as it possibly can be during these unprecedented times. This is a trip report about an American Airlines 737 First Class Flight. But it’s so much more!\n\nI’ll travel with American Airlines in First Class onboard a Boeing 737, but not before getting the inside scoop on how airports and airlines are going the extra mile when it comes to air travel. \n\nThere’s also a surprise at 4:52 when we got to see a special visitor to RDU – a C-32, which is a modified Boeing 757 flown for Executive Transport by the US Air Force. This particular airplane had the Vice President onboard, which meant it went by the callsign, “Air Force Two!”\n\nWhile no activity is 100% safe, according to the Centers for Disease control, traveling on this American Airlines 737 was relatively low risk. Why?  “Because of how air circulates and is filtered on airplanes, most viruses don’t spread easily on flights.”\n\nThe air on today’s commercial airplanes is replaced with clean, fresh air every two to three minutes and the filters onboard trap 99.99% of particles. Further, everyone is facing the same direction, not toward each other, all passengers are required to wear face coverings, and the air blows downward. In other words, again, while nothing is 100% safe in these uncertain times, air travel is a relatively low-risk.\n\nFor more about what RDU is doing to ensure you can “Fly Confident,” check out this website:\nhttps://www.rdu.com/fly-confident-fly-rdu/\n\nThanks to Christopher Pippen for the thumbnail image for this video:\nhttps://www.flickr.com/photos/cpippen/\n\nFor more from the CDC, head to this site:\nhttps://www.cdc.gov/coronavirus/2019-ncov/travelers/faqs.html\n\nThe cleaning crew I saw on this American Airlines 737 at Raleigh were diligent, focused, and hard-working. I was definitely impressed with just how seriously they worked. \n \nSpecial thanks to the Communications Teams at RDU and American Airlines. \n\n00:00 Welcome\n00:33 Arriving at RDU\n01:17 Checking into American Airlines\n01:49 Exploring RDU Terminal 2\n03:00 Cleaning Begins\n04:27 Boarding American Airlines 737\n04:52 Air Force Two Departure\n05:34 Pushback of American Airlines 737\n05:52 First Class Seat Review\n06:26 First Class Dinner Service\n07:19 Closing Thoughts & American Airlines 737 Landing\n\nFull take-off and landing footage (including more of Air Force Two):\nhttps://youtu.be/ckqJIXUhdm4\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nFire Drill – Cushy\nCandle Light – dreem\nSpinning the Wheels – Dusty Decks\nMoments of Bliss – divine\nBo – Lo Mimieux",
 "source": "youtube",
 "source_id": "bue8104AaM4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-09-26T13:00:09Z"
}