{
 "name": "Amtrak Southwest Chief - Amtrak Superliner Family Bedroom",
 "description": "This is the second and final video in my series AMTRAK-ing Across America by train. \n\nHere’s a link to the first one:\nhttps://www.youtube.com/watch?v=agz6Y6-UaH4&t=477s\n\nIn this video, we’ll complete the journey onboard an Amtrak Long Train, the Southwest Chief. The Amtrak Southwest Chief crosses more than 2,200 miles using Amtrak Superliner cars. The trip from Chicago to Los Angeles traces the Santa Fe Trail and makes stops in eight states.\n\nIn this video, you’ll experience one of Amtrak’s flagship routes; explore the Amtrak Southwest Chief Family Bedroom, the largest individual room; examine a bit of railroad history; excite in the fun only train travel allows; and I’ll even share a few key tips to make your Amtrak trip as comfortable as it can be.\n\nThe scenery we encountered on this route was some of the most spectacular I’ve ever seen from a train. The Southwest Chief crosses some inhospitable landscapes that made me grateful for the Amtrak Comfort.\n\nA real highlight was the Raton Pass, which saw the train climb higher than 7,800 feet as it passed from Colorado to New Mexico. \n\nI’ll even share a bit of the history of Amtrak in general, and this route in specific as we make the trek.\n\n0:00 Welcome and Overview\n1:33 Chicago Union Station Metropolitan Lounge\n2:28 Boarding The Southwest Chief\n3:17 Ontime Departure\n5:14 Amtrak Family Bedroom Tour\n8:09 Pasta & Meatballs Dinner\n9:29 Waking Up in Kansas\n11:14 Fresh Air Break in La Junta, Colorado\n11:55 Amtrak Southwest Chief Train Tour\n12:36 Amtrak Travel Hacks\n14:39 Raton Pass, highest point on the Amtrak Southwest Chief\n19:02 Lunch from the Amtrak Café\n22:49 Albuquerque, New Mexico\n24:35 Chicken Marsala\n25:03 Waking up in California\n26:15 Arriving in Los Angeles Union Station\n26:33 Bloopers\n\nPart 1 of AMTRAK-ing Across America (Amtrak’s Mighty Cardinal):\nhttps://www.youtube.com/watch?v=agz6Y6-UaH4&t=477s\n\nAmtrak’s Empire Builder Train:\nhttps://www.youtube.com/watch?v=iYhuB2uzN9k&t=319s\n\nThe Rail Runner Express:\nhttps://www.youtube.com/watch?v=43p7rNDG7rk\n\nMore Train Videos:\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc\n\nFor more trip reports, please subscribe to my channel! http://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMUSIC:\nDaydream – Luwaks\nScattered in the Wind (Instrumental Version) – Dayon\nOur Little Union – Headlund\nCould Have Been Stardust (Instrumental Version) – Sam Shore\nWe Fall Down – Eric Feinberg\nGood Advice – Martin Klem\nMorning Lights – Trailer Worx\nFootprints in the Sand (Instrumental Version) – Roots and Recognition\nThe Happiest Days – J. F. Gloss\nRed River Valley – Daniel Kaede\nGlitterati – Fox Morrow\nPiece of Streets – Molife\nSignal to Noise – Hampus Naeselius\nSparkles – Daxten\nMotif in F Major – Gavin Luke\nJust a Little Time (Instrumental Version) – CLNGR\nLet’s Make it Last (Instrumental Version) – Thyra\nThe Street Performer – The Fly Guy Five",
 "source": "youtube",
 "source_id": "eYiMihP0OHU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-12-26T17:00:12Z"
}