{
 "name": "Best First Class Airline Comparison: Alaska, American, Delta, & United",
 "description": "In this video, we’ll explore how 2020 transformed US Domestic First Class. We’ll compare Domestic First Class flights with Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines. We’ll even declare the winner of the Best Domestic First Class Airline for 2020.\n\nWe’ll explore how to access First Class Lounges for Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines.  For the latest, here are links:\n\nAlaska Airlines Lounge Access:\nhttps://www.alaskaair.com/content/airport-lounge\n\nAmerican Airlines Admirals’ Club Access:\nhttps://www.aa.com/i18n/travel-info/clubs/admirals-club-access.jsp\n\nDelta Air Lines Sky Club Access:\nhttps://www.delta.com/us/en/delta-sky-club/access\n\nUnited Airlines Club Access:\nhttps://www.united.com/ual/en/us/fly/travel/airport/united-club-and-lounges/access.html\n\nWe’ll look at how Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines are tackling the need to provide additional cleaning during these unprecedented times.\n\nWe’ll look at the Domestic, Narrow-body First Class Seats for Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines.\n\nWe’ll compare the Inflight Entertainment available onboard flights with Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines.\n\nWe’ll look at what kinds of food and beverage options are available to Domestic First Class Passengers onboard Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines.\n\nAnd we’ll even discuss the service available to First Class passengers who choose to fly with Alaska Airlines, American Airlines, Delta Air Lines, and United Airlines.\n\nIn the end, we’ll rate these four airlines in order to determine with the Best US Domestic First Class Airlines of 2020 is.\n\nHere’s a link to the complete reviews of each of these flights:\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFeqWrfOUSXy0Pem2lLJmk9IW\n\nAnd here’s a link to the #TransconThrowdown Videos, too:\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFerYnXejq6WO3yp9y9Z_huT9\n\n0:00 Introduction and Overview\n3:12 First Class Lounge Comparison\n4:23 Domestic US Airline Cleaning in 2020\n5:09 First Class Seat Comparison\n6:58 Inflight Entertainment Comparison\n8:47 First Class Food and Beverage Comparsion\n10:05 First Class Service Comparison\n10:53 Best Domestic First Class Airline of 2020\n\nMusic\nBe Free With Me (Instrumental Version) – Siine\nValium – nothanks\nSpring Cleaning – Dylan Sitts\nPancakes – Dylan Sitts\nNot Quite Yet – Jon Bjork\nCompliments to the Chef – Water Mirrors\nOut of Service – Kikoru\nLight From Within – Howard Harper-Barnes",
 "source": "youtube",
 "source_id": "OQS8tO3w7HM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-12-05T15:20:35Z"
}