{
 "name": "Delta Air Lines First Class 757-300",
 "description": "Get 68% off NordVPN! Only $3.71/mo, plus you get an additional month FREE at: https://nordvpn.com/JebBrooks Use coupon code: JebBrooks\n\n00:00 Intro and Welcome \n00:28 Flight Overview \n00:59 \"Center A\" ATL Sky Club \n02:42 NordVPN Sponsorship \n03:44 Boarding Delta Air Lines First Class 757-300 \n04:33 Settling In 05:57 Push back and taxi \n06:07 Take-off \n06:53 Delta Air Lines First Class Internet Access & IFE \n07:51 Delta Air Lines First Class Food & Beverages \n09:37 Turbulence & Cabin Walkthrough \n11:43 Was Delta Air Lines First Class Worth it? \n14:14 Bloopers\n\n\nJoin me as I fly with Delta Air Lines First Class on a 757-300 from Atlanta to Salt Lake City. I’m in seat 2A on the “Flying Pencil,” the world’s longest single aisle, twinjet exploring what 2020 has done to Delta Airlines First Class.\n\nWe’ll use the JebScore methodology to explore every aspect of Delta Air Lines First Class. We’ll look at lounge access (Spoiler alert…there is none), the seat, the inflight entertainment, the food, and the service all in order to answer the question: “Does it make sense to fly Delta Airlines First Class in 2020 (and beyond)…\n\nAt the risk of stating the obvious: Delta Air Lines sell more economy tickets than first class tickets. But, perhaps you’re thinking about booking First Class? In this video, I’m going to aim to help you decide whether it makes sense for you to pay to upgrade with Delta Airlines in this brave new world. After watching, let me know whether you see enough value to pay a premium. \n\nDelta Air Lines First Class is dramatically different today than it was this time last year. The experience has taken a downturn as Delta Airlines does its best to save money and reduce risks. \n\nTwo Blokes Talking Rubbish a/k/a Have Passports…Can’t Travel Podcast (Ep. 4)\nhttps://youtu.be/fxAo5DCa6AI\n\nFor more on lounge access, head here:\nhttps://www.delta.com/us/en/delta-sky-club/access\n\nFull take-off and landing footage:\nhttps://youtu.be/GrKlndIWLOQ\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nBright Velvet (Sting) – Stefan Netsman\nLet Us Go Back – Tomas Skyldeberg\nEasy Breezy – Boogie Wheel\nAnd Then We Fell from the Sky – Across The Great Valley\nThe Long Walk – Jamie Norwood\nWonders – Gavin Luke\nThe Street Performer (Sting) – Martin Gauffin",
 "source": "youtube",
 "source_id": "VlilgHtmeIE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-10-10T14:15:11Z"
}