{
 "name": "Mile High Club? Future First Class Flights? No Flying for 12 Months?",
 "description": "YouTube Trip Reporters Jeb Brooks and Dennis Bunnik tackle major questions about the past, present, and future of flying in this second episode of their as-yet unnamed series (which may be called “Have Passports. Can’t Travel,” but we’re still not sure).\n\nEven though they’re separated by more than 10,000, these two First Class Travelers talk about everything from the Mile High Club to Kylie Minogue in this wide ranging discussion of travel-related topics relevant to frequent flyers, aviation enthusiasts, and anyone who longs to hop onboard an airplane sometime soon.\n\nFriends from moment one, these two blokes happily talk rubbish and invite you along for the ride. So, be sure to subscribe to both channels so you won’t miss another episode.\n\n0:00 Welcome!\n1:13 Which Airline, That You've Not Reviewed, Would You Like to Fly?\n5:26 What Do You Think of Inflight Pajamas (and Kylie Minogue)\n9:14 Dennis Bunnik's Plea to Kylie Minogue\n10:15 Which Two Cities, Not Currently Linked by a Nonstop Flight, Would You Like to See Connected?\n10:55 How Have \"Secondary Cities\" Been Impacted by Changes to Air Travel?\n15:25 What Will First Class Look Like in the Future?\n19:08 How Widespread is Membership in the Mile High Club?\n\nDennis Bunnik:\nhttps://www.youtube.com/channel/UCQrk97MBH6DToctKRfQJcNQ\n\nJeb Brooks\nhttp://www.JebBrooksFlies.com \n\nHere’s a link to our first episode:\nhttps://www.youtube.com/watch?v=vIK-Oinb3d8&t=1s\n\nHere's a link to our third episode:\nhttps://www.youtube.com/watch?v=ukmooyDNjsc\n\nHere’s Dennis’s Review of Qatar:\nhttps://www.youtube.com/watch?v=Pw5h6rILQ4k&t=857s\n\nHere’s Jeb’s Review of Virgin Atlantic:\nhttps://www.youtube.com/watch?v=H78S-Sqyw-w\n\nHere’s Dennis’s Review of Etihad’s First Class Apartments:\nhttps://www.youtube.com/watch?v=BDQ_YeCULoU&t=2s\n\nHere’s Dennis’s Review of Singapore’s First Class (Warning YouTube’s BEST Trip Report!!)\nhttps://www.youtube.com/watch?v=ITSNdSJ_MnU&t=2s\n\nHere’s Jeb’s Comparison of Virgin Australia and QANTAS (Domestic):\nhttps://www.youtube.com/watch?v=hnfva41LVmA\n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/",
 "source": "youtube",
 "source_id": "7CxSQPgTuaI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-09-19T13:00:05Z"
}