{
 "name": "What To Do in St Helena",
 "description": "This trip to the St. Helena took place from 15 - 18 February 2020, before the major current travel restrictions. I do not encourage anyone to travel now. #StayHome. Here's a video with my thoughts on the current situation: \nhttp://jeb.flights/travel\n\nSt. Helena may just be one of my favorite places I’ve ever visited. The Saints are some of the kindest people I’ve ever come across in my travels. Because I had such a great time, I thought I’d try something different for this video about St. Helena.\n\nI normally make videos here on YouTube about airlines, but perhaps the most amazing part of aviation are the places it can take. Places like St Helena. So, in this video about St Helena, I’m trying a little experiment: Let’s check out some things on the ground in St Helena! We’ll explore some of the highlights of St. Helena and some of what I enjoyed while I was here. Let me know what you think about this experiment by leaving comments. I always appreciate feedback! And next week, I’ll post a more typical video about my return to the mainland.\n\nSt. Helena is home to epic history, out-of-this-world scenery, and incredible opportunities for intreprid travelers.\n\nWe’ll explore the infamous Jacobs Ladder, Napoleon’s two residences on St. Helena, some of the hiking available on the island, as well as some of the most amazing vistas.\n\nThis is my first attempt at a video about something unrelated to aviation, so I’d appreciate your feedback. I think it’s probably fair to say I need to expand my coverage of things like accomodations and food if I continue with this. Also, maybe I’ll do this on a separate channel. Anyway, let me know what you think of this first attempt. And, also, let me know if you’re heading to St. Helena once we can all travel again!\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nDaily Airplane Photos: https://www.instagram.com/jebbrooksflies \nStuff from the Ground: https://www.instagram.com/jebbrooks\n\nGo “Behind the Scenes” by following me on Twitter:\nhttps://twitter.com/jebbrooks\n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic: \nSolaris – Marc Torch\nSeasons of Change – Gavin Luke\nCelebration – Lvly\nTraditional Romantic Folksongs 4 – Traditional",
 "source": "youtube",
 "source_id": "Wp8J0fazMT0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-04-11T13:00:10Z"
}