{
 "name": "AERIAL PLANESPOTTING OVER LAX with Star Helicopters!",
 "description": "Something that's on the bucket list of most aviation enthusiasts is plane spotting from a helicopter over Los Angeles International Airport, the second busiest airport in the United States. In mid-November, I paid a visit to Southern California to do just that! With Star Helicopters, I flew from Hawthorne Municipal Airport (just a 5 minute flight from LAX) and circled over the terminals of LAX for about half an hour, finishing off with a flypast of the south side of the airfield on the way back to Hawthorne. It was quite the tough call at times whether to film or take photos, but I think I achieved a good balance! I would definitely do this again in a heartbeat. Enjoy this unique plane spotting footage from this incredible helicopter ride! \n\nThanks for watching!\n\nA special thank you to Sean for allowing me to borrow his GoPro!\n\nSee more of my photos from this trip on my Instagram: http://www.instagram.com/ap.aviationphotography\n\nCheck out Star's website if you're interested in a trip like this: http://www.star-helicopters.com\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nOperator: Star Helicopters\nAircraft: Robinson R22 Beta\nLivery: Black and gold\nRegistration: N680SH\nRoute: Hawthorne Municipal (HHR) - Hawthorne Municipal (HHR)\nCallsign: November 680 Sierra Hotel\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2018\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "VvYlYGaGay0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-12-07T23:00:02Z"
}