{
 "name": "Air Canada Express New Livery Bombardier Q400 Landing and Takeoff at Calgary Airport",
 "description": "I'm fairly sure this is the first individual Q400 video I've uploaded on this channel in a few years! The Q400 is extremely common in Calgary, so there's not much motivation to film them. Despite there being seven (at the time of uploading) being painted, Western Canada still hadn't seen them, up until a few days ago. Jazz Aviation, who operates them (along with CRJs) for Air Canada, has finally sent one out west, C-GIJZ, which is primarily operating regional flights within Western Canada from Calgary. Air Canada's new livery looks incredibly sharp on the Q400, and while there's no doubt that these birds will become incredibly common in the near future, I certainly won't be complaining! For now, while it's still a bit of a novelty, enjoy my first catch of the new Air Canada Express livery on the Bombardier Q400, arriving and departing Calgary International Airport, with ATC included.\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Jazz Air (JZA/JZ)\nAircraft: De Havilland Canada DHC-8-402Q Dash 8 (DH8D)\nFlight Number: JZA552 / JZA373\nAircraft Name: 425\nLivery: 2017\nEngines: 2x Pratt and Whitney Canada PW150A \nRegistration: C-GIJZ\nRoute: Victoria (YYJ) - Calgary (YYC) - Fort McMurray (YMM)\nCallsign: Jazz 552 / Jazz 373\nRunway used: 17R / 17L\nDate filmed: April 21, 2018\nLocal time: 1200\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: https://www.dude8472productions.com\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/dude8472productionsYT\nInstagram: https://www.instagram.com/dude8472productions\nTwitter: https://www.twitter.com/dude8472_YYC\nFlickr: https://www.flickr.com/photos/dude8472productions/\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© dude8472productions 2018\n\nThis video is the property of dude8472productions and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "Aq8yxaBECVI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-04-23T00:15:01Z"
}