{
 "name": "Air Canada Express CRJ-705 Windy Approach and Hard Landing at Montreal-Trudeau",
 "description": "Back in Canada from my trip to D.C.! Here we have my view on board AC8827 from Washington Reagan National to Montreal-Trudeau International Airport back in July of 2017. It was a great flight as usual with Air Canada, and the extra legroom of the CRJ-705 is seriously fantastic. Some menacing clouds on approach as well as some high winds, but the crew did an excellent job of getting us on the ground safely. Enjoy this arrival video with some amazing lighting and scenery!\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=- \n\nVIDEO LOG: \n00:12 - Descending over the Quebec/US border, lots of storm clouds ahead.\n04:40 - Turning final for 24R.\n05:15 - Coming out of the final turn with the Montreal Olympic Stadium below us!\n05:45 - A brilliant view of the Montreal skyline as flaps extend.\n07:40 - Crossing the A-13 and one of my favorite spotting locations at YUL.\n08:10 - Touchdown.\n08:55 - Vacating the runway.\n09:15 - A great lineup of Air Transat aircraft parked on remote stands.\n09:45 - Another great lineup visible as we cross runway 10/28.\n10:45 - Taxiing by lots of aircraft parked around YUL's latest terminal expansion, the international jetty.\n\n -=-=-=-=-=-=-=-=-=-=-=- \n\nFLIGHT INFO \nAirline: Air Canada Express - Jazz (JZA/QK) \nAircraft: Bombardier CRJ705 (CRJ9) \nAircraft Name: None \nLivery: Old (2005-2017) \nEngines: 2x GE CF34-8C5 \nRegistration: C-FBJZ \nRoute: Washington Reagan National (DCA) - Montreal-Trudeau (YUL) \nCallsign: Jazz 8827 \nSeat: 28A \nRunway used: 24R\nDate filmed: July 27, 2017 \nLocal time: 1700 \nFlightAware: http://flightaware.com/live/flight/CFBJZ \n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2018\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "_glRC_Ko4ws",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-01-19T00:55:31Z"
}