{
 "name": "Final Flight | Cathay Pacific Cargo Boeing 747-8F Arrival and Departure at Calgary Airport",
 "description": "Sadly, Cathay Pacific Cargo has decided to terminate their flight to Calgary. They first started service to Calgary in 2014, originally routing HKG - ANC - JFK - YYC - HKG as \"Cathay 095 heavy\", serving Calgary on Thursdays and Saturdays in the very early morning. As time went on, the YYC - HKG leg became YYC - ANC - HKG, and anytime the flight was delayed until daylight, it was welcomed by a multitude of plane spotters and aviation enthusiasts alike. \n\nUnfortunately, demand for dedicated freighter service to Asia has decreased recently, with Vancouver losing their Cathay Pacific Cargo service along with several others in favor of belly cargo on passenger flights. Calgary will continue to receive 747 service from Cargolux as well as the occasional Atlas Air/Korean Air Cargo charter. Here we have \"Cathay 095 heavy\" landing on runway 17L, sitting on Apron 9, pushing back, taxiing, and departing runway 17R for the very last time early in the morning on March 24th. ATC is included, with a nice exchange of farewell between ATC and the crew on departure.\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFO\nAirline: Cathay Pacific Cargo (CPA/CX)\nAircraft: Boeing 747-867F (B748)\nFlight Number: CX95\nAircraft Name: None\nLivery: Old\nEngines: 4x GEnx-2B67\nRegistration: B-LJL\nRoute: New York (JFK) - Calgary (YYC) - Anchorage (ANC)\nCallsign: Cathay 095 heavy\nRunway used: 17L, 17R\nDate filmed: March 24, 2018\nLocal time: 0300\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: https://www.dude8472productions.com\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/dude8472productionsYT\nInstagram: https://www.instagram.com/dude8472productions\nTwitter: https://www.twitter.com/dude8472_YYC\nFlickr: https://www.flickr.com/photos/dude8472productions/\n\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© dude8472productions 2018\n\nThis video is the property of dude8472productions and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "JsYgZy0UXeg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-03-25T07:44:16Z"
}