{
 "name": "Removing the Ground Radar Antenna on Calgary's Control Tower - With a Helicopter!",
 "description": "Calgary International Airport is home to the tallest free-standing control tower in Canada, at over 300 feet high, surpassed only by the control tower at the Vancouver Harbour Airport, which is actually a cab perched on a skyscraper. On the very top of the tower is the ground radar antenna, which you'll typically see spinning and providing controllers with information about moving vehicles or aircraft on the ground. Recently, the antenna gearbox needed maintenance, requiring its removal altogether for a few days. \n\nHow does one remove an antenna from a control tower 300 feet above the ground?\n\nWith a helicopter!\n\nThis Bell 212, registered as C-FTLR and owned by LR Helicopters, did the job this past Sunday right at sunrise. Airport operations continued as normal as controllers were working from a smaller cab located at YYC's domestic terminal. Enjoy this unique footage of C-FTLR and crew removing Calgary's ground radar antenna and setting it down just a few meters away on the pavement!\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nOperator: LR Helicopters\nAircraft: Bell 212\nEngines: 1x Pratt & Whitney Canada PT6T-3\nRegistration: C-FTLR\nRoute: Calgary-International (YYC) - Calgary-Springbank (CYBW)\nCallsign: Tango Lima Romeo\nDate filmed: October 14, 2018\nLocal time: 0800\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2018\n\nThis video is the property of dude8472productions / Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "TDy3M3ubML0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-10-19T17:30:00Z"
}