{
 "name": "How Can This Plane Still FLY?! African Airliners",
 "description": "I took a flight across Tanzania with the relatively unknown Flightlink Airlines of Tanzania on a 30 year old Embraer 120, which left me wondering - how is this plane still flying!\n\nOFFICIAL NOEL MERCH: www.noelphilips.com\nJOIN ME ON WHATSAPP, GET WEEKLY LIVE CHATS AND MUCH MORE - SUPPORT ME ON PATREON! http://patreon.com/inflightvideo\n \nTHANK YOU TO MY AWESOME PATRONS!  Join them at www.patreon.com/inflightvideo\nJack Sheppard, Laurie Davies, Josh, Imogen Durrant, Sam Bolingbroke, Jos, Aaron Roach, Andrew Boland, Patrick O'Brien, Chris Carini, Shiva Sookoo, Steve Brittain, Steve Geary, Paul Scott, Matthew Skillen, Will, Ian Mitchell, Jonathan Sellars, Vince8323, Jo Thorne, Arnoud de Bruijn, Justin Wilcox, Jim Damm, Paul Kusulas, Tim Powaleny, Daniel Foulds, Justin Jura, George Douglas, Janie, Joe Keehan, Travis Morris, Dave Cotton, metrowake11 ., Adrian Carey, Adam Markin, Riley Kubly, Dan Payne, Conor Sampson, Steven Powrozek, Stuart McCarthy, Jacob Lichtefeld, Josh Whitaker, Liam Bojas, Neil Hall, Ray Milton, Chris Stirk, Eric Lewandowski, Richard Low, thespeedway, NM, Michael L, James Daniel, Jamie Smith, Dana Luce, Matt Brice, Ash Walker, Stephen Robertson, Matt, Paul Das, Andy Robichaux, Admira1_Noob, Dave Lakeland, Jo Hartill, Blake Prosch, Cian Paris, Tobias Arroyo Böttcher, Richard Tate, Andrew Burns, Taylor Flynn, Roger Berweger, Robert Currie, Ben Vanherck, Jason Bennett, Maël Boulet-Craig, Nathan Say, Joshua bedel, Matthew Ogilvie, Melannie Gamez, Zarniwoop B, Will Sparrow, Eirik Christoffersen, Sam Morris, Pete Chadwick, Andrew S, th3bubbanator, Grant Kennedy, Sam Yates, James Cardwell, Sarah Clark, Filip Konopski, Anthony Cavaco, Peter Smets, Paul Fitchen, Neil Turner, Joao Pedro Wilshusen, Max Lavallee, Mike Wooldridge, Daniel Juschus, Daniel Hornett, Ryan Wylde, Alan Williamson",
 "source": "youtube",
 "source_id": "NOGHLNHc51s",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-01-10T13:22:48Z"
}