{
 "name": "Air France Airbus A380 Full Flight: Los Angeles to Paris CDG (with ATC)",
 "description": "A full length, full flight video with Air France onboard Airbus A380-800 F-HPJH, operating flight AF65 from Los Angeles to Paris Charles-de-Gaulle on November 20 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for departure from Los Angeles**\n\nCHECK OUT PRIORITY PASS FOR LOUNGE ACCESS - 10% DISCOUNT FOR MY VIEWERS: https://bit.ly/2BGDwOo (affiliate link)\n\nFULL FLIGHTS AND FREE MERCH: http://patreon.com/inflightvideo\nEQUIPMENT (affiliate links)\nGoPro Hero 7 https://amzn.to/2SVH1er\nFeiyutech G6 Gimbal https://amzn.to/2NsNXd7\nZoom H1N Voice Recorder: https://amzn.to/2NmXu5d\nEdutige ETM-001 Lav Mic: https://amzn.to/2E92wxU\n\nPLEASE SUBSCRIBE FOR WEEKLY TRIP REPORTS!\n\nAirline: Air France\nFlight: AF65\nAircraft: Airbus A380-800 F-HPJH\nFrom: Los Angeles (LAX)\nTo: Paris (CDG)\nDeparture: 17:27\nArrival: 12:37\nFlight Time: 10:10\nSeat: 93L\nFlight Path: http://infl.it/af65\n\nOur flight today begins with a short drive into Los Angeles International Airport.  We stop briefly at the In-n-Out Burger to watch the planes landing, before making our way to the Tom Bradley International Terminal (TBIT).\n\nWe check in at the Air France area and then make our way to the TSA Security checkpoint.  From there we head airside towards our gate where our aircraft is waiting - the huge Airbus A380 that will take us across the Atlantic this evening.\n\nWe suffer a delay of around an hour due to a specific security threat that has been received to our flight.  We have to wait while FBI sniffer dogs search the aircraft, but thankfully nothing is found and we’re able to eventually board.  We take the escalator to the second floor to be able to board the upper deck of the huge A380.  We board through the forward doors making our way through the aircraft’s business class and premium economy to our section of economy at the rear of the aircraft, taking our seat in seat 93L.\n\nWe soon begin our pushback as the sun sets over California, and taxi out with a police escort to runway 24L.  We make a beautiful departure into the sunset getting a stunning view of Los Angeles lit up below.  We make our way across the US towards Canada under darkness, getting views of many major cities.  We cross the coast into the Atlantic just north of Labrador City, Canada, before passing to the south of Greenland where the sun rises. \n\nWe get some great views of the contrails forming as we cruise at a level of 39,000ft towards Ireland.  We cross the Irish Sea towards South Wales, making a left turn towards London before turning right and crossing the English Channel towards France.\nWe commence our descent into a rainy Paris, saying goodbye to the beautiful weather above the clouds and hello to a gloomy rainy day.  We make a trademark hard landing on runway 26L at Charles-de-Gaulle.  We taxi into the beautiful Terminal 2E before disembarking and making our way towards flight connections for our onward flight back to the UK.\n\nTIMELINE\n\n0:00:05 Driving along I-405 northbound towards LAX\n0:00:23 At the 'In-n-Out Burger' watching the aircraft landing\n0:00:37 Outside the Tom Bradley International Terminal (TBIT), walking into terminal\n0:02:03 Walking to TSA Checkpoint\n0:02:40 After TSA, walking to gate\n0:07:26 Our aircraft on stand at the gate\n0:07:48 Cabin crew arriving at gate\n0:07:56 Boarding aircraft, taking escalator to upper deck\n0:13:12 Cabin view\n0:14:58 Cabin view\n0:18:01 ATC: Pushback clearance\n0:19:38 Pushback and engine start\n0:21:50 Safety video\n0:25:07 Taxi to runway\n0:37:29 Line up, takeoff runway 24L\n0:45:44 Los Angeles lit up\n1:22:45 First drinks and snack service\n1:30:39 Cabin view\n2:11:51 Dinner service - chicken chosen\n2:12:24 Dinner service detail\n4:08:22 Cabin view\n7:15:11 Cabin view\n7:39:05 IFE Air Show Map overview\n7:42:27 IFE full walk through and demonstration\n8:00:44 Sunrise begins in east\n9:13:33 Cabin view\n9:16:49 Cabin view\n9:24:54 Walk through of rear galley, stairs to lower deck and elevator to lower deck\n9:27:54 Cabin view\n9:30:08 Seat overview\n9:30:32 Breakfast service\n9:53:19 Contrails forming from engines\n10:04:33 Top of descent\n10:32:48 Approach into Paris Charles-de-Gaulle\n10:45:47 Final approach to runway 26L at Paris\n10:47:17 Landing runway 26L\n10:56:42 Pulling onto stand\n10:58:28 Disembarking into the terninal\n11:11:57 Train to Terminal 2E main concourse\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "OCCUgcb4LvE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-01T13:59:47Z"
}