{
 "name": "American Airlines Full Flight | Dallas Ft Worth to Orlando | Airbus A321 (with ATC)",
 "description": "A full flight video with American Airlines onboard Airbus A321  N140AN operating flight AA2255 from Dallas Ft Worth to Orlando on February 18 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for entire flight**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nPATREON: http://patreon.com/inflightvideo\n\nAirline:  American Airlines\nFlight:  AA2255 (callsign \"AMERICAN 2255\")\nAircraft:  Airbus A321 N140AN\nFrom:  Dallas Fort Worth (DFW)\nTo:  Orlando (MCO)\nDeparture:  06:09\nArrival:  09:19\nFlight Time:  2:11\nSeat:  \nFlight Path: http://inf.li/mZL0J\n\nOur flight today begins at the gate in Dallas, on a cloudy morning.  Before long we push back from the gate and commence our taxi.  ATC advise us of a short delay due to restrictions in place over Florida, so we hold for a few minutes before being cleared to take off.  We depart to the south making a right turn over downtown Dallas, the lights of which shine through the low cloud making a beautiful effect.\n\nWe climb to our cruising altitude of 35,000ft as we head east across Texas.  We enter fly overhead Shreveport, LA and Jackson, MS as we cross the deep south.  Over Alabama we make a right turn as the sun rises.  We head towards Valdosta, GA before turning right and descending over Florida as the cloud clears.  Orlando Approach give us vectors for the ILS to runway 18L at Orlando, as we descend across the city for a beautiful landing ahead of schedule, before we taxi into the gate.\n\nTIMELINE\n\n0:09:01  Pushback and safety briefing\n0:12:55  Taxi to runway 17R\n0:20:40  Take off clearance, line up runway 17R\n0:21:57  Take off, hand off to departure\n0:26:06  Downtown Dallas shining through the low cloud\n0:40:07  Sunrise\n1:52:55  Top of descent\n1:57:45  Captain's arrival announcement\n2:10:23  Northern Florida\n2:20:10  Contacting Orlando Approach, vectors for visual runway 18R\n2:24:10  Runway change to 18L\n2:25:20  Contact tower, gear down\n2:25:55  Orlando Executive Airport\n2:28:42  Landing on runway 18L\n2:29:35  Taxi to ramp\n2:33:25  Pulling on stand\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "EG0NDoY69Wg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-04-14T12:59:57Z"
}