{
 "name": "Eastern Airways/Flybe Full Flight: Shetland-Sumburgh to Aberdeen - Embraer 170",
 "description": "A full length, full flight video with Flybe/Eastern Airways onboard Embraer 170 G-CIXV, operating flight BE2905 from Shetland-Sumburgh to Aberdeen on September 16 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for entire flight**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\nAirline: Flybe (op by Eastern Airways)\nFlight: BE2905\nAircraft: Embraer 170 G-CIXV\nFrom: Sumburgh (LSI)\nTo: Aberdeen (ABZ)\nDeparture: 14:30\nArrival: 15:01\nFlight Time: 0:31\nSeat: 4D\nFlight Path: http://infl.it/be2905map\n\nOur short flight today begins outside the terminal at Sumburgh Airport, at Lerwick, Shetland.  We enter the small terminal building and make our way through to the departure lounge, where our aircraft is ready to board.\n\nWe make our way out to the aircraft, the Embraer 170 that will take me and my fellow 5 passengers to Aberdeen today!  We soon start our engines and taxi out to the runway at Sumburgh before making a powerful takeoff, climbing out over the beautiful beaches of Shetland.  We make our way down towards the Scottish coast, flying off the coast of Aberdeen on a downwind leg to runway 34 at Aberdeen International.  We make a beautiful turn over the city of Aberdeen to make an on-time arrival into Aberdeen International.  \n\nWe disembark the aircraft and make our way out of the terminal to the kerb.\n\nTIMELINE\n\n0:00:06 Outside the terminal at Sumburgh Airport, walking into the terminal\n0:01:14 Our aircraft arriving from Aberdeen\n0:01:27 Walking to security\n0:01:44 Walking to gate\n0:02:09 Our aircraft preparing for boarding\n0:02:21 Boarding our aircraft, taking our seat 4D\n0:09:32 Engine start\n0:12:10 Taxi to runway 09\n0:14:58 Line up and takeoff runway 09\n0:23:24 Cabin view\n0:26:36 Cabin view\n0:30:17 Cabin view\n0:34:51 Cabin view\n0:42:48 Downwind for Aberdeen runway 34\n0:50:20 Final approach for runway 34\n0:53:58 Landing on runway 34\n0:59:51 Disembarking aircraft, walking to terminal\n1:01:21 Walking through terminal, exiting through baggage claim to kerb\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "DVhVhBdDIUg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-24T14:00:08Z"
}