{
 "name": "Flybe Full Flight: East Midlands to Edinburgh - Bombardier Dash 8 DHC8-Q400",
 "description": "A full flight video with Flybe onboard Bombardier DHC8-Q400 G-JECY operating flight BE263 from East Midlands to Edinburgh on August 26 2017.\n\n**Every moment of the flight included from terminal to terminal**\n\n**Now with live flight map courtesy of AirNav Radarbox24! Check out http://radarbox24.com **\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\nMERCH: http://store.inflightvideo.tv\n\nPATREON: http://patreon.com/inflightvideo\n\n\nAirline:  Flybe\nFlight:  BE266\nAircraft:  Bombardier DHC8-Q400 G-JECY\nFrom:  East Midlands (EMA)\nTo:  Edinburgh (EDI)\nDeparture:  13:41\nArrival:  14:30\nFlight Time:  0:49\nSeat:  7D\nFlight Path: http://infl.it/be266map\n\nOur flight today begins with a drive into East Midlands Airport, near to Nottingham, UK.  We walk into the terminal and proceed to security, where we pass in no time before heading to the newly renovated gate area.\n\nWe are soon called for boarding and we make our way across the ramp to our beautiful purple Dash 8 aircraft that will carry us to Scotland this afternoon.  Once everyone is onboard we push back and taxi to runway 27, taking off to the west before turning north towards Derby.  We get a great view of Derby on this clear summer day, before heading towards Sheffield and then Leeds on our journey north, cruising at an altitude of 24,000ft.  Before long we commence our descent into Edinburgh, which is enjoying a lovely clear day.  We establish on final approach over the beautifully blue Firth of Forth, getting a view of both the old and new Forth crossings, the newer one opening a couple of days after this flight was filmed!  We touch down smoothly in Edinburgh and taxi into the terminal, before disembarking and enjoying a bus ride to the terminal.\n\nWe make our way through the terminal emerging on the kerbside outside the terminal building.\n\nTIMELINE\n\n0:00:06 Driving into East Midlands Airport\n0:00:39 Walking into terminal building, heading to security\n0:01:57 After security, walking to gate\n0:04:34 Gate area\n0:05:21 Boarding and taking our seat in 7D\n0:06:58 Captain's welcome aboard\n0:14:47 Cabin view\n0:35:53 Pushback, engine start\n0:39:19 Taxi to runway 27\n0:43:36 Line up, take off runway 27\n0:46:24 Derby, UK\n0:49:32 Flight map starts\n0:50:46 Cabin view\n1:23:15 Descending into Edinburgh\n1:28:25 Commencing approach into Edinburgh over Firth of Forth\n1:30:13 Turning final approach to runway 24\n1:33:21 Landing on runway 24, taxi to gate\n1:41:18 Pulling onto stand\n1:43:20 Disembarking, bus into terminal\n1:51:31 Walking through terminal to kerbside\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "41hMGutoXVM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-09-15T13:00:10Z"
}