{
 "name": "KLM Full Flight | Amsterdam to Birmingham | Boeing 737-700 (Night Flight, No ATC)",
 "description": "A full length full flight video in real time with KLM, from Amsterdam to Birmingham, onboard Boeing 737-700 PH-BGR operating flight KL1435 on August 29 2016.\n\n**Every moment of the flight included from airport to airport. Cabin footage at many points of the flight, no ATC to allow relaxation**\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSFACEBOOK: facebook.com/inflightvideo\nTWITTER: twitter.com/inflightvideo\nINSTAGRAM: instagram.com/inflightvideo\n\nAirline:  KLM\nFlight:  KL1435\nAircraft:  Boeing 737-700 PH-BGR\nFrom:  Amsterdam (AMS)\nTo:  Birmingham (BHX)\nDeparture:  21:23\nArrival:  21:11\nFlight Time:  0:48\nSeat:  12A\nFlight Map:  https://goo.gl/eGaU4H\n\nThis evening's flight begins with a walk through the terminal at Amsterdam's Schiphol airport.  We head for our gate where our aircraft for this evening's flight is waiting for us, Boeing 737-700 PH-BGR.\n\nWe soon board the aircraft and take our seat in the exit row seat 12A, over the wing.  It is getting quite dark by the time we push back from the gate, and take the long taxi to runway 36L, the Polderbaan.  By the time we take off the sun has already set but there is still some sunlight on the horizon.  We cross the North Sea towards London, before making a right turn and commencing our approach towards Birmingham.\n\nWe make a smooth approach and landing into Birmingham, touching down smoothly on schedule at 21.11, with the time difference arriving 12 minutes before we took off from Amsterdam!\n\nWe walk through Birmingham Airport to the street. \n\nTIMELINE\n\n0:00:03  Walking through the terminal at Schiphol\n0:05:44 Boarding the aircraft through the jetway\n0:34:20  Pushback\n0:36:00 Taxi to runway 36L\n0:51:55 Takeoff from runway 36L\n1:13:10  Cabin footage\n1:41:00  Final approach to runway 33 at Birmingham\n1:43:30  Touchdown on runway 33 and taxi to terminal\n1:51:00  Disembarking through jetway and \n\n\n\nCREDITS\nThumbnail: Max Niessen (http://www.maxniessen.net)\n\n✈ ✈\nEquipment used:\n\nCameras: \nWindow footage: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nAirport and onboard footage: GoPro Hero Session http://amzn.to/2eBZTag\nMount: Generic suction mount http://goo.gl/E2vRBs\nYou need this for the suction mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\nScanner for ATC: Yupiteru MVT-7300\nRecorder for ATC: Olympus VN-741PC http://amzn.to/2fb4Lab\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "OwegFFo4UCA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-01-13T13:03:33Z"
}