{
 "name": "Qatar Airways Business Class Full Flight | Airbus A350-900 | Doha to London Heathrow (QR1)",
 "description": "A full flight video in Business Class with Qatar Airways onboard Airbus A350-900 XWB A7-ALC operating flight QR1 from Doha to London Heathrow on March 7 2017.\n\n**Every moment of the flight included from terminal to terminal**\n\nAWESOME AIRPORT HOTEL IN DOHA: http://www.hiahotel.com\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nPATREON: http://patreon.com/inflightvideo\n\nAirline:  Qatar Airways\nFlight:  QR1\nAircraft:  Airbus A350-900 XWB A7-ALC\nFrom:  Doha (DOH)\nTo:  London Heathrow (LHR)\nDeparture:  13:12\nArrival:  16:59\nFlight Time:  6:47\nSeat:  5K (Business Class)\nFlight Path: https://goo.gl/1qGzBp\n\nOur journey today begins in the Airport Hotel, located within the departure hall of Doha's Hamad International Airport.  We leave the hotel room and head for the Al Mourjan Business Lounge, Qatar Airways' exclusive lounge for business class passengers.  After breakfast we leave the lounge and head to the gate, where our ride for today, Airbus A350-900 A7-ALC, is ready for us to board.  We board through the forward doors and are taken to our seat, 5K, in the business class cabin.\n\nAfter pre-departure drinks and hot towels we are pushed back and taxi out to runway 34L to begin our 7 hour flight to London Heathrow.  We depart to the north, heading towards Bahrain before making a right turn towards Iran.  We fly overhead western Iran, getting a view of the wonderful scenery that Iran has to offer.  From there we fly towards Turkey, flying overhead Lake Van and towards the Black Sea coast.  From there we cross the Black Sea and enter Romanian airspace.  We fly over Bulgaria, Romania, Hungary and Slovakia, before flying over Czechia and crossing Germany.  Finally, we fly across The Netherlands and descending over the North Sea towards London.  We are treated to a beautiful clear arrival over Central London, making a final approach to runway 27L.  After taxying to Terminal 4 we disembark and head through to the kerb.\n\nCREDITS\nSpecial thanks to Paul Stewart (https://www.youtube.com/channel/UChEU4Y6IZ-xcuCQ8l0XDH4A) and James (When I Travel The World - https://www.youtube.com/user/whenitraveltheworld) for coming to the rescue with some of the Doha Airport footage after my memory card was lost at Heathrow.  Truly appreciate you guys for your help.\nThumbnail: Thanks to Piotr Knurowski (http://www.airplane-pictures.net/photo/855853/a7-ala-qatar-airways-airbus-a350-900/)\n\nTIMELINE\n0:00:05  In the room inside the Airport Hotel, walking out to departure hall\n0:00:49  Al Mourjan Business Lounge\n0:01:56  Leaving the Business Lounge and walking to the gate\n0:10:51  Our aircraft on stand, A7-ALC\n0:11:06  Boarding the aircraft\n0:11:57  Taking our seat for today - 5K\n0:15:27  View from the tail camera of baggage being loaded\n0:37:23  Safety video starring FC Barcelona.  Pushback and engine start\n0:55:55  Line up on runway 34L\n0:56:28  Take off from runway 34L\n1:08:30  Our member of cabin crew introduces herself and takes drink order\n1:24:51  Business class cabin walkaround and bathroom, bar area\n1:29:58  Business class menu and wine list\n1:31:53  Airshow map (3D Maps)\n1:45:54  Drinks - non alcoholic bubbly chosen (So Jenny). Served with orange juice and nuts\n2:44:45  Second drink - orange juice\n3:04:38  More non alcoholic bubbly, orange juice and nuts\n3:06:18  Walking to forward bathroom next to flight deck and crew rest area\n3:18:33  Chatting to a fellow passenger about my camera\n3:19:24  Showing external cameras - tail camera, belly camera, nose camera\n3:31:20  Showing IFE system and music selection\n3:44:47  Dinner service - starter of Dill Marinated Prawns with Smoked Salmon\n3:55:37  Dinner: Main course of Seared Red Snapper with Saffron Cream Sauce and Asparagus\n4:06:29  Dessert - Cheese Board\n4:28:48  Cabin walkaround - bar area\n4:41:40  Passing aircraft: Ukraine B737-800\n4:42:56  Passing aircraft: Emirates Airbus A380 (JFK-DXB)\n5:05:50  Reclining lay flat seat to sleep\n6:40:45  Cup of tea with biscuits\n6:48:07  Electric Window blind operation\n6:49:29  Landing cards and immigration fast pass handed out\n7:10:39  Seat upright for landing\n7:29:08  Approach over London, nose camera for final approach\n7:40:17  Landing on runway 27L\n7:46:15  Pulling on stand at T4\n7:48:02  Disembarking, immigration, walking to kerb\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "hWaZ4Aiu5zI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-03-17T13:59:54Z"
}