{
 "name": "United Airlines Boeing 747-400 Full Flight | San Francisco to London Heathrow | UA901 (with ATC)",
 "description": "A full length, full flight video with United Airlines onboard Boeing 747-400 N174UA operating flight UA901 from San Francisco to London Heathrow on June 18 2017.\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSCAMERA: http://amzn.to/2rPCpHS\nBATTERY: http://amzn.to/2rPPwJ7\nPATREON: http://patreon.com/inflightvideo\n\n\nAirline:  United Airlines\nFlight:  UA901 (callsign \"UNITED 901\")\nAircraft:  Boeing 747-400 N174UA\nFrom:  San Francisco (SFO)\nTo:  London Heathrow (LHR)\nDeparture:  13:40\nArrival:  07:00\nFlight Time: 09:20 \nSeat:  53K\nFlight Path: http://infl.it/ykdlv\n\n**Thumbnail: Thanks to Vladimir Mikitarenko http://www.airplane-pictures.net/photo/819176/n118ua-united-airlines-boeing-747-400/\n **\n\nOur journey today begins with the drive into San Francisco's International Airport, as we pull off of the interstate and into the terminal building.  We make our way through to check in, then to security and then to the gate at the compact International terminal.  After spending a while watching the aircraft movements at SFO we head to the gate and proceed to board our flight for today, the beautiful Boeing 747.  We take our seat in 53K and before long we push back and begin our long taxi out to runway 28L.  We depart to the north on what is a beautiful day for flying, getting a fantastic view of the Golden Gate Bridge and downtown San Francisco, before making a right turn and heading inland.  We pass to the north of Yosemite National Park and cross into Nevada near to Lake Tahoe.  From there we enjoy further clear skies across Nevada and into Idaho, getting a great view of the huge salt plains in the north of Nevada.  It clouds over as we head across Idaho, and make further progress across North Dakota and into Canada, where we cross Ontario and head into Quebec.  The sun starts to get lower in the sky over Quebec as we hit late evening, but as it is midsummer it never fully sets and gets completely dark.  We fly across Newfoundland coasting out to the North Atlantic, our northernmost point being over the southern tip of Greenland.  The dusk starts to get brighter again after around an hour, and it is soon bright daylight again out of the window.  Before too long we are closing in on the UK, flying over a cloudy Scotland and getting our first clear views of the UK over Lancashire.  We see the Isle of Man, Barrow in Furness, Blackpool, Southport, and Liverpool very clearly, before heading down towards the Birmingham area and commencing our descent.  We descend over Oxfordshire and get some amazing views of the home counties as we make our way to the ILS approach for runway 09L.  We touch down smoothly 30 minutes ahead of schedule, and taxi into our stand on Terminal 2's B Pier.  We then disembark through the forward doors again and make our way through the terminal emerging on a very warm summer morning in London.\n\nTIMELINE\n\n00:00:06  Driving into San Francisco Airport\n00:05:44  Walking into the International terminal at SFO, self-service check in\n00:08:01  Heading to TSA (security)\n00:08:52  After TSA, walking to gate\n00:12:09  Aircraft movements overlooking the ramp\n00:14:55  Our aircraft being towed onto stand\n00:16:16  Going down the escalator to our gate\n00:17:06  Waiting to board\n00:18:14  Boarding the aircraft and taking our seat in 53K\n00:29:29  Cabin view\n00:33:58  Cabin view\n00:50:15  ATC: Push and start clearance\n00:52:23  Safety video\n01:00:40  ATC: Taxi clearance\n01:14:55  Takeoff runway 28L\n01:17:20  Daly City, CA\n01:19:20  Overhead San Francisco, Golden Gate Park\n01:19:57  Golden Gate Bridge\n01:20:22  San Francisco\n01:20:56  Treasure Island\n01:21:37  Oakland, CA\n01:23:57  Concord, CA\n01:34:14  Eldorado National Forest and Yosemite National Park, CA\n01:37:12  Lake Tahoe, CA/NV\n01:44:41  Cabin View\n01:55:00  First drinks service\n02:08:59  Jarbridge Peak, NV\n02:15:57  Twin Falls, ID, Shoshone Falls\n02:21:37  Cabin View\n02:35:15  Meal service\n03:46:14  Cabin view\n05:15:15  Cabin view\n05:27:52  Cabin View\n06:05:54  Sunset over Newfoundland\n06:24:50  Midnight snack!\n09:43:04  Breakfast service - French Toast with sausage\n09:54:04  Isle of Man\n09:58:48  Barrow in Furness, UK\n10:02:05  Blackpool, UK\n10:03:41  Southport, UK\n10:05:24  Liverpool, UK\n10:06:37  Wirral Peninsula, UK\n10:11:05  Telford, UK\n10:21:23  Oxford, UK\n10:26:13  Commencing approach to London Heathrow, landing runway 09L\n10:30:59  Establishing on ILS to runway 09L\n10:35:31  Landing runway 09L, taxi to terminal 2\n10:43:56  Disembarking aircraft into terminal 2\n10:57:02  Walking to border control\n10:57:05  Walking from border control to kerbside at Heathrow\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "5WUPcBOWI3s",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-07-07T13:00:15Z"
}