{
 "name": "Air France La Premiere First Class - Best Upgrade Ever!",
 "description": "Sometimes you just need to take the plunge and splurge – this was one of those occasions and it could not have turned out better. \n\nI was scheduled to fly Air France Business Class from Paris to Singapore. An evening flight of some 12 and a half hours.  But when I turned up at the airport I asked the question – is it possible to upgrade to first class and what would the cost be?\n\nThis question and the answer provided (yes it is possible) started what was to become one of my best flights ever and led to my most indulgent meal ever – in the air or on the ground.\n\nJoin me as I step through the doors into another world.  A world of pure luxury and indulgence as I experience Air France La Premiere First Class from Paris to Singapore.  \n\nI knew little about Air France First Class before taking this flight other than knowing about their reputation for fine food.  What I wasn’t expecting was the high degree of personalized service from the Air France team and the exclusivity of La Premiere First Class. \n\nWhat what was it like and is Air France dining as good as they say it is? Join me as I fly Air France La Premiere First Class. \n\nLinks mentioned in the video:\n\nChristopher Cloos Eyewear: https://christopher-cloos.com/  \nSave 15% off your purchase by using the coupon code DENNIS15\n\nThe Part-Time Tourists https://www.youtube.com/@thepart-timetourists721\nMy brother and sister-in-law’s travel YouTube channel\n\n#airfrance #lapremiere #firstclass \n\n00:00 Introduction\n00:55 First Class Lounge\n03:53 Boarding\n05:20 Cheers!\n05:37 Departure and Take Off\n06:05 Cabin and Seat\n07:46 Drink from the Bar\n08:09 Amenities Kit\n08:31 Entertainment System\n09:16 Dinner\n12:37 Dessert Feast\n15:28 Bed Conversion \n16:04 PJs\n17:15 Morning Tea\n17:45 Breakfast\n18:48 Approach into Singapore\n20:17 Arrival Service\n21:36 The Menus",
 "source": "youtube",
 "source_id": "OE5R5Cj7_Jo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-12-04T08:00:07Z"
}