{
 "name": "Emirates NEW Premium Economy - What's it really like?",
 "description": "Please DO NOT order any glasses at this time from the company I featured in this video Christopher Cloos - it appears that they have entered administration and are undergoing a restructure. If you have ordered glasses and paid by credit card and these have not been delivered you should be able to get your credit card provider (bank) to reverse the charge. \n\nEmirates have just released their brand new Premium Economy cabin but what is it really like?  Join me as I give it the ultimate test on a 14-hour long-haul overnight flight from Sydney Australia to Dubai.\n\nEmirates New Premium Economy was only formally launched a few months ago and is available on selected flights to Sydney, London and Paris. Over the coming months, as more and more Emirates aircraft are retrofitted with this premium economy product, cities like New York, San Francisco, Singapore, Melbourne and Auckland will come online and feature this new premium economy class. \n\nThis flight review and Emirates New Premium Economy trip report covers the entire journey from check-in at Sydney Airport through to arrival in Dubai.  Along the way I’ll show you the Qantas First Class Lounge and the Emirates Lounge at Sydney Aiport, boarding, taxi and take off.  Then once in the air we’ll sit back, relax and enjoy the Emirates inflight service in this exclusive Premium Economy Class Cabin which is located at the very front of the Airbus A380. \n\nHere are the links I mentioned in my video:\nAir New Zealand Premium Economy: https://youtu.be/PReUs7aSoSg\nQantas A380 Premium Economy:  https://youtu.be/89yH3ci9Qmg\nSingapore Airlines A380 Premium Economy: https://youtu.be/iuJEP9s9UAU\nEmirates A380 First Class: https://youtu.be/ulgxwkG87Fs\n\nThanks for watching and please don’t forget to subscribe to my channel.\n\nCheers\n\nDennis\n\n#EmiratesPremiumEconomy #premiumeconomy #flightreview\n\n\n00:00 Introduction\n03:05 Qantas First Class Lounge\n04:37 Emirates Lounge\n05:31 Boarding\n06:26 First Impressions\n07:36 Taxi & Take Off\n08:09 Cabin\n10:04 The Seats\n11:56 Amenities & Bar Service\n12:25 ICE Entertainment System\n13:21 Dinner Service\n13:57 Sleep & Midnight Snacks\n14:42 Breakfast\n15:18 Descent into Dubai",
 "source": "youtube",
 "source_id": "hznnSFAX8aM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-11-20T08:30:10Z"
}