{
 "name": "Flying 3,300 Years Back in Time",
 "description": "Flying 3,300 Years Back in Time. This is the ultimate flight into history. Join me as I fly across the desert sands and one of the world’s largest man-made lakes to the outer reaches of the Ancient Egyptian Empire.  \n\nThis Egypt Air flight literary travels back in time 3,300 years to the reign of the most powerful Pharaoh of all Ramesses II.\n\nAbu Simbel was his statement piece, the ultimate vanity project as big as his ego.  It was built as a symbol of Ramesses’ power, to establish himself as equal to the gods and as a warning to his enemies – don’t mess with me or my fellow Egyptians. \n\nBuilt in 1295BC the Temple of Abu Simbel is dedicated to Ramesses II and the sun god Amon-Ra.  Right next door is the temple dedicated to his favourite wife, Queen Nefertari. \n\nMy Flight 3,300 Years Back in Time starts at Aswan Airport where we board an Egypt Air 737-800 for the quick 35 minute flight to Abu Simbel.  These 737’s re the work horse of the Egypt Air fleet and despite the dirty windows we get some great views of Lake Nasser on the way.  \n\nWe then travel the short distance by bus to the Temples which are located on the banks of Lake Nasser. They should however be under water! When the Aswan High Dam was built in the 1960’s the temples of Abu Simbel were doomed to be flooded. However, in a massive international engineering feat these temples were moved some 60 meters up the bank!\n\nThe temples of Abu Simbel are a sight to behold and a must see on any visit to Egypt.  They can be visited by flight or by road from Aswan. \n\nI was in Egypt escorting a private group arranged through our family business Bunnik Tours. This group had the flight option included as part of their itinerary.  All Bunnik Tours groups to Egypt visit Abu Simbel – generally by road allowing you to see the sun rise over the desert on your way out to these magnificent temples.\n\nFor full details on Bunnik Tours program of small group tours visit https://www.bunniktours.com.au/\n\n#egyptair #abusimbel #flightreview \n\n\n00:00 Introduction\n00:57 Boarding\n01:43 Take Off\n02:11 Lake Nasser\n03:04 Landing & Arrival\n04:06 First Glimpse of Abu Simbel\n05:25 Going Inside\n07:39 Temple of Queen Nefertari",
 "source": "youtube",
 "source_id": "9u9kdv84GnQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-10-30T07:11:04Z"
}