{
 "name": "Flying out of Australia - What's it REALLY like now?",
 "description": "After being closed for almost 2 years Australia's international borders are starting to open up and we are venturing out to explore the world again. \n\nBut what's it really like? What's changed? Should you be worried?\n\nIn this video I show you what it's really like to fly internationally from Australia now. What you need to do to prepare.  What you need to do at the airport. What's changed on board and what transiting through one of the world's biggest airport hubs is like. \n\nThis is my first international flight in almost 2 years and to say I'm excited is an understatement.  My job, my life and my passion is travel and it has been an incredible struggle to be grounded.  But now it's time to fly again. To help rebuild Australia and the world's travel and tourism industries and explore the incredible beauty this planet has to offer. \n\nJoin me as I fly with Singapore Airlines from Brisbane, Australia to Colombo, Sri Lanka via Singapore. \n\nI'll be covering my pre-departure preparations and give you tips to make the airport processes as easy as possible. \n\nOnboard we'll savor the famous Singapore Airlines hospitality and look at what's changed in the air. \n\nAnd finally we'll land in Sri Lanka and tackle the entry formalities before setting off to explore this incredible country.  \n\nThe purpose of this trip is that I am escorting the very first Bunnik Tours' international departure since March 2020.  This is a massive deal and the first step on the road to recovery for our team.  For our clients it also marks the return of being able to explore the world in the comfort and joy of a small group tour.  For more details on our global small group touring program visit www.bunniktours.com.au\n\nI'll be making videos of our trip around Sri Lanka so look out for them on this channel and the Bunnik Tours YouTube channel. \n\nDon't forget to also subscribe to my Instagram for photos of my latest travel adventures.  Insta: @DennisBunnikTravels \n\n#FlyingInternationalAgain #singaporeairlines",
 "source": "youtube",
 "source_id": "nN8ZbqlMgms",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-01-30T19:00:29Z"
}