{
 "name": "Frontier Airlines Airbus 321 Morning Flight (FT609): Indianapolis to Denver",
 "description": "Welcome!  This is a full flight video aboard Frontier Airlines Flight 609 with nonstop service from Indianapolis International Airport to Denver International Airport aboard an Airbus 321, Courtney the Cougar.\n\nAfter driving away from Louisville, Kentucky a bit before 2:00 AM, I arrived at Indianapolis International around 4:00 for a very early morning flight.  I wanted to fly out of Indianapolis for three reasons: first, I never had flown Frontier and I'd never flown out of Indy before.  Second, no cheap flights exist from Louisville to Denver, and third, Indianapolis International has been consistently voted one of the best airports in the country and I wanted to see why!\n\nFrontier Airlines is an ultra-low-cost carrier where you purchase each extra from seat selection to carry-on baggage.  My only interest is getting there safely, on-time, and in a window seat, so that's all I paid for.  The flight was spartan, but we took off and landed as scheduled.  Couldn't ask for anything else!\n\nThis video covers the KIND terminals, boarding process, pushback and taxi, take-off, sunrise, approach, and landing.\n \nThanks again for watching, and enjoy!\n\n--------------------------------\n\nFlight Information\nAirline: Frontier\nFlight Number: FT609\nDate of Flight: Tuesday, September 27, 2016\n\nOrigin Airport: Indianapolis International Airport (KIND/IND)\nDestination Airport: Denver International Airport (KDEN/DEN)\n\nDeparting Gate: B15\nScheduled Departure: 06:05 EDT\nActual Departure from Gate: 06:08 EDT\nTakeoff Runway and Time: RWY 23R / 06:16 EDT\nLanding Runway and Time: RWY 16L / 06:36 MDT\nScheduled Arrival: 06:49 MDT\nActual Arrival at Gate: 06:54 MDT\nArriving Gate: A46\n\n--------------------------------\n\nAircraft Information\nName: Courtney the Cougar\nType: Airbus 321-211\nRegistration: N702FR \nAircraft Delivery: October 2015\nEngines: 2x CFM International 56-5B3\nSeat: 9F\n\n--------------------------------\n\nVideo Highlights and Timeline\n00:15 - KIND Concourse A\n00:55 - KIND Concourse B and Boarding\n01:35 - Seat Tour\n01:55 - Pushback and Taxi\n03:45 - Takeoff\n06:00 - First Sunlight\n06:30 - Approach\n08:20 - Landing\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm lens\nLP Microphone\nGO PRO Hero\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "mD-6ArfTqA0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-12-01T21:11:05Z"
}