{
 "name": "Full Night Flight Chicago to Louisville (EMB 145)",
 "description": "Welcome!  This is the fifth and final video in a series relating to my trip to Denver with my wife Beth.  After enjoying a trip for our anniversary, it was time to head home to Louisville. \n\nThis video covers the full flight of our final leg home from Chicago O'Hare International Airport to my home, Louisville International Airport.  After a long taxi that featured a bit of planespotting around the airfield, we had a swift takeoff to the southwest turning south.  We had a quiet, smooth flight with the full moon beside us and a timely landing at Louisville's shorter runway, 17L, after crossing the Ohio River.  \n\nI did a complete, nine-concourse photo tour of Chicago O'Hare following a Windy City walk last March; read about it here!\nhttp://www.milesbyfoot.com/2015/05/walking-windy-city-part-8.html\n\nThanks again for watching, and enjoy!\n\nFlight Information\nAirline: United Airlines\nFlight Number: UA2027\nDate of Flight: Sunday, November 1st, 2015\n\nOrigin Airport: Chicago O'Hare International Airport (KORD/ORD)\nDestination Airport: Louisville International Airport (KSDF/SDF)\n\nDeparting Gate: B18\nScheduled Departure: 21:03 CST\nActual Departure from Gate: 21:02 CST\nTakeoff Runway and Time: RWY 22L / 21:16 CST\nLanding Runway and Time: RWY 17L / 23:02 EST\nScheduled Arrival: 23:20 EST\nActual Arrival at Gate: 23:11 EST\nArriving Gate: A14\n\nAircraft Information\nType: Embrear 145XR\nRegistration: N11113\nAircraft Delivery: November 2002\nEngines: 2x AN AE3007A1E\nSeats: 8C & 8D\n\nVideo Highlights and Timeline\n01:40 - Taxi\n04:00 - Takeoff\n07:00 - Descending over the Ohio River\n10:15 - Landing\n\nTechnical Specs\nCamera: Nikon D3200 with 18-55mm lenses\n\nA big thanks to my wife Beth as my cameraperson throughout the journey, and particularly for this segment!\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "5NI5HldzkNU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-03-13T14:58:57Z"
}