{
 "name": "Westjet new 787 Business Class - must try, must fly!",
 "description": "To try Dashlane free on 1 device visit https://www.dashlane.com/dennis and then to get 10% off a premium subscription use the coupon code DENNIS.   Massive thanks again to Dashlane for sponsoring this video.\n\nWestjet is to Air Canada what Virgin Atlantic is to British Airways or Virgin Australia is to Qantas. \n\nIn short, they are the upstart cool new-comer wanting to give the incumbent national carrier a run for their money.  Westjet recently invested in some brand new 787 aircraft and launched new international routes with a brand new business class product.   I was lucky to fly on one of these routes on a recent work trip.  Yes I paid for this ticket in full and no I didn’t get a freebie from the airline.  They didn’t even know I was coming – that said the Cabin Service Manager did recognise me in the departure lounge and welcomed me on board which was lovely. \n\nSo what were they like and are they up to the standard of Air Canada?\n\nThis Westjet 787 business class flight review covers my journey from Toronto to London Gatwick on the new Westjet business class product.  This trip report is biased in that they are my views and my views alone – you may have a different experience but from what I saw I think you’ll love flying Westjet. \n\nSo let’s fly…\n\nRoute:     Toronto (YYZ) to London Gatwick (LGW)\nLength:   3,570 miles, 6:28 hrs\nFlight:     WS3   Seat 4D\nAircraft:  Boeing 787-9  registration C-GUDH (Jan 2019) \nWhen:    22 Nov 2019\n\nCamera:  Panasonic HC-VX1\n\n\nThis video may not be reproduced without specific permission.\n\nQ&A Video:       https://youtu.be/6VoRFtNDC04\nThe Business Trip:   https://youtu.be/xgNXuBTyDTQ\nThe Business Trip – IndoChina:  https://youtu.be/pkNcpk2whLU\n\n\nFirst Class Reviews:\n\nSingapore Airlines A380 First Class Suites for 2    https://youtu.be/ITSNdSJ_MnU\nEtihad A380 First Class Apartment:   https://youtu.be/vAl5AFzQyIo\nEmirates 777 First Class:     https://youtu.be/hwHupTHbGVk\nEmirates A30 First Class:     https://youtu.be/ulgxwkG87Fs\nSingapore Airlines A380 First Class Suite:  https://youtu.be/yNoNrAXS38I\nThai Airways 747 Royal First Class:    https://youtu.be/UkhbKJb1WiU\nSwiss Air A340 First Class:    https://youtu.be/CuXLDEtpKzU\nQantas A380 First Class:      https://youtu.be/Mv4kBPUqGQU\nCathay Pacific 777 First Class:     https://youtu.be/52kIrUm3o08\nLufthansa First Class A340:    https://youtu.be/Y6evcYcwIqU",
 "source": "youtube",
 "source_id": "OeP2mysHvus",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-12-21T09:17:30Z"
}