{
 "name": "Los Angeles International Airport - LAX - Airport Tour",
 "description": "Thanks for watching this brief, partial tour of Los Angeles International Airport!\n\nAs a lifelong traveler, I never get tired of the process of boarding a plane going somewhere new and exciting and one of the little pleasures I enjoy is seeing a new airport on my way to my destination.\n\nLos Angeles International Airport is one of the busiest airports in the world, and one of the busiest international destinations in the U.S. This level of traffic makes it large and potentially unmanageable, but with a little preparation, you can navigate this airport easily and painlessly, and you might even have some fun along the way!\n\nThe airport features nine terminals, but this video covers only three: Terminals 2, 3, and B, the Tom Bradley International Terminal. You won't get bored in LAX, with plenty of places to explore. While the airport is as modern as any you'll find around the world, it still has some historic charms, too.\n\nThis video was recorded in November 2019, before the COVID-19 pandemic.\n\nWhile travel around the world is on hold for many of us, I hope you enjoy this chance to explore one of the most exciting airports in the world. As soon as it's safe, I hope to see you all in the skies!\n\n#airport #airporttour #lax #losangeles #california #tbit #aviation #travel \n\nVideo Timeline\n00:00 - Intro\n00:20 - Terminal Overview\n00:45 - Terminal 2 (Delta/SkyTeam, Aer Lingus, Aeromexico, Virgin Atlantic, WestJet)\n01:25 - Interterminal Shuttle\n01:45 - Terminal 3 (Delta/SkyTeam)\n02:05 - Tom Bradley International Terminal (Remaining International Carriers)\n03:55 - Conclusion\n04:30 - End Screen\n\n______________________\n\nGear\nGoPro Hero 7 Black\nEdited in Adobe Premiere Pro/Audacity\n\nMusic - Cyan Waters by Magnofield and Ski Trip to Mars by Magnofield\n\nAircraft and Flight Information from planespotters.net, flightaware.com, and wikipedia.com.\n\nThis video is the sole property of www.milesbyfoot.com. Any unauthorized use of the video or audio content from this video is prohibited. If you'd like to use any portion of this video, please email me at milesbyfoot@gmail.com and I'll be happy to work with you!",
 "source": "youtube",
 "source_id": "yyVLqUCqWAw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-07-11T16:00:14Z"
}