{
 "name": "Seattle-Tacoma International Airport - SEA - Complete Airport Tour",
 "description": "Thanks for watching this tour of Seattle-Tacoma International Airport!\n\nAs a lifelong traveler, I never get tired of the process of boarding a plane going somewhere new and exciting, and one of the little pleasures I enjoy is seeing a new airport on the way to my destination.\n\nSeattle-Tacoma International Airport, or \"Sea-Tac,\" is the busiest airport in the American Pacific Northwest, and it's the eighth busiest in the United States. It's home to a Delta hub and, perhaps more importantly, Alaska Airlines, a large, legacy carrier that provides non-stop service to eighty destinations across North America from SEA. The region has long been associated with aviation, travel, and innovation, so it stands to reason that their airport would be easy to use, efficient, and no-nonsense.\n\nThis tour covers all six of Seattle's airside concourses, including four primary concourses and two satellite concourses, connected to the terminal via two separate underground people movers. I was there during the very early morning for a short layover, but it was enough time to see it all!\n\nSeattle's a great departure and arrival airport, and if you're connecting like I was, you won't have any problem getting to your gate if you follow this tour. \n\nFeel free to ask questions or share your comments about SEA below. I love hearing from you and having your insight available for everyone to enjoy!\n\nAirports are our gateway to the world, and I hope you enjoy this and other airport tour videos from Miles by Foot!\n\n#airport #airporttour #aviation #travel #seattle #seatac #sea #boeing #alaskaairlines #deltaairlines\n\nVideo Timeline\n00:00 - Intro\n00:30 - Terminal Overview\n00:45 - Concourse A (Delta, United, Air Canada)\n01:45 - Concourse B and Airside Central Pavilion (Southwest, Spirit, JetBlue)\n02:15 - Concourse C (Alaska Airlines)\n02:55 - Concourse D (Alaska, Frontier, American)\n03:45 - Concourse N (Alaska Airlines)\n04:15 - Using the People Mover\n04:40 - Concourse S (Long Haul, International)\n05:00 - Conclusion\n05:45 - End Screen\n\n--------------------------------\n\nGear\nGoPro Hero 7 Black\nEdited in Clip Studio/IrfanView/Audacity\n\nMusic - Become by Hosini & Jones and Blue Dot by Hosini & Jones\n\nAircraft and flight information from Planespotters.net, flightaware.com, flysea.org, and wikipedia.com.\n\nMap graphics and information from OpenStreetMap.com. © OpenStreetMap contributors\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "2S4sMFZB7kg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-08-27T16:00:00Z"
}