{
 "name": "DIVERSION! Hainan Airlines A330-300 Landing and Takeoff at Calgary Airport (4K)",
 "description": "On January 23rd, this Hainan Airlines A330-300 diverted to Calgary. Originally flying from Shanghai to Seattle, poor visibility in Seattle and most of the west coast that day caused this cargo-only flight to divert here. They spent a couple hours on Apron 9 before departing again and successfully making it into Seattle.\n\nInterestingly though, just a few years ago, this would have been an entirely normal sight. Hainan Airlines actually flew passenger flights between Calgary and Beijing from 2016 up until 2019. In October of 2019 though, the route became seasonal, with plans to return in the summer of 2020, which obviously didn't happen.\n\nStill, nice to see Hainan here again! Enjoy the video.\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting this plane spotting video! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Hainan Airlines (CHH/HU)\nAircraft: Airbus A330-343 (A333)\nFlight Number: HU445\nLivery: Standard (with Film Festival sticker)\nEngines: 2x RR Trent 772B-60\nRegistration: B-8118 \nRoute: Shanghai (PVG) - diversion to Calgary (YYC) - Seattle (SEA)\nCallsign: HAINAN 445 heavy\nRunway used: 35R arrival, 35L departure\nDate filmed: January 2022\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2022\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "qMi3IWHnksk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-01-27T15:00:35Z"
}