{
 "name": "FINNAIR A350 IN CALGARY?! New Route for Eurowings Discover (4K)",
 "description": "Back on August 1st, German carrier Eurowings Discover launched flights to Calgary from Frankfurt, serving the route 4 times weekly to start. However, due to presumably a lack of planes and/or crew, they’ve wet-leased a number of planes from Finnair, including this Airbus A350.\n\nThis wet lease agreement means that both the plane and crew are from Finnair, but they’ll be flying on behalf of Eurowings Discover. It’s a pretty unique arrangement, especially for us spotters since Finnair is one of those airlines that you’d never expect to see here.\n\nThis also marks the first official scheduled A350 service into Calgary! Enjoy this new seasonal visitor!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Eurowings Discover (operated by Finnair) (OCN/4Y)\nAircraft: Airbus A350-900 (A359)\nFlight Number: 4Y72/73 \nLivery: Standard\nEngines: 2x Rolls Royce Trent XWB-84\nRegistration: OH-LWC\nRoute: Frankfurt (FRA) - Calgary (YYC) - Frankfurt (FRA)\nCallsign: OCEAN 7 Victor / 7 Alpha heavy\nRunway used: 35R\nDate filmed: August 2022\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2022\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "RueIts5uwgM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-08-10T21:00:13Z"
}