{
 "name": "RARE Hawker Siddeley HS 748s STILL FLYING! Air Creebec in Timmins, Ontario [4K]",
 "description": "The Hawker Siddeley HS 748 is a British turboprop airliner designed in the late 1950s, and was developed as a 40-48 seat replacement for the DC-3.\n\nAs a result, it was built to be a simple and rugged aircraft that could land on unpaved runways and haul north of 12,000 pounds of cargo at a time.\n\nA few of these still fly in Northern Ontario, and with only 5 of these planes total flying in Canada, this is one of the rarest aircraft types in the country.\n\nSo, for @MarkBrandonAviation and I, it was worth making another trip to Timmins, Ontario just to see Air Creebec's two HS 748s in action!\n\nMany thanks to those who helped make these shots possible.\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\n00:00 - Air Creebec HS 748 C-FPJR to Attawapiskat (YAT)\n04:56 - Air Creebec HS 748 C-FLIY to Attawapiskat (YAT)\n06:44 - Air Creebec HS 748 C-FLIY from Attawapiskat (YAT)\n09:17 - Air Creebec HS 748 C-FLIY to Attawapiskat (YAT)\n13:47 - Air Creebec HS 748 C-FPJR from Kashechewan (ZKE)\n15:25 - Air Creebec HS 748 C-FLIY from Attawapiskat (YAT)\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2022\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "DMwgdLAZU5c",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-11-29T22:00:08Z"
}