{
 "name": "VIP Aircraft Turned FREIGHTER! AirX Charter Airbus A340-312 at Calgary International Airport",
 "description": "AirX Charter is an operator that mostly specializes in VIP and luxury transportation. This particular A340 is normally outfitted in an all-business class configuration, seating up to 100 passengers. It also took the Calgary Flames to China during the 2018-2019 hockey season!\n\nDue to the ongoing COVID-19 crisis though, this aircraft has been seen all over the globe flying much-needed PPE to impacted countries. You can see the majority of the window shades closed aft of the 2nd set of entry doors.\n\n9H-BIG stopped in for fuel a few days before the visit seen here, flying PPE from China to Santo Domingo, Dominican Republic. It came back to Calgary a couple days later and stayed a while (as seen here), before departing to Guangzhou to take more PPE to Edmonton, Alberta.\n\nAlways nice to see an A340, especially this one helping in the fight!\n\nWith thanks to Sab for the use of his truck bed for the landing: https://www.instagram.com/sab_cortez_\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nSOCIAL MEDIA\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: AirX Charter (AXY)\nAircraft: Airbus A340-312 (A343)\nFlight Number: AXY2407/AXY2720\nLivery: Standard\nEngines: 4x CFMI CFM56-5C3/F \nRegistration: 9H-BIG\nRoute: Santo Domingo (SDQ) - Calgary (YYC) - Guangzhou (CAN)\nCallsign: LEGEND 2407 heavy / LEGEND 2720 heavy\nRunway used: 35L / 17R\nDate filmed: May 26th/29th 2020\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song: \"Take Flight\" by Nyhtian: https://www.youtube.com/watch?v=bCTTwQ_269c\n\n© Alex Praglowski Aviation 2020\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "UEA1P4XqhIw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-06-03T23:00:10Z"
}