{
 "name": "WestJet Retires First 767 - C-FOGJ's Final Takeoff from Calgary Airport",
 "description": "As with many other aircraft around the world these days, the time has come to say farewell to WestJet's four 767s. Their first one, C-FOGJ, left Calgary this morning after 5 months of storage for Lake City, Florida, to start a new life as a cargo bird for Amazon's Prime Air.\n\nC-FOGJ was with WestJet for just shy of 5 years, having been delivered to Calgary early in the morning on August 27th, 2015. The addition of the 767s was a stepping stone for WestJet, and they launched transatlantic service to London-Gatwick from 5 Canadian cities the following year.\n\nWith the success of those transatlantic flights and the subsequent investment in the Dreamliners, the 767s were no longer needed, and this was slated to be their last summer anyway. Sadly though, their final passenger flights came much sooner than expected, and all four were stored in Calgary by the end of March.\n\nSo, long, FOGJ! Enjoy this bittersweet catch.\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nSOCIAL MEDIA\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: WestJet (WJA/WS)\nAircraft: Boeing 767-338ER (B763)\nFlight Number: WS8956\nLivery: Revised (2015)\nEngines: 2x General Electric CF6-80\nRegistration: C-FOGJ\nRoute: Calgary (YYC) - Lake City (LCQ)\nCallsign: WESTJET 8956 Heavy\nRunway used: 35R\nDate filmed: August 2020\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song: \"Take Flight\" by Nyhtian: https://www.youtube.com/watch?v=bCTTwQ_269c\n\n© Alex Praglowski Aviation 2020\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "F57ZJ7osOSQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-08-19T20:36:41Z"
}