{
 "name": "Buffalo Airways Lockheed L-188 Electra [C-FIJX] Landing and Takeoff at Red Deer Regional ᴴᴰ",
 "description": "As some of you may know, Buffalo Airways (yes, from the TV show) is an airline based in northern Canada that operates a number of classic aircraft, namely, several Douglas DC-3, Curtiss C-46, and Lockheed L-188 Electra aircraft. The Electra is their most recent aircraft type to be added to the fleet, approximately eight years ago. This particular one was the 3rd Electra to enter the Buffalo fleet, in 2010, and was formerly operated by Reeve Aleutian Airways, and was originally delivered to Tasman Empire Airways in 1959! I happened to be passing through Red Deer and noticed that this classic bird was doing circuits. As seen in this video, it landed on runway 17 at Red Deer Regional Airport, stopped on the taxiway for a bit, then went right back out for one last circuit before returning to the Buffalo ramp. I didn't include the last arrival because it exited even earlier and the view wasn't much different. However, ATC is included, and I hope you enjoy this very special catch at an airport I've never spotted at before!\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFO\nAirline: Buffalo Airways (BFL)\nAircraft: Lockheed L-188 Electra\nAircraft Name: None\nLivery: Water Bomber\nEngines: 4x Allison 501-D13\nRegistration: C-FIJX\nRoute: Red Deer Regional (YQF) - Red Deer Regional (YQF)\nCallsign: Tanker 416\nRunway used: 17\nDate filmed: May 19, 2017\nLocal time: 1100\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2017\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "3RUIjlfdy4s",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-05-27T00:21:23Z"
}