{
 "name": "Dear KLM - A Plea from Calgary Plane Spotters",
 "description": "Thanks for watching this video! On behalf of all Calgary plane spotters, I have a special favor to ask of you. KLM's 747-400 PH-BFC is named after my home city of Calgary, Canada, and unfortunately, as many already know, 747-400s are rapidly being retired from service by several airlines. PH-BFC herself is already 28 years old and won't be flying for much longer. What I, or rather, we, are trying to do is get KLM to fly the \"City of Calgary\" to Calgary at least one time before she's retired from service. Whether this is on her retirement flight or an equipment swap on the regular Amsterdam flight, it would be an occasion to remember. KLM is such a plane spotter-friendly airline, and this seems like something that they could do. \n\nI believe we can make this happen, but I need your help! Share this video with KLM using the hashtag #klm747yyc, tag KLM in your posts, and if you or someone you know works for KLM, please pass it along! Bring \"Calgary\" home!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nPHOTO CREDITS:\n(All photos used with permission from their respective photographers)\nPhoto #1 (MD-11): Aaron Stayner - https://flic.kr/p/a4j3Bp\nPhoto #2 (747): Robert Karam\nPhoto #3 (DC-10): Frank van der Voet\nPhoto #4 (747): Dennis Van der Meulen - https://flic.kr/p/R9wKes\nPhoto #5 (747): Robert Karam\nPhoto #6 (747): Robert Karam\nVideo thumbnail: Robert Karam\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nMusic is \"Trio for Piano, Cello, and Clarinet\" by Kevin MacLeod (incompetech.com)\n\n© Alex Praglowski Aviation 2017\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "dMeGhxSQ1R8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-09-24T18:06:35Z"
}