{
 "name": "Kalitta Air 747-446(BCF) [N743CK] Dawn Taxi and Takeoff from Calgary Airport ᴴᴰ",
 "description": "Just hit 5,000 subscribers! Thanks to everyone for their support!\n\nEvery summer, several equestrian events are held in Spruce Meadows, a venue south of Calgary famous for its show jumping horse events. Show jumping horses are brought in from all around the world for these events, and this particular flight was bringing some of the horses for the \"Masters\" tournament from Europe. This particular flight is an annual visitor that YYC spotters welcome each year, a 747 from Liege carrying dozens of professional show jumping horses. The past couple of years, National Air Cargo has flown the horses in, although Israeli carrier CAL Cargo Airlines flew them in last year. This year was, obviously, different as well, with this Kalitta Air 747 in a partial DHL livery! This bird was ferrying out empty on September 3rd to Dover Air Force Base after bringing the horses in from Liege the day before. Enjoy this early morning departure with ATC!\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFO\nAirline: Kalitta Air (CKS/K4)\nAircraft: Boeing 747-400BCF (B744)\nAircraft Name: None\nLivery: White with Kalitta Air titles and DHL yellow painted empennage\nEngines: 4x GE CF6-80C2B1F \nRegistration: N743CK\nRoute: Calgary (YYC) - Dover Air Force Base (DOV)\nCallsign: Connie 9502 heavy\nRunway used: 35L\nDate filmed: September 3, 2017\nLocal time: 0800\nFlightAware: http://flightaware.com/live/flight/N743CK\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFlickr: https://www.flickr.com/photos/dude8472productions/\nTwitter: https://www.twitter.com/dude8472_YYC\nInstagram: https://www.instagram.com/dude8472productions\nChannel: https://www.youtube.com/dude8472productions\nOfficial Website: https://www.dude8472productions.com\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© dude8472productions 2017\n\nThis video is the property of dude8472productions and may not be used in any way without permission.",
 "source": "youtube",
 "source_id": "ap9LuepzK54",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-04T23:30:26Z"
}