{
 "name": "MASSIVE U.S. Air Force C-5M Super Galaxy Landing on a 6,500 ft Runway at Lethbridge Airport",
 "description": "This is easily one of my best catches this year! This C-5M Super Galaxy of the USAF arrived a couple days ago into Lethbridge, a small city of 90,000 in Southern Alberta that hosts an impressive airshow every two years. The airshow itself commonly features heavy military aircraft from both the United States Air Force and Navy, along with some from the Canadian Forces. The Lockheed C-5M Super Galaxy, however, was by far the largest guest that was confirmed by the airshow. Thus, I made the 2 hour trip to Lethbridge a day before the show in hopes of seeing exactly that. And see it I did, along with countless other special planes arriving to be put on static display at the 25th Lethbridge International Air Show. This particular C-5M is part of the 60th Air Mobility Wing based at Travis Air Force Base in California, and is one of the USAF's newer C-5s, delivered in 1988 as a C-5B and then converted to a C-5M in 2014. This video includes the aircraft doing a flyby of the airport, landing, taxiing, and some shots of the airplane parked at the airshow the following day. ATC is included, I hope you all enjoy this very special catch!\n\nThanks for watching!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFO\nOperator: United States Air Force (USAF)\nAircraft: Lockheed C-5M Super Galaxy (C5M)\nAircraft Name: None \nLivery: Standard USAF Grey\nEngines: 4x General Electric F138-GE-100\nRegistration: 87-0034\nRoute: Travis Air Force Base (SUU) - Lethbridge Airport (YQL)\nCallsign: FRED 36\nRunway used: 23\nDate filmed: July 13, 2017\nLocal time: 1400\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFlickr: https://www.flickr.com/photos/dude8472productions/\nTwitter: https://www.twitter.com/dude8472_YYC\nInstagram: https://www.instagram.com/dude8472productions\nChannel: https://www.youtube.com/dude8472productions\nOfficial Website: https://www.dude8472productions.com\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© dude8472productions 2017\n\nThis video is the property of dude8472productions and may not be used in any way without permission.",
 "source": "youtube",
 "source_id": "2eCltGq0NkE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-07-16T04:37:52Z"
}