{
 "name": "LAST VISIT? Detroit Red Wings McDonnell Douglas MD-81 at Calgary Airport",
 "description": "Since 2011, the Detroit Red Wings and Detroit Tigers have been flying on this McDonnell Douglas MD-81, operated by Olympia Aviation, based at Detroit Metro Airport.\n\nNovember 682 Romeo Whiskey has been a highlight for plane spotters across North America during each team’s respective seasons, especially since it is the last flying MD-81 on the continent.\n\nHowever, with it being 43 years old now, Olympia Aviation has reportedly acquired a 737-800 to replace it, and that’s rumoured to enter service fairly soon.\n\nSo, when the Red Wings came to play the Calgary Flames last month, that was likely the last ever visit of this airplane here.\n\nAs a lifelong fan of the MD-80, I am sad to see this go, but I’m glad to have seen it here quite a few times over the years, and especially on this last visit. Enjoy the video!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPraglowski\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Olympia Aviation\nAircraft: McDonnell Douglas MD-81 (MD81)\nLivery: White with blue and red\nEngines: 2x Pratt & Whitney JT8D-217C\nRegistration: N682RW\nRoute: Vancouver (YVR) - Calgary (YYC) - Seattle (BFI)\nCallsign: NOVEMBER 682 ROMEO WHISKEY\nRunway used: 35L / 17R\nDate filmed: February 2024\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2024\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "LiWQQoss2n8",
 "type": "Plane Visit",
 "company": "Olympia Aviation",
 "stops": ["YYC"],
 "postdate": "2024-03-10T14:00:23Z"
}