{
 "name": "RARE LOCKHEED ELECTRAS STILL FLYING! Air Spray L-188s at Red Deer Regional Airport",
 "description": "Red Deer Regional Airport, located about halfway between Calgary and Edmonton, is home to quite possibly the largest number of Lockheed Electras anywhere in the world.\n\nOne major tenant there, Air Spray, has 9 active Electras in the fleet along with a few others stored at the airport. That is quite remarkable, since there are just a dozen or so of these late-1950s airliners still active today, all of which are here in Canada.\n\nThese planes are used as firefighting air tankers, and are able to carry 3,000 gallons of fire retardant. According to Air Spray, the Electra's speed, performance, and maneuverability, makes it one of the most effective, quote, \"large capacity\" air tankers for fighting fires. \n\nEach spring, Air Spray is usually pretty busy with training and test flights, before they go out on their contracts across Alberta, B.C., and the Yukon.\n\nI've never actually managed to film one of their Electras flying until now, and a few weeks ago, got two of them going for training flights with a couple of circuits in between.\n\nI'm glad to have finally gotten these rare planes in action, especially with some great sound from those four Allison turboprops! Enjoy the video!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPraglowski\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Air Spray (ASB)\nAircraft: Lockheed L-188A Electra (L188)\nFlight Number: ASB498T/485T\nLivery: Standard\nEngines: 4x Allison 501-D13\nRegistration: C-FDTH/C-GZVM \nRoute: Red Deer (YQF) - Red Deer (YQF)\nCallsign: AIR SPRAY 498/485 Trainer\nRunway used: 17\nDate filmed: March 2024\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2024\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "oIy3DNkhfwk",
 "type": "Plane Spotting",
 "company": "Air Spray",
 "stops": ["YQF"],
 "postdate": "2024-04-14T14:00:36Z"
}