{
 "name": "American Airlines Boeing 777-300ER Full Flight: London to New York (AA107) (with ATC)",
 "description": "A full length full flight video in real time with American Airlines, from London Heathrow to New York JFK, operating flight AA107 on September 12 2015.\n\n**Every moment of the flight included from boarding to deboarding.  ATC from entry into US airspace.**\n\nThe video begins at the gate in London Heathrow's Terminal 3, while we await boarding.  After a short wait we board the aircraft and take our seat in seat 28L.  It's not long then before we start to push back and receive the safety briefing.  We taxi out to runway 27R, before making a long takeoff run, rotating into the early evening.  We head west towards South Wales, crossing the Irish Sea and then across southern Ireland at our initial cruising altitude of 32,000ft.\n\nWe head out into the Atlantic for our 4hr crossing to Canada, climbing to 34,000ft, before making a left turn just south of Newfoundland to fly off the coast of Nova Scotia.   Once we enter the USA near to Maine, we can hear the ATC for the remainder of the flight.  Due to stormy weather in New York we make an extended hold just north of Cape Cod.  We eventually join a long queue of aircraft making the evening approach into JFK's runway 13L along Long Island.  We make a stunning night time approach, making a series of low right turns over New York before a stunning landing into a wet JFK.  We then taxi into AA's Terminal 8, and exit the aircraft into a busy JFK airport.\n\nKey moments in video:\n\n00:11:40 Pushback\n00:12:30 Safety video/engine start\n00:24:40 Captain's welcome announcement\n00:28:40 Line up, takeoff runway 27R\n00:52:00 Crossing Welsh coast into Irish Sea\n00:56:25 Captain gives route and weather information\n01:07:00 Crossing Southern Ireland\n01:19:30 Crossing Irish coast into Atlantic\n01:37:35 Dinner service (Thai Green Curry chosen) \n02:06:25 Altercation between passengers resulting in intervention by the cabin crew\n02:44:45 Demonstration of IFE\n06:52:10 Entering US Airspace. ATC begins, contacting Boston Center\n06:56:50 Instructions from ATC to hold due to weather at JFK\n07:00:30 Captain announces delay due to holding pattern\n07:07:45 Holding pattern commences\n08:00:47 Commencing approach over Long Island.  Captain asks cabin crew to prepare for landing\n08:05:00 Descend to 3,000ft\n08:06:15 Contacting JFK Approach\n08:09:55 Reducing speed\n08:14:11 Turning to intercept final\n08:15:03 Cleared for VOR approach\n08:16:00 Contacting tower, cleared to land\n08:16:55 Breaking through clouds over New York\n08:19:10 Sharp turn at low level on Canarsie approach\n08:20:55 Touchdown, with lots of spray\n08:27:30 Pulling on stand\n08:32:38 Deboarding\n\nVideo taken from seat 31L.\n\nAirline:  American Airlines\nFlight:  AA107\nAircraft:  Boeing 777-300ER N728AN\nFrom:  London - Heathrow (LHR)\nTo:  New York - John F Kennedy (JFK)\nDeparture:  17:22\nArrival:  20:13\nFlight Time:  07:51\nSeat:  28L\nFlight Path:  http://goo.gl/Snu9PZ\n**NEW**: Moving real time flight map of this flight: http://inflightvideo.tv/a/1\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "SL1ivM6epRo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-09-19T00:38:18Z"
}