{
 "name": "American Airlines Full Flight | Dallas Fort-Worth to Philadelphia | Boeing 737-800 **with ATC**",
 "description": "A full length full flight video in real time with American Airlines, from Dallas Fort-Worth to Philadelphia, onboard Boeing 737-800 N880AN operating flight AA1327 on April 4 2016.\n\n**Every moment of the flight included from airport to airport. ATC for full flight.**\n\nOur trip today begins at gate A29, at Dallas Ft-Worth International (DFW).  We commence boarding, getting delayed in the air bridge as a first class passenger could not recline his seat, so boarding was delayed by around 15 minutes to allow maintenance to fix the seat.  We eventually continue boarding and take our seat in seat 9A.\n\nIt isn't long before we push back, and taxi out to runway 17R at DFW.  We depart to the south, climbing out over Dallas and making a left turn towards Arkansas.  We climb over northwest Texas, towards Texarkana, before crossing Arkansas getting a great view of Little Rock, AR.\n\nFrom there the cloud builds up below as we continue northwest over Missouri, crossing the southern corner of Illinois into Indiana, before making a right turn south of Indianapolis.  We then fly south of Dayton, Ohio, and Columbus, Ohio, before crossing into Pennsylvania south of Pittsburgh.  We then head east across PA, turning right over Harrisburg for an arrival that takes us over Lancaster and into the north of Philadelphia on a BOJID ONE arrival.  We break through the clouds into a rainy day in Philly, getting a good view over the city as we commence our approach into runway 27R at PHL.\n\nOnce we've landed, we taxi into the gate, where we shut down our engines.  At this point the captain welcomes us to Philadelphia and lets us know that we've had a wounded warrior on the flight today - Staff Sergeant Travis Mills, who was seriously wounded in Afghanistan losing all of his limbs in an IED attack.  The aircraft gives a rapturous round of applause to thank him for his service.  We then disembark into the terminal at Philadelphia to make our connecting flight.\n\nKey moments in video:\n0:01:16  Boarding at the gate\n0:27:22  Push back and start\n0:31:30  Taxi to runway 17R\n0:36:15  Line up and wait runway 17R\n0:38:16  Take off from runway 17R\n0:40:29  Irving Mall, Irving, TX\n0:41:07  Irving Lake, Irving, TX\n0:42:35  Dallas, TX\n0:43:15  Dallas Love Field (DAL)\n0:45:10  Garland, TX\n0:46:05  President George Bush Turnpike\n0:46:40  Lake Ray Hubbard, Lavon Lake\n0:51:03  Greenville, TX\n0:52:31  Jim Chapman Lake, Commerce, TX\n0:57:25  Clarksville, TX\n0:58:43  Red River (state line between TX and AR)\n1:16:13  Little Rock, AR\n1:23:26  Snack service\n2:11:15  Cabin overview\n3:03:17  Contacting Philadelphia approach\n3:16:08  Contacting Philadelphia tower, cleared to land\n3:18:49  Delaware River\n3:20:30  Touchdown on runway 27R\n3:27:00  Captain gives an announcement about the wounded soldier we have on our flight today, round of applause from the aircraft.\n\nVideo taken from seat 9A.\n\nAirline:  American Airlines\nFlight:  AA1327\nAircraft:  Boeing 737-800 N880AN\nFrom:  Dallas Ft Worth (DFW)\nTo:  Philadelphia (PHL)\nDeparture:  15:42\nArrival:  19:23\nFlight Time:  02:41\nSeat:  9A\nFlight Path:  http://goo.gl/lBHYlG\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "cs53rVYaGeU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-07-22T08:31:36Z"
}