{
 "name": "American Airlines Full Flight | Philadelphia to Las Vegas | Airbus A321 **with ATC**",
 "description": "A full length full flight video in real time with American Airlines, from Philadelphia to Las Vegas, onboard Airbus A321 N196UW operating flight AA735 on April 1 2016.\n\n**Every moment of the flight included from airport to airport. ATC for full flight.**\n\nOur journey begins at the gate inside the Philadelphia International Airport, with a 1h40m delay.  We finally board our flight and are welcomed aboard, before beginning our taxi out to the runway.  This plan soon comes to a halt however, as the airport is placed on ground stop due to a passing storm.  We sit, engines shut down, for almost two hours (thankfully not filmed in its entirety!) before we finally get clearance to taxi out to runway 27L and depart on a Pottstown departure.\n\nWe get airborne on a beautiful evening, with wonderful light and a lightning storm in the distance providing a spectacular backdrop.  Once we reach cruising altitude, we begin chasing the sunset across North America, before we finally lose the light completely around two hours in, south of Chicago.  Our only glimpse of life on the ground now is the numerous cities we fly over, lit up brightly in the night sky.  Onboard this Friday night flight to Vegas however, it's a party atmosphere, with the drinks flowing freely amongst the half full Airbus!  We fly over Chicago, IL, Peoria, IL, Lincoln, NE, Denver, CO, and finally over a pitch black Grand Canyon, before we see the bright lights of Las Vegas on the horizon.  We make a stunning approach and landing over the city touching down precisely 3 hours and 1 minute behind schedule!  \n\nWe disembark the aircraft into the terminal, passing rows of slot machines as soon as you enter the terminal, and make our way down to the baggage claim where our driver is waiting to take us to our hotel for the weekend.\n\n\nVideo taken from seat 8F.\n\nAirline:  American Airlines\nFlight:  AA735\nAircraft:  Airbus A321 N196UW\nFrom:  Philadelphia (PHL)\nTo:  Las Vegas (LAS)\nDeparture:  19:39\nArrival:  21:39\nFlight Time:  05:00\nSeat:  8F\nFlight Path:  http://goo.gl/zMnqSv\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "PePmIAdIHos",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-06-10T08:32:20Z"
}