{
 "name": "Austrian Airlines Full Flight | London Heathrow to Vienna | Airbus A321 (with ATC)",
 "description": "A full flight video with Austrian Airlines onboard Airbus A321 OE-LBE operating flight OS458 from London Heathrow to Vienna on 6 March 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for departure from London Heathrow**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSCHEAP AIRPORT PARKING: http://tidd.ly/73df1db0\nMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nPATREON: http://patreon.com/inflightvideo\n\nAirline:  Austrian Airlines\nFlight:  OS458 (callsign \"AUSTRIAN 458R\")\nAircraft:  Airbus A321 OE-LBE\nFrom:  London Heathrow (LHR)\nTo:  Vienna (VIE)\nDeparture:  06:11\nArrival:  09:07\nFlight Time:  1:56\nSeat:  8A\nFlight Path: https://goo.gl/5t2sy8\n\nOur journey today begins north of the airport where we have parked on a Just Park driveway.  We get the free bus into Terminal 2 and make our way through the terminal where our ride for this morning, OE-LBE is waiting on stand after her flight in the previous evening.\n\nWe soon board the aircraft and are cleared to taxi to runway 27L, which doesn't take too long as we are only the second departure of the day.  After we wait for a Qatar Airways A380 and an Air Mauritius A340 to land, we line up and are cleared to take off.  We get a stunning view as we depart in the sunrise and fly at a lower altitude until cleared to climb higher by ATC.  We then head direct to KOKSY, a waypoint over the English Channel.  We fly over Belgium and Germany, before crossing Northern Austria as the clouds clear up below us to give us a great view of the Austrian scenery.  It's a very windy day and in the descent we can clearly hear the wind hitting our aircraft.  We make a very blustery approach and landing into Vienna, being thrown around quite a bit on the approach before making a bumpy touchdown on runway 34, and taxying into the modern terminal building.\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "Ot2tD6V6p2g",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-03-31T12:59:57Z"
}