{
 "name": "Belavia Tupolev Tu-154 Full Flight: Minsk to Geneva (with ATC)",
 "description": "A full, uncut full flight video with Belavia from Minsk (MSQ) to Geneva (GVA) onboard the last ever Tupolev 154 flight into Europe.\n\nOn 29 May 2015, Belavia operated the last ever Tu-154 flight into Europe onboard aircraft EW-85748.  I was lucky enough to secure a seat on the flight, which is normally operated by CRJ.\n\nKey parts:\n\n00:00:11   Boarding\n00:12:40    Engine start\n00:21:45    Takeoff\n02:26:00    Top of descent\n02:55:15     Approaching Geneva\n03:00:05      Landing in GVA\n03:12:00      Deboarding\n\nThe video begins in the terminal at Minsk, prior to boarding, before we get a bus out to the aircraft sitting on a remote stand.  The engines start soon after boarding, and we are on our way for the 2.5 hour flight to Geneva.\n\nWe turn left after takeoff, getting a great view of the city of Minsk, before heading towards Warsaw, Prague, Stuttgart, Zurich and finally for a beautiful scenic approach along Lake Geneva and landing with full reverse thrust deployed.  ATC is included for approach and landing in Geneva.\n\nVideo taken from seat 23F.\n\nAirline:  Belavia\nFlight:  B2871\nAircraft:  Tupolev Tu-154 EW-85748\nFrom:  Minsk - National (MSQ)\nTo:  Geneva (GVA)\nDeparture:  08:33\nArrival:  09:55\nFlight Time:  02:22\nSeat:  23F\nFlight Path:  http://goo.gl/moxNMd\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "8IaGqghQpWY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-05-31T14:30:13Z"
}