{
 "name": "Europe to Singapore and back in a day!",
 "description": "In October 2012 I embarked on a trip in order to fly on my first Airbus A380. This would involve flying from Paris to Singapore, spending only a couple of hours on the ground before returning to Paris on the same aircraft I flew out on!  \n\nIn order to do this I first had to get to Paris, so flew to Milan, Italy, on to Rome, and finally on to Paris, returning from Paris to Manchester on the way back.  My entire journey took a little over 48 hours from leaving home to arriving back in Manchester.\n\nHere is that journey condensed into 5 minutes.\n\nFlight schedule:\n20/10/2012 07:15-10:30 MAN-MXP FlyBE BE7354 E195\n20/10/2012 15:15-16:30 MXP-FCO Alitalia AZ1027 E175\n20/10/2012 18:00-20:10 FCO-CDG Air France AF1905 A320\n20/10/2012 23:20-18:15* CDG-SIN Air France AF256 A388\n21/10/2012 23:00-06:10* SIN-CDG Air France AF257 A388\n22/10/2012 07:45-08:15 CDG-MAN Air France AF1668 A321\n\nMy trip report from the weekend is here:\nhttp://www.aviationphotos.co.uk/index.php/trip-reports/312-road-to-singapore-a380-to-singapore-for-100\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "dMSf0D-CdJs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2013-02-20T15:52:42Z"
}