{
 "name": "Flybe Full Flight | Manchester to Southampton | Dash 8 DHC8-Q400 **With ATC, Multi Angle**",
 "description": "Full length, uncut, real time full flight video with Flybe from Manchester to Southampton onboard DHC8-Q400 G-ECOE, operating flight BE862 on December 31 2015.\n\n**Every moment of the flight included, as well as ATC for the entire flight, and external view of the takeoff from Manchester courtesy of Aviation HD!**\n\n*For ATC transcript, click on the 'CC' button*\n**NEW: View real time flight map with altitude!  Starts at 0:25:14 http://inflightvideo.tv/a/4\n\n\nThe video begins as we enter Manchester Airport's Terminal 3, and go through security, before heading to the gate and boarding our aircraft for the flight.  We receive our route clearance, before getting clearance from ground to push back and taxi to runway 23L, departing towards the west before turning left and getting a beautiful view for the entire flight on a crystal clear December morning. We head down towards Birmingham, and towards Oxford where we commence our descent near to RAF Brize Norton.  We contact Solent Radar who vector us towards the ILS for runway 20 at Southampton, and finally to tower who clear us to land, pending a large flock of geese over the runway!  After landing we deboard using the front steps and head through the airport to emerge on a beautiful clear morning.\n\nAirline:  Flybe\nFlight:  BE862\nAircraft:  Bombardier DHC8-Q400 G-ECOE\nFrom:  Manchester (MAN)\nTo:  Southampton (SOU)\nDeparture:  08:56\nArrival:  09:36\nFlight Time:  00:40\nSeat:  7D\nFlight Path: http://goo.gl/XL2kjw\n\nFilmed from seat 7D.\n\nGround view of the takeoff and ATC at Manchester courtesy of Aviation HD, please check out his awesome full flight channel at https://www.youtube.com/user/directorphilip2\n\n********************************************************************\nPlease subscribe, comment and like, and follow me for regular full flight and behind the scenes videos!\n\nFacebook:  facebook.com/inflightvideo\nTwitter: twitter.com/inflightvideo\nG+: plus.google.com/+inflightvideo\nInstagram: instagram.com/inflightvideo\n********************************************************************\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "wnTJctidLZg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-01-08T09:30:15Z"
}