{
 "name": "Flybe Full Flight | Glasgow to Birmingham | Bombardier Dash 8 DHC8-Q400  (with ATC)",
 "description": "A full flight video with Flybe  onboard Bombardier Dash 8 DHC8-Q400 G-JECJ operating flight BE785 from Glasgow to Birmingham on 13 March 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for entire flight**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nPATREON: http://patreon.com/inflightvideo\n\nAirline:  Flybe\nFlight:  BE785 (callsign \"JERSEY 6 ROMEO WHISKEY\")\nAircraft:  Bombardier DHC8-Q400 G-JECJ\nFrom:  Glasgow (GLA)\nTo:  Birmingham (BHX)\nDeparture:  11:22\nArrival:  12:14\nFlight Time:  0:52\nSeat:  7D\nFlight Path: https://goo.gl/indwIx\n\nOur flight today begins outside the terminal at Glasgow, as we walk from the taxi rank to the terminal.  We enter the terminal and head through security, before arriving in the departure lounge.  We grab breakfast overlooking the apron, before heading down to the gate when our gate is called.\n\nWe are invited to check in our trolley bag free of charge at the gate, which we do (the overhead bins on the DHC8 are difficult to squeeze a trolley bag in).  We then board the aircraft walking to the forward steps, and board the aircraft, taking our seat as always in row 7.  Before long we are welcomed aboard and receive our departure clearance to Birmingham.  We soon get our pushback and taxi clearance and make our way to runway 23.  Just before we line up we are given an amendment to our departure clearance, to climb straight ahead rather than to follow the SID.  We are cleared for takeoff and climb out straight ahead to 6,000ft, before being instructed to make a left turn.  \n\nAs we head south we pass over Dumfries and then over the Lake District in northern England.  We head towards Manchester at our cruising altitude of 23,000ft before commencing our descent just south of Manchester.  We are handed off to Birmingham Approach and fly over the city of Birmingham on a beautiful clear day before making a left turn to make a smooth landing on runway 33 at Birmingham. \n\nWe disembark through the forward steps, and proceed through the terminal to collect our checked bag.  From there we walk through the terminal, emerging kerbside on a beautiful spring day.\n\nTIMELINE\n\n0:00:03  Walking into Glasgow Airport\n0:09:17  After security, heading to departure lounge\n0:16:12  Overview of ramp from the restaurant\n0:16:49  Walking to the gate\n0:18:54  Boarding the aircraft, taking our seat in seat 7D\n0:26:19  Route clearance\n0:27:15  Safety demo\n0:31:35  Push and start clearance\n0:35:52  Taxi clearance to runway 23\n0:41:01  Line up runway 23, takeoff\n0:57:04  Cabin overview\n1:29:43  Commencing approach to Birmingham\n1:33:02  Established on ILS for runway 33\n1:34:47  Landing on runway 33, taxi to terminal\n1:41:55  Disembarking aircraft, heading to baggage claim\n1:50:56  Walking through the terminal, exiting to taxi rank\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "0j5xtXf5XS4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-05-26T12:59:53Z"
}