{
 "name": "How Hard was it to fly the ICONIC Dambusters Flights?",
 "description": "I tried to recreate the most daring British raid of World War 2 - the mighty Dambusters - in a small plane, to try and get an idea of exactly how difficullt it was for these brave men.\n\nSubscribe to my Private Pilot Vlogs channel: https://www.youtube.com/channel/UCFeMrjkHnXPlZKTbg2-05jg\n\n\nOFFICIAL NOEL MERCH: noelphilips.com/shop\n\nJOIN ME ON WHATSAPP, GET WEEKLY LIVE CHATS AND MUCH MORE - SUPPORT ME ON PATREON! http://patreon.com/inflightvideo\n\nTHANK YOU TO MY AWESOME PATRONS!  \nIan Mitchell, Roger Zuercher, Martin Low, Jonathan Sellars, Vince8323, Jo Thorne, Arnoud de Bruijn, Justin Wilcox, Jim Damm, Paul Kusulas, Tim Powaleny, Mr Daniel Foulds, Justin Jura, George Douglas, Janie, Thomas Snape, Joe Keehan, Travis Morris, Dave Cotton, metrowake11 ., Adrian Carey, Crazy Day Tripper / Full Road Trips, Peter Palma, Adam Markin, Riley Kubly, Dave Moore, Dan Payne, Conor Sampson, Steven Powrozek, Stuart McCarthy, Jeffrey Rockett, Jacob Lichtefeld, Josh Whitaker, Jay Bransby, Liam Bojas, Neil Hall, Ray Milton, Jeremy Dawson, Chris Stirk, Eric Lewandowski, Dan Saxton, Richard Low, Peter, thespeedway, NM, Michael L, James Daniel, Jamie Smith, Matt Brice, Ash Walker, James Crowder, Stephen Robertson, Matt, Paul Das, Andy Robichaux, Admira1_Noob, Brian Taylor, Dave Lakeland, Jo Hartill, Blake Prosch, Tobias Arroyo Böttcher, Richard Tate, Andrew Burns, Patrick Towne. Taylor Flynn, Roger Berweger, Graham Hand, Robert Currie, Ben Vanherck, Jason Bennett, Maël Boulet-Craig, Nathan Say, Joshua bedel, Matthew Ogilvie, Melannie Gamez, Zarniwoop B, Alyssa Parssinen, Will Sparrow, Eirik Christoffersen, Elliot Marsh, Sam Morris, Pete Chadwick, Andrew S, th3bubbanator, Mike Up, Grant Kennedy, Sam Yates, James Cardwell, Sarah Clark, Filip Konopski, Anthony Cavaco, Peter Smets, Sam Stevens, Paul Fitchen, Neil Turner, Joao Pedro Wilshusen, Max Lavallee, Mike Wooldridge, Daniel Juschus, Daniel Hornett, Ryan Wylde, Alan Williamson",
 "source": "youtube",
 "source_id": "_TVtXXqdA70",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2020-11-01T14:59:52Z"
}