{
 "name": "Iberia Business Class Full Flight | Airbus A340-600 | Madrid to London Heathrow (with ATC)",
 "description": "A full length, full flight video with Iberia onboard Airbus A340-600 EC-JPU operating flight IB3166 from Madrid to London Heathrow on April 30 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for entire flight**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSThumbnail photo thanks to Juan Pablo MS: http://infl.it/385ah\n\nMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nPATREON: http://patreon.com/inflightvideo\n\nAirline:  Iberia\nFlight:  IB3166 (callsign \"IBERIA 3166\")\nAircraft:  Airbus A340-600 EC-JPU\nFrom:  Madrid (MAD)\nTo:  London Heathrow (LHR)\nDeparture:  16:14\nArrival:  16:59\nFlight Time:  1:45\nSeat:  11L\nFlight Path: http://infl.it/ktzvl\n\nOur journey today begins outside Terminal T4 at Madrid's Adolfo-Suarez International Airport.  We enter the terminal and head through the departure hall to the fast track security.  After security we head for the shuttle to satellite terminal T4S, which takes us underground and we emerge in terminal T4S.  We head straight to Iberia's flagship Velazquez Lounge, which offers great views over the tarmac.  We use the facilities in the lounge and check out the fantastic shower facilities there, as well as the huge wine bar.  After the lounge we head straight to our gate, where our ride for today, Airbus A340-600 EC-JPU is waiting.  We board the aircraft turning left into the business class cabin, taking our seat in seat 11L.\n\nThe load is very light today with only a handful of passengers in the business class cabin.  We soon get clearance to push back and make our way out to runway 14R, being cleared for takeoff on what is a very rainy afternoon in Madrid.  We soon enter the clouds and make a sweeping right turn to make a track pretty much direct to London.  Soon after takeoff we are handed a voucher for the WiFi onboard, giving us access to just 4MB of data.  We are given menus for the meal service, however only pasta is available on today's flight.  The crew make several rounds giving out liquor and alcoholic drinks, as we make our way across the Bay of Biscay and Northern France.  We cross the English Channel and commence our descent into Heathrow, making a straight in approach with no holding pattern, before landing on runway 9L, making use of the powerful reverse thrust to vacate quickly to the right.  We hold for a while ahead of our stand being vacated, during which time three of our four engines are shut down to allow us to save fuel and taxi on one engine.  We finally commence our taxi into our stand at Terminal 5's C Pier, before we dock and disembark through the doors to the rear of the business cabin.  We take the shuttle train to the A concourse, before heading through immigration and emerging outside Terminal 5.\n\nTIMELINE\n\n0:00:04  Outside T4 at Madrid, walking into the terminal and walking through check in hall\n0:02:56  After security, walking to shuttle train to T4S\n0:05:10  Boarding shuttle train to T4S, train journey\n0:08:31  Exiting the train and entering T4S\n0:11:39  Entering Iberia's Velazquez Lounge, walk around lounge\n0:15:23  Shower facilities\n0:16:08  Leaving the lounge and walking to the gate\n0:19:29  Boarding the aircraft and taking our seat in business class\n0:28:35  IFE screen\n0:44:48  Safety video, pushback and engine start\n0:52:32  Taxi clearance\n1:00:52  Captain's welcome announcement while we wait in line for takeoff\n1:06:01  Lining up runway 14R\n1:07:26  Take off clearance, take off runway 14R\n1:19:37  IFE overview\n1:22:13  WiFi brochure\n1:26:04  Business class menu\n1:29:30  IFE Flight map system\n1:38:24  Business cabin overview\n1:47:40  Meal service - Cream Cheese stuffed pasta with a tomato concasse, Mediterranean herbs and almonds sauce\n2:06:07  Coffee service\n2:12:00  IFE flight map\n2:50:12  Localiser established runway 09L, contacting tower\n2:53:15  Cleared to land on runway 09L\n2:53:41  Touchdown runway 09L\n3:10:29  Disembarking through airbridge, getting train to A concourse\n3:17:29  Walking through the A concourse through passport control, baggage reclaim and through terminal\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "bqgUIDrZ_i4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-05-12T13:03:36Z"
}