{
 "name": "inflight Video | Introducing Patreon!",
 "description": "inflight Video is now on Patreon!\n\nBecome a patron of inflight Video by visiting http://www.patreon.com/inflightvideo\n\n✈ ✈ ✈✈ ✈ ✈✈ ✈ ✈✈ ✈ ✈✈ ✈ ✈✈ ✈ ✈✈ ✈ ✈\n\nI wanted to take some time to talk to you guys today about a new way that you guys can help to support inflight Video.  I've been asked quite a few times now how people can support me in creating more full flight videos, and I'm pleased to announce that inflight Video is now set up on Patreon.\n\nPatreon is a website similar to Kickstarter, which allows you to pledge support to your favorite YouTube channels in return for rewards.  It works by pledging an amount of your choice per video, in return for rewards that scale up depending on your pledge.  \n\nAs a supporter on Patreon at any level, you will get to see all of my full length, full flight videos first, ahead of everyone else.  \n\nFor the lowest level pledge of $1 per video, you get to see my videos first, ahead of everyone else.  Depending on how much you pledge, you get perks such as exclusive inflight Video goodies, access to live stream web video chats and exclusive behind the scenes videos.\n\nMy videos will of course still be completely free to everyone, but with the added support of supporters on Patreon it will mean that I will be able to record and release far more often with a wider range of flights and aircraft types.  My aim is to be releasing a full length flight video every week before the end of 2016!\n\nI will also be starting doing live web chats with my supporters once a month, to discuss all things aviation, and to talk about what's coming next from inflight Video.  \n\nOnce again, in terms of my videos, nothing is changing.  I'll still be releasing full flight videos every couple of weeks, for free.  With the added support of my Patrons, I am hoping to be able to bring you far more of the videos you enjoy, on a more regular basis.\n\nPlease check out my Patreon page at http://patreon.com/inflightvideo, and of course stay tuned to the YouTube channel for regular full flight videos.  \n\nThank you for being such amazing fans!  I really hope you continue to enjoy the full flight videos that I make!",
 "source": "youtube",
 "source_id": "Hoy2-IwlnVs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-06-30T20:16:14Z"
}