{
 "name": "KLM Business Class Full Flight | Leeds Bradford to Amsterdam | Embraer E190 (Sunrise Flight/No ATC)",
 "description": "A full length, full flight video with KLM in Business Class, onboard Embraer E190 PH-EZB operating flight KL1540 on December 14 2016.\n\n**Every moment of the flight included from airport to airport**\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSFACEBOOK: facebook.com/inflightvideo\nTWITTER: twitter.com/inflightvideo\nINSTAGRAM: instagram.com/inflightvideo\n\nAirline:  KLM Business Class\nFlight:  KL1540\nAircraft:  Embraer E190 PH-EZB\nFrom:  Leeds Bradford (LBA)\nTo:  Amsterdam (AMS)\nDeparture:  06:52\nArrival:  08:40\nFlight Time:  0:48\nSeat:  2A\nFlight Path:  https://goo.gl/b4w3J6\n\nToday's flight begins outside Leeds Bradford Airport on a foggy winter morning.  We walk into the terminal, through security and to the Yorkshire Premier Lounge where we have a look around and grab breakfast.  After eating in the lounge, we walk to the gate where our aircraft for today is waiting - Embraer E190 PH-EZB.\n\nWe board the aircraft and take our seat in business class in row 2.  The crew is all British today and the captain announces a delay due to the foggy conditions at Amsterdam.  After around 25 minutes however we are cleared to push back and start our engines, and given the safety demonstration.\n\nWe taxi out to runway 14 at Leeds Bradford and depart into the darkness of this early hour.  We climb above the cloud and soon it starts to get light outside.  We are served the Business Class breakfast on the flight as we cross the North Sea.\n\nBefore long we commence our descent into Schiphol, where it is still very foggy.  We enter the cloud on final approach and do not emerge until we are right overhead the threshold!\n\nWe touchdown smoothly on runway 36R (Polderbaan) and enjoy a long taxi into the terminal where we pull onto the remote stands and disembark via the forward stairs.  Then we get a bus ride into the terminal, where we head for passport control to catch our connecting flight today.\n\n0:00:03  Outside Leeds Bradford Airport, walking into the terminal\n0:01:14  Entering the terminal and heading for security\n0:03:06  After security, heading through airside\n0:05:25  Entering the Yorkshire Premier Lounge, tour of lounge\n0:11:12  Leaving the lounge and heading for the gate\n0:26:02  Boarding the aircraft through the forward door and taking our seat in 2A\n0:32:00  Business class cabin overview\n1:08:21  Finally we are cleared to pushback and start our engines, safety demonstration\n1:18:32  Takeoff from runway 14\n1:33:32  Business class breakfast service\n1:38:23  Sunrise commences\n1:54:47  Top of descent\n2:07:53  Landing on runway 36R at Amsterdam\n2:17:47  Pulling onto stand\n2:19:19  Disemberking through forward doors, bus to terminal\n2:27:33  Leaving the bus and entering the terminal, walking to passport control\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "Ywu-n_YDDLI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-01-20T14:00:28Z"
}