{
 "name": "Loganair/BMI Regional Full Flight: Inverness to Manchester - Embraer ERJ 145 (with ATC)",
 "description": "A full length, full flight video with Loganair onboard Embraer ERJ 145 G-RJXH (operated by BMI Regional), operating flight LM591 from Inverness to Manchester on October 30 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for entire flight**\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\nAirline: Loganair\nFlight: LM591 (Callsign \"LOGAN 7WC\")\nAircraft: Embraer ERJ 145 G-RJXH\nFrom: Inverness (INV)\nTo: Manchester (MAN)\nDeparture: 06:59\nArrival: 08:06\nFlight Time: 1:07\nSeat: 18F\nFlight Path: http://infl.it/lm591map\n\nToday's flight begins on a very early, very cold morning in Inverness.  We enter the terminal building and head to security, before making our way to the gate where our Embraer ERJ is being deiced.\n\nWe are soon called for boarding and make our way across the freezing ramp to the aircraft which is preparing to depart.  We board and make our way to the back row, 18, and take our seat in 18F just in front of the engine.\n\nWe are soon cleared to start our engines and taxi to runway 23, taking off into the sunrise over Inverness.  We get some great views of Loch Ness and the snow-covered Highlands as we make our way south across Scotland.  We head towards Glasgow before flying down the coast of the Lake District towards Manchester.\n\nDue to traffic we enter a holding pattern above an American Airlines B757 overhead Preston, making a couple of circuits before making our approach into Manchester.  After a short flight we touch down a couple of minutes behind schedule on runway 05R and taxi to the terminal.\n\nTIMELINE\n\n0:00:07 Outside the terminal at Inverness Airport, walking into the terminal\n0:01:42 Walking to gate\n0:02:17 Our aircraft preparing for boarding\n0:02:28 Gate area\n0:02:39 Aircraft being deiced\n0:09:27 Boarding our aircraft, taking our seat\n0:14:22 Cabin view\n0:17:28 ATC: Route clearance, engine start clearance\n0:18:49 Engine start\n0:20:57 Taxi to runway 23\n0:26:39 Line up and takeoff runway 23\n0:29:46 Inverness, Scotland\n0:31:16 Loch Ness\n0:34:01 Highlands, Scotland\n0:35:53 Cabin view\n0:42:49 Cabin view\n0:46:33 Snack service - coffee and Tunnocks Caramel Wafer\n0:51:02 Cabin view\n1:00:28 Barrow-in-Furness, England\n1:01:22 Morecambe Bay, England\n1:06:31 Preston\n1:07:09 In holding pattern with American Airlines B757\n1:07:46 Blackburn\n1:09:33 In holding pattern with American Airlines B757\n1:23:06 Bolton, UK - starting approach into Manchester\n1:27:32 Runcorn, UK\n1:30:19 Turning final approach to runway 05R\n1:33:09 Landing runway 05R\n1:43:41 Disembarking aircraft into terminal\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "RasvAr6plrE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-29T13:59:55Z"
}