{
 "name": "Norwegian Boeing 737-MAX 8 Full Flight | Edinburgh to Hartford, CT (with ATC)",
 "description": "A full flight video with Norwegian onboard Boeing 737-MAX8 EI-FYA operating flight D81608 from Edinburgh to Hartford/Windsor Locks on August 26 2017.\n\n**Every moment of the flight included from terminal to terminal, ATC for landing at Hartford. **\n\n**Now with live flight map courtesy of AirNav Radarbox24! Check out http://radarbox24.com **\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\nAirline:  Norwegian\nFlight:  D81608 (callsign \"NORSTAR 1608\")\nAircraft:  Boeing 737-MAX 8 EI-FYA\nFrom:  Edinburgh (EDI)\nTo:  Hartford/Windsor Locks (BDL)\nDeparture:  17:44\nArrival:  19:43\nFlight Time:  6:59\nSeat:  32F\nFlight Path:  http://infl.it/d81608map\n\nOur journey across the Atlantic this evening begins outside the terminal building at Edinburgh Airport.  We enter the terminal and head to the Norwegian check in desk, where we have to queue to check in (internet check is not available for USA flights).  Once checked in, we head to security and through to the departure lounge.  We head to gate 6 where our fellow passengers are waiting for the flight.  Before long we are called to board and enjoy boarding via the front steps.  We walk the entire length of the aircraft to the back row, the only seats that were available as I'd booked just four hours previously!  The good news is that we get the entire back row to ourself!\n\nSoon we push back and engines are started, the cabin crew making us aware that the aircraft is not fitted with life rafts yet (it's only been delivered for a couple of weeks, and not ETOPS certified yet).  We taxi out to runway 24 and make a beautiful departure to the south west.  We climb out over western Scotland towards the Hebrides, getting a great view of the islands including Barra.  From there it's straight out on track for Greenland as we climb to 34,000ft for our Atlantic crossing.\n\nWe cross Greenland which is under a blanket of cloud, but as we cross the Labrador Sea it clears up giving us a wonderful view of the Newfoundland coast.  From there we cross Newfoundland towards Quebec, and cross into the USA as the sun begins to set, overhead northern New Hampshire.  We commence our descent on a beautiful summer evening approaching over Massachusetts, touching down right on sunset and bang on schedule.  We taxi to Hartford's customs building, which consists of a metal shed and an airbridge.  We disembark to join a massive queue for immigration, which takes over an hour (not included in real time!)  Once through,  we exit to the street where we have to wait for a shuttle to the terminal building, to catch our second shuttle to the car rental!\n\nTIMELINE\n\n0:00:07  Outside Edinbugh Airport, walking to check in\n0:01:02  Walking to security\n0:02:40  Walking from security to Gate 6\n0:06:00  Gate overview\n0:06:11  Boarding through Gate 6\n0:08:33  Walking across the ramp to the aircraft, taking our seat in 32F\n0:15:07 Cabin Overview\n0:18:42 Cabin Overview\n0:22:55 Cabin Overview\n0:25:32 Cabin Overview\n0:25:46 Captain welcomes us aboard and gives route information\n0:27:50 Safety announcement\n0:33:48 Push back, engine start\n0:39:01 Taxi to runway 24\n0:42:28 Line up and take off runway 24\n0:57:01 Menu overview\n1:14:01 Cabin Overview\n1:14:57 Inflight magazine\n2:20:20 Cabin Overview\n2:34:13 Cabin Overview\n2:39:05 Drinks service - buy on board Coke\n2:52:29 Snack service - buy on board cheese toastie\n3:15:49 Checking our location with Flight Map IFE App\n4:26:31 Filling in arrival form for USA\n4:30:42 Cabin Overview\n5:06:47 Cabin Overview\n5:10:12 Approaching Canadian coast near Nain, NF\n5:30:31 Cabin\n5:36:31 Cabin\n5:38:56 Cabin\n6:40:28 Cabin\n7:16:45 Commencing descent\n7:27:45 Contacting Bradley Approach for vectors to ILS\n7:28:22 Cabin\n7:32:40 Mood lighting on approac in cabin\n7:39:16 Final approach, contacting Bradley Tower\n7:42:24 Landing runway 24\n7:45:08 Pulling on stand at customs building\n7:46:29 Disembarking into terminal through jetway, walking to CBP\n7:51:36 Leaving CBP and exiting customs building to taxi ramp\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "z_og_WaBJ2k",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-09-02T10:59:46Z"
}