{
 "name": "Norwegian Full Flight: Providence to Edinburgh - Boeing 737-800",
 "description": "A full-length full flight video with Norwegian onboard Boeing 737-800 LN-NIG operating flight D81805 from Providence to Edinburgh on 27 August 2017.\n\n**Every moment of the flight included from terminal to terminal**\nFLIGHT MAP IN ASSOCIATION WITH AIRNAV RADARBOX: CHECK OUT http://radarbox24.com FOR LIVE FLIGHT TRACKING AROUND THE WORLD\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\nAirline: Norwegian  \nFlight:  D81805\nAircraft:  Boeing 737-800 LN-NIG\nFrom:  Providence (PVD)\nTo:  Edinburgh (EDI)\nDeparture:  22:44\nArrival:  09:41\nFlight Time:  5:57\nSeat:  30A\nFlight Path: http://infl.it/d81805map\n\nOur journey today begins with a drive into the terminal at Providence's TF Green International Airport.  We walk into the terminal and make our way to the Norwegian check in area (no online check in for this flight).  After checking in, we head to the TSA check point, and then airside to watch the aircraft movements at this small airport.  \n\nOur flight is finally called for boarding after a 2 hour delay, and we make our way to our initial seat in row 29 (we move to row 30 to move further from a crying baby in row 28).  \n\nThe captain introduces himself and apologises for the delay, caused by the previous crew leaving a door open and the need for a full security search of the aircraft.  He also advises that the APU is inoperable, so we need to start our first engine with external air on stand.\n\nWe soon push back and make a departure into the night, making a left turn towards Boston.  We fly over New England and into Canada, then commencing our Atlantic crossing.  \n\nAround 4 hours into the flight we are treated to a wonderful sunrise over the Atlantic.  We eventually cross the Scottish coast and commence our descent and approach into Edinburgh, making a very bumpy approach and a floating, then hard touchdown almost missing our taxiway exit!  \n\nWe taxi into the stand and then disembark via airstairs, getting a bus to the terminal and then running through immigration, baggage claim and customs to make sure we make our next flight (20 minute connections are not fun!).\n\nTIMELINE\n0:00:05 Driving into TF Green Airport, Providence\n0:01:19 Walking into the terminal and to the Norwegian check in desk\n0:02:45 Walking to TSA checkpoint\n0:03:06 After TSA, walking through departure lounge\n0:04:08 Aircraft movements at Providence\n0:05:00 Walking to gate 14\n0:06:49 Our aircraft on stand waiting for departure (note open door)\n0:07:02 Waiting to board flight\n0:07:39 Boarding commencing\n0:10:54 Boarding aircraft through jetway\n0:14:00 Captain Lars Petersen welcomes us onboard, explains different startup procedure\n0:17:31 Safety video, engine start on stand\n0:21:57 Pushback, taxi\n0:25:53 Cabin view\n0:32:05 Takeoff\n0:35:51 Flight map begins\n2:51:02 Cabin view\n3:49:47 Cabin view\n3:55:13 Sunrise begins\n4:24:43 Cabin view, bathroom\n4:28:39 Overview of wifi based IFE - flight map, movies, TV\n5:52:17 Flight map recommences as we approach the UK\n6:06:16 Top of descent\n6:26:15 Final approach to runway 24 at Edinburgh\n6:28:53 Landing runway 24\n6:32:01 Pulling onto stand\n6:32:48 Disembarking through rear doors\n6:41:26 Passenger makes run for freedom across apron\n6:42:25 Bus ride to terminal\n6:45:09 Running to passport control\n6:45:27 Running through baggage claim and customs to make our next flight\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "wEW93WAbJFo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-06T13:00:03Z"
}