{
 "name": "Qantas London to Perth Full Flight: Boeing 787-9 Dreamliner (Inaugural Flight)",
 "description": "Full length, full flight video onboard the first ever non stop flight from the UK to Australia with Qantas onboard Boeing 787-9 Dreamliner VH-ZND, operating flight QF10 from London Heathrow to Perth on 25 March 2018.\n\n*Every moment of the flight included from Heathrow to Perth. ATC and flight map for entire flight*\n\nGET EARLY ACCESS TO ALL OF OUR VIDEOS PLUS EXCLUSIVE FULL FLIGHT VIDEOS AT inflightvideo.tv\n\nPLEASE SUBSCRIBE FOR REGULAR FULL FLIGHTS!\n\nFACEBOOK: facebook.com/inflightvideo\nINSTAGRAM: instagram.com/inflightvideo\n\nOur history making inaugural flight from London to Perth begins Hatton Cross near Heathrow Airport, as we take a tube from the famous Myrtle Avenue to Terminal 3. We enter the terminal where the festivities are underway, with lots of media and TV crews. We head to the gate where there are further celebrations. As boarding commences, I am pulled aside and asked if I would like to have a ramp tour to see the outside of the beautiful aircraft decorated by Aboriginal artist Emily Kame Kngwarreye \"Yam Dreaming\". Once we've had a chance to see this aircraft up close from outside we are whisked back inside as the last passengers to board this flight!\n\nThe captain welcomes us aboard and we are soon pushed back for a very short taxi to runway 09R at Heathrow. We jump the queue and line up straight away, before making a long takeoff on Heathrow's longest flight!  Once airborne we proceed over Europe, towards Romania, the Black Sea and Turkey. The sun sets overhead Turkey and we continue over Iran, flying overhead Shiraz and getting a distant view of the lights of Dubai and Abu Dhabi. We then cross the coast to the Indian Ocean, crossing the Maldives and passing the south coast of India and Sri Lanka heading towards Australia. The sun rises over the Indian Ocean, and the tinted window shades are cleared to give us a great view of the cloudscapes over the Southern Ocean. After 15 hours we commence our descent towards Perth. We break through the clouds for an approach over Perth's southern suburbs, touching down ahead of schedule on runway 03.\n\nWe get a water cannon salute as we taxi to the terminal, before parking and making our way into a crowd of news reporters and media as we enter the arrivals hall. We hang around to watch the press interview the captain before making our way out to a rainy day in Western Australia.\n\n0:00:04 Outside Hatton Cross Tube Station, London\n0:00:20 Boarding London Underground for the short journey to Terminal 3\n0:00:45 Onboard tube to Terminal 3\n0:01:00 Walking from tube to Terminal 3\n0:05:24 Outside Terminal 3, walking into terminal to checkin area\n0:07:12 Celebrations at check in area\n0:08:06 Walking to security\n0:09:05 View of aircraft on stand\n0:09:55 Celebrations at gate 1\n0:10:12 Boarding commences\n0:10:39 We are invited to go down to the ramp to get some shots of the aircraft!\n0:11:09 Gate staff re-open the gate to let us board\n0:15:31 Boarding our aircraft and walking to our seat\n0:26:38 Captain welcomes us aboard this inaugural flight\n0:29:12 Pushback, engine start\n0:30:43 Safety video\n0:36:30 Taxi to runway 09R\n0:44:38 Line up and takeoff runway 09R\n0:57:14 Cabin view\n1:01:13 Cabin view\n1:04:00 Amenity kits distributed\n1:12:09 Passing traffic: easyJet Airbus A320\n1:16:58 Cabin view\n1:25:39 Passing traffic: Pegasus B737-800\n1:32:02 Passing traffic: Swiss B777-300ER\n1:34:22 Frankfurt Airport\n1:47:24 BBC reporter Simon Calder interviewing cabin crew\n2:00:08 Bathroom view, views of forward economy cabin\n2:14:22 Cabin walkaround\n2:14:55 Passing traffic: Qatar Cargo B777\n2:21:36 Captain walks around the cabin meeting the passengers\n2:22:15 Snack service: Gin & tonic, Pretzels\n2:55:47 Watching TV\n3:10:59 Menu overview\n3:51:03 Start of first meal service\n3:55:58 Meal service\n4:02:44 Dinner: Roast chicken salad and red wine\n04:13:23 Enjoying a glass of wine as the sun sets\n04:27:18 Sunset\n04:42:07 Cabin view\n04:47:38 Cabin walkaround\n04:52:27 Cabin walkaround\n04:54:07 Rear galley\n05:12:39 Bedtime drinks: Hot Chocolate\n05:16:05 Tour of airshow map system\n05:22:40 Tour of inflight entertainment (IFE) system\n06:33:22 IFE in sleep mode\n09:06:58 Snack service: Carrot sticks and houmous\n10:28:27 Snack service: Calzone\n12:44:46 Crossing equator\n13:20:30 View of cabin\n13:30:28 Airshow map\n13:32:08 Window shades lighten revealing a beautiful sunrise\n13:34:12 Comparison between window shades at darkest and lightest\n13:40:42 Energising fruit juice - fruit, beetroot and spinach\n14:11:41 Cabin walkaround\n14:13:57 View of rear cabin\n14:21:30 Breakfast service - omelette\n15:09:24 Cabin view\n15:22:48 Airshow map \n15:52:53 Airshow map \n16:24:02 Cabin view\n16:18:30 First officer updates us on our arrival\n16:51:29 Approach and landing on runway 03 at Perth\n16:54:51 Water cannon salute\n17:04:04 Disembarking aircraft, walking to immigration\n17:07:16 Entering the arrivals hall\n17:08:19 TV crews in the arrivals hall\n17:09:30 Captain is interviewed by TV\n17:10:57 Exiting terminal to street",
 "source": "youtube",
 "source_id": "KEh4_QKxo_4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-04-07T09:04:25Z"
}