{
 "name": "Ryanair Full Flight | Dublin to Birmingham | Boeing 737-800 (with ATC)",
 "description": "A full length full flight video in real time, from Dublin to Birmingham onboard Ryanair Boeing 737-800 EI-FOZ, operating flight FR664 on April 5 2016.  \n\nThe video begins outside Terminal 1 at Dublin Airport, before we check in and make our way through security to airside.  We head down to the gate, and before too long board our ride to Birmingham - a brand new Boeing 737-800 that was delivered just the previous day.\n\nAfter boarding this smart, shiny aircraft, we push back and taxi to runway 28, departing on a beautiful sunny spring morning across Ireland.  We climb to our cruising altitude of FL230, and cross the Irish Sea north of Wales.  We get a great view of the Isle of Man and Liverpool, before we make a right turn and commence our descent over Cheshire towards Birmingham.  \n\nIt remains a clear sunny day for the entire flight and we get a stunning view of the whole of Birmingham as we commence our approach to runway 33 at Birmingham.\n\nWe touch down a few minutes ahead of schedule on runway 33, before taxying into the terminal.  We then disembark the aircraft and make our way through the airport, collecting luggage and heading out to the street outside the terminal.\n\n0:00:09  Entering terminal 1 at Dublin Airport\n0:00:46  Walking to departures\n0:01:10  Airside, walking to gate\n0:03:30  Boarding through gate\n0:05:51  Walking to aircraft, boarding and taking seat\n0:19:52  Captain's welcome announcement\n0:35:04  Pushback and engine start\n0:47:42  Line up runway 28\n0:48:25  Take off from runway 28\n0:54:00  Irish coastline\n1:24:34  Birmingham, UK\n1:27:56  Establishing on ILS for runway 33\n1:31:30  Touchdown on runway 33, taxying to stand\n1:38:20  Pulling onto stand 1\n1:40:50  Disembarking through forward door and down steps, walking through terminal\n1:45:40  Walking out of terminal to street\n\nVideo taken from seat 8A.\n\nAirline:  Ryanair\nFlight:  FR664\nAircraft:  Boeing 737-800 EI-FOZ\nFrom:  Dublin (DUB)\nTo:  Birmingham (BHX)\nDeparture:  10:55\nArrival:  11:38\nFlight Time:  00:43\nSeat:  8A\nFlight Path:  https://goo.gl/DxVJBm\n\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "BmBY4TS5SB8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-09-30T08:33:33Z"
}