{
 "name": "SAS CRJ 900/CRJ900 Full Flight - Birmingham to Copenhagen (SK2534) *With ATC*",
 "description": "Full length uncut flight video from gate to gate onboard SAS Scandinavian Airlines Bombardier CRJ900 OY-KFH, operating flight SK2534 from Birmingham (BHX) to Copenhagen (CPH) on 2 February 2015.  *Every minute of the flight included from gate to gate, and ATC on the ground at Birmingham and arrival at Copenhagen*\n\nThe flight begins with boarding the aircraft at Birmingham, and taking our seat at the rear of the aircraft (seat 23A).  We receive our route clearance to Copenhagen as the bags are loaded onboard.  After obtaining push and start clearance we push back and taxi to runway 33 at Birmingham, before taking off in a northerly direction on a beautiful clear, crisp winter morning.  We climb out to the east routing over the Daventry VOR, getting a great view of Rugby, Leicester and Bruntingthorpe airfield, before we hit cloud.  We climb to our cruising altitude of 37,000ft, and the cloud clears as we approach the English coast near to Lowestoft.  The weather remains clear for the entire North Sea crossing, before we cross the coast of Denmark south of Westerland.  Here the cloud builds up again, and we descend across  Syddanmark towards Copenhagen, making an approach from the north towards runway 22L.  After landing we taxi back to the terminal, parking on a remote stand before disembarking onto a bus for the journey into the terminal.\n\nVideo taken from seat 23A.\n\n=====\nFuld flyvning video fra gate til gate ombord SAS Scandinavian Airlines Bombardier CRJ900 OY-KFH, der opererer fly SK2534 fra Birmingham (BHX) til København (CPH) den 2. februar 2015. * Hvert minut af flyvningen indgår fra gate til gate, og ATC om jorden i Birmingham og ankomst til København *\n\nFlyvningen begynder med at boarde flyet i Birmingham, og tager vores plads på bagsiden af flyet (sæde 23A). Vi modtager vores rute clearance til København som poserne læsses om bord. Efter opnåelse af tryk og begynde clearance vi skubbe tilbage og taxi til bane 33 i Birmingham, før du tager ud i nordlig retning på en smuk klar, sprød vintermorgen. Vi kravle ud mod øst routing over Daventry VOR, at få en stor visning af Rugby, Leicester og Bruntingthorpe flyveplads, før vi ramt sky. Vi klatre op til vores cruising højde af 37,000ft, og skyen rydder som vi nærmer os den engelske kyst nær til Lowestoft. Vejret er fortsat klart for hele Nordsøen passage, før vi krydser kyst Danmark syd for Westerland. Her skyen bygger op igen, og vi ned over Syddanmark mod København, hvilket gør en tilgang fra nord mod bane 22L. Efter landing vi taxa tilbage til terminalen, parkering på en ekstern stativ før landsætning på en bus til rejsen ind i terminalen.\n\nVideo taget fra sæde 23A.\n\nAirline:  SAS Scandinavian Airlines\nFlight:  SK2534\nAircraft:  Bombardier CRJ900  OY-KFH\nFrom:  Birmingham (BHX)\nTo:  Copenhagen (CPH)\nDeparture:  10:16\nArrival:  12:47\nFlight Time:  01:31\nSeat:  23A\nFlight Path:  http://goo.gl/MJCYQT\n\nPlease enjoy the flight and feel free to subscribe/comment!\n\nGoPro Hero 3\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "-pK1aMr_PxY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-04-16T14:48:57Z"
}