{
 "name": "SAS Scandinavian Airlines Full Flight | Oslo to London Heathrow | Boeing 737-600",
 "description": "A full length full flight video in real time with SAS Scandinavian Airlines onboard a Boeing 737-600 operating flight SK805 from Oslo to London Heathrow on 12 September 2015.\n\n**Every minute of the flight from boarding to deboarding**\n**NEW: View the flight map/altitude in real time!  Starts at 0:22:58 http://inflightvideo.tv/a/3\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\nThe video begins at the gate in the non-Schengen area of Oslo Airport,  before we board the aircraft and take our seat in the back row, seat 22F.  It isn't long before we pushback and taxi to runway 01R, before taking off making a sharp right turn before we even get to the end of the runway!\n\nOur route then takes us along the south coast of Norway, before heading off across the North Sea, turning right off the east coast of the UK to make a beautiful scenic approach across London for Heathrow's runway 27R.  After landing we taxi into Terminal 2 and disembark using the forward doors into the terminal.\n\nVideo take from seat 22F.\n\nAirline:  SAS Scandinavian Airlines\nFlight:  SK805\nAircraft:  Boeing 737-600 LN-RPC\nFrom:  Oslo - Gardermoen (OSL)\nTo:  London - Heathrow (LHR)\nDeparture:  13:29\nArrival:  14:28\nFlight Time:  01:59\nSeat:  22F\nFlight Path:  http://goo.gl/ZKYbyb\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "K4VXPEGS3JY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-12-11T09:00:48Z"
}