{
 "name": "Swiss Airbus A220-100 Full Flight | Manchester to Zurich | Business Class",
 "description": "A full length full flight video in real time with Swiss, from Manchester to Zurich in business class, onboard Airbus A220-100 HB-JBA operating flight LX391 on July 29 2016.\n\n\nOur journey today begins on the Skylink bridge at Manchester Airport making our way from the rail station to Terminal 1.  As we are flying in business class today, we make our way to the priority lane at security, bypassing the long line on this busy summer morning.\n\nOnce past security we head to the Aspire lounge, which gives us a great view of the ramp as well as a comfortable environment to relax in ahead of our flight.  After grabbing a coffee and the essential bacon  roll, we sit and watch the planes for a while before heading back into the airport an making our way to the gate for today's flight.\n\nThere is a delay in boarding the aircraft due to a technical fault and we wait for this to be fixed.  Eventually we board the aircraft 30 minutes behind schedule, walking across the ramp and taking our seat in row 1 on this brand new Airbus A220.\n\nThe captain welcomes us aboard as we enjoy a welcome drink, and before long we push back and taxi out to runway 23L.  We make a powerful departure from Manchester, climbing away like a rocket thanks to the A220's powerful PW1000G engines.  We climb to our cruising altitude of 39,000ft for today's flight.\n\nWe are treated to a lovely cooked breakfast with a choice of drinks, but due to the early hour I decide to just take a coffee.\n\nWe commence our descent down into Zurich getting the trademark Swiss chocolate, and make our approach to runway 14.  As we cross the threshold of runway 14, the pilot initiates a go-around due to another aircraft on the runway that didn't vacate in time.  We once again climb like a rocket, reaching 4,000ft in around 30 seconds!  We then get a scenic second approach into Zurich, touching down eventually 40 minutes late.\n\nOnce we pull on stand, we are shuttled to the terminal in the dedicated business class shuttle bus, which took us straight to passport control ensuring that I was just in time to catch my onward flight!\n\nVideo taken from seat 1F.\n\n0:05:39  Skylink to Terminal 1 at Manchester\n0:01:51  Entering Terminal 1\n0:02:20  Fast Track security\n0:05:56  Entering Aspire lounge, walkaround of the lounge\n0:07:32  Watching an easyJet A320 push back in front of the lounge\n0:08:57  Walking to gate 11 in Terminal 1\n0:13:49  Annoucement of delay due to technical fault\n0:14:33  Boarding called for business class passengers, walking out to aircraft\n0:16:00  Walking across ramp to aircraft, boarding aircraft and taking our seat in 1F\n0:25:17  View of cabin\n0:25:41  Overhead console\n0:26:41  Overview of new Recaro seats\n0:27:04  Captain welcomes us aboard, welcoming us to 'our brand new Bombardier C Series', gives overview of route\n0:27:14  Pre-departure drink of water and refreshing wipe\n0:38:38  Doors closed\n0:40:34  Pushback and engine start\n0:42:38  Safety video, shown on the overhead screens\n0:50:33  Taxi to runway 23L\n1:00:20  Take off from runway 23L\n1:11:00  Birmingham, UK\n1:20:17  Overview of front row\n1:22:10  Business class breakfast service\n1:24:52  View of business class area and seat\n1:26:29  Swiss Chocolate and coffee\n1:48:36  Safety card overview\n1:51:25  In flight map shown on the overhead monitors\n2:03:29  Seatbelt sign on, flight map on the overhead monitor\n2:22:02  Contacting Zurich Approach on ATC\n2:32:44  First final approach to runway 14\n2:34:28  Go around, climb to 4,000ft getting a great view of Zurich Airport\n2:46:00  Second approach to runway 14\n2:51:01  Landing on runway 14, taxi to stand\n2:59:34  Flight attendant having some difficulty opening the door\n3:00:20  Disembarking through forward door, boarding business class shuttle to terminal\n3:01:06  Driving to the terminal past a number of widebody aircraft\n3:04:35  Entering terminal, brisk walk to passport control before running the length of the terminal to my next gate!\n\nAirline:  Swiss\nFlight:  LX391\nAircraft:  Bombardier C Series CS100 HB-JBA\nFrom:  Manchester (MAN)\nTo:  Zurich (ZRH)\nDeparture:  09:41\nArrival:  12:33\nFlight Time:  01:52\nSeat:  1F\nFlight Path:  http://goo.gl/8RFmdx\n\n\n********************************************************************\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n********************************************************************\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "y95fIO6BVNI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-08-05T08:36:30Z"
}