{
 "name": "Timelapse Full Flight | Oslo to London Heathrow | SAS Boeing 737-600",
 "description": "A timelapse full flight video with SAS Scandinavian Airlines onboard a Boeing 737-600 operating flight SK805 from Oslo to London Heathrow on 12 September 2015.\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\nAfter a sporty takeoff from Gardermoen's runway 01R, we make a sharp right turn immediately after takeoff.  Our route then takes us along the south coast of Norway, before heading off across the North Sea, turning right off the east coast of the UK to make a beautiful scenic approach across London for Heathrow's runway 27R.  After landing we taxi into Terminal 2.\n\nVideo take from seat 22F.\n\nAirline:  SAS Scandinavian Airlines\nFlight:  SK805\nAircraft:  Boeing 737-600 LN-RPC\nFrom:  Oslo - Gardermoen (OSL)\nTo:  London - Heathrow (LHR)\nDeparture:  13:29\nArrival:  14:28\nFlight Time:  01:59\nSeat:  22F\nFlight Path:  http://goo.gl/ZKYbyb\n\n***PLEASE SUBSCRIBE, LIKE, COMMENT, AND FOLLOW ME ON FACEBOOK, TWITTER, GOOGLE+ AND INSTAGRAM!!***\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "o3KigcnhEVM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-02-19T10:14:22Z"
}