{
 "name": "Timelapse Flight with ATC | Carcassonne to East Midlands | Ryanair Boeing 737-800",
 "description": "A timelapse full flight from Carcassonne (CCF) to East Midlands (EMA) onboard Ryanair Boeing 737-800 EI-FOW, operating flight FR1613 on Friday June 3 2016.\n\nOur journey begins at Carcassonne, France.  Before long we receive our departure clearance from Carcassonne Tower, and we get our clearance to start the engines and taxi.  We depart from runway 28 at Carcassonne climbing towards Toulouse, contacting Toulouse Approach shortly after departure.  We continue our climb getting a great view of the south of France as we contact Bordeaux control and climb to FL380.  Our route today takes us towards La Rochelle, and then turning right on a northerly heading towards Cherbourg, where we cross the coast to the English Channel.\n\nWe are handed off from Brest control to London control, and cross the English coast to the east of Portsmouth.  We head towards London and begin our descent towards East Midlands, being handed off to East Midlands radar as we descend.  We are then vectored towards an ILS approach on runway 09, which takes us towards Burton on Trent and back towards East Midlands.  We pass overhead Donington racetrack, where a race is underway, before touching down smoothly on runway 09.  We exit the runway and contact ground, who clear us to taxi to the stand.\n\nAirline:  Ryanair \nFlight:  FR1613\nAircraft: Boeing 737-800 EI-FOW\nFrom:  Carcassonne (CCF)\nTo:  East Midlands (EMA)\nDeparture:  15:40\nArrival:  16:24\nFlight Time:  01:44\nSeat:  3F\nFlight Path:  https://goo.gl/Dw1zP1\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "lPQDbxhj-GE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-11-23T14:00:15Z"
}