{
 "name": "Timelapse Flight | Birmingham to Dublin | Aer Lingus Airbus A320",
 "description": "A timelapse flight video with Aer Lingus, from Birmingham to Dublin, onboard Airbus A320 EI-DEO (in Irish Rugby livery) operating flight EI263 on April 1 2016.\n\nOur journey today begins at Birmingham Airport, early in the morning.  \n\nIt isn't long before we push back, and taxi out to runway 15 at Birmingham.  We depart to the south, making a sweeping left turn as we climb to the northwest towards Liverpool.\n\nCruise altitude today is a relatively low 18,000ft on such a short flight, and it's not long before we commence our descent towards Dublin.  Today's arrival calls for a rare landing on runway 16 at Dublin, and as such we are vectored around quite a bit to establish on the southbound approach towards Dublin.\n\nWe touch down on schedule, taxying into a stand at Terminal 1.  \n\nVideo taken from seat 8F.\n\nAirline:  Aer Lingus\nFlight:  EI263\nAircraft:  Airbus A320 EI-DEO\nFrom:  Birmingham (BHX)\nTo:  Dublin (DUB)\nDeparture:  08:21\nArrival:  09:09\nFlight Time:  00:48\nSeat:  8A\nFlight Path:  http://goo.gl/tlA5xi\n\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "Tc6Njk5LNl0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-10-21T08:31:24Z"
}