{
 "name": "Timelapse Flight: Madrid to Frankfurt (LAN Airlines Boeing 787-8 Dreamliner) GoPro",
 "description": "Timelapse full flight window view of a flight from Madrid Barajas to Frankfurt, onboard LAN Airlines Boeing 787-8 Dreamliner CC-BBB, operating flight LA704 on 18 October 2014.\n\nWe pushback from the gate at Madrid's Terminal 4 Satellite pier with a short taxi out for departure from runway 15L, followed by a very smooth departure and climb up to our cruising altitude of 43,000ft.  At this altitude the sky is visibly dark above and the curvature of the earth visible as we make our way up across Spain directly to Paris, before making a right turn directly towards Frankfurt.  We are then treated to a stunning approach looping around downtown Frankfurt before making our approach to runway 25L, after a flight time of only 1 hour 59 minutes (scheduled flight time 2h45m).\n\n//\nTimelapse vuelo completo vista de la ventana de un vuelo de Madrid Barajas a Frankfurt, a bordo de LAN Airlines Boeing 787-8 Dreamliner CC-acreditación, que opera el vuelo LA704 el 18 de octubre de 2014.\n\nNos retroceso de la puerta en la Terminal 4 Satélite muelle de Madrid con un corto en taxi a cabo para la salida de la pista 15L, seguido de una salida muy suave y subimos a nuestra altitud de crucero de 43,000ft. A esta altura el cielo es oscuro visible arriba y la curvatura de la tierra visible como hacemos nuestro camino a través de España directamente a París, antes de hacer un giro a la derecha directamente hacia Frankfurt. Entonces nos tratan a un enfoque impresionante bucle por el centro de Frankfurt antes de hacer nuestra aproximación a la pista 25L, después de un tiempo de vuelo de sólo 1 hora 59 minutos (horario de vuelo 2h45m).\n\n//\n\nTimelapse vollen Flug Fensteransicht eines Flug von Madrid Barajas nach Frankfurt, Onboard-LAN Airlines Boeing 787-8 Dreamliner CC-BBB, Betriebsflug LA704 auf 18. Oktober 2014.\n\nWir Pushback vom Gate in Madrid Terminal 4 Satelliten Pier mit einer kurzen Taxi für Abflug von Bahn 15L, gefolgt von einer sehr glatten Abreise- und klettern bis in unsere Reiseflughöhe von 43,000ft. In dieser Höhe ist der Himmel sichtbar dunkel oben und die Krümmung der Erde sichtbar, wie wir unseren Weg bis ganz Spanien direkt nach Paris, bevor sie eine Rechtskurve direkt in Richtung Frankfurt. Wir sind dann zu einem atemberaubenden Ansatz Umschlingen der Frankfurter Innenstadt, bevor sie unseren Anflug auf die Piste 25L behandelt, nach einer Flugzeit von nur 1 Stunde 59 Minuten (Linienflugzeit 2h45m).\n\n//\n\nAirline:  LAN Airlines\nFlight:  LA704\nAircraft:  Boeing 787-8 Dreamliner CC-BBB\nFrom:  Madrid Barajas (MAD)\nTo:  Frankfurt (FRA)\nDeparture:  15:18\nArrival:  17:17\nFlight Time:  01:59\nSeat:  31L\nFlight Path:  http://goo.gl/mUw979\n\nPlease subscribe/comment!\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "MqBJXlIrbLw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2014-11-03T16:33:38Z"
}