{
 "name": "Timelapse Flight | London Heathrow to Zurich | Swiss Airbus A321",
 "description": "A timelapse flight from London Heathrow to Zurich, onboard Swiss Airbus A321 HB-IOM operating flight LX317 on 30 January 2016.\n\nFull flight in real time: https://youtu.be/EeNaftpoj08\n\nDue to the late inbound arrival of the aircraft, we missed our slot  at Heathrow and had to wait at the gate for a short time, before pushing back and joining the queue for runway 27L.  After several aircraft depart ahead of us we line up and power off of Heathrow's runway 27L, making a left turn following the Detling 2F departure towards Dover.  We maintain 6,000ft as per the SID which gets us a great view of Gatwick Airport before we continue our climb up to an eventual altitude of 37,000ft.  We  cross the English Channel towards Belgium, before continuing on to Luxembourg, eastern France and finally Switzerland, where we make a beautiful approach and landing onto runway 14 at Zurich.\n\n\nAirline:  Swiss\nFlight:  LX317\nAircraft:  Airbus A321 HB-IOM\nFrom:  London Heathrow (LHR)\nTo:  Zurich (ZRH)\nDeparture:  09:46\nArrival:  12:02\nFlight Time:  01:16\nSeat:  8F\nFlight Path: http://goo.gl/bvxykW\n\nFilmed from seat 8F.\n\n\n********************************************************************\nPlease subscribe, comment and like, and follow me for regular full flight and behind the scenes videos!\n\nFacebook:  facebook.com/inflightvideo\nTwitter: twitter.com/inflightvideo\nG+: plus.google.com/+inflightvideo\nInstagram: instagram.com/inflightvideo\n********************************************************************\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "nBqKH6Xkjr4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-05-27T06:41:45Z"
}