{
 "name": "Timelapse Full Flight | Southampton to Manchester | Flybe DHC8-Q400",
 "description": "A timelapse full flight video from Southampton to Manchester onboard a Flybe DHC8-Q400.\n\nFull flight in real time: https://www.youtube.com/watch?v=pzb8EaEGxFI\n\nWe start our journey on stand in Southampton, before backtracking down runway 20 for departure, and departing on a north-easterly heading, towards London, climbing to 20,000ft.  After a left turn we continue north on a beautiful clear morning, getting a great view of the cities of Milton Keynes, Northampton, Leicester and Derby, and a great view of East Midlands Airport.  We commence our approach over the beautiful Peak District which is again under clear skies, turning over Stockport for our final approach.  We make our approach and landing onto runway 23R at Manchester.\n\nAirline:  Flybe\nFlight:  BE863\nAircraft:  Bombardier DHC8-Q400 G-ECOE\nFrom:  Southampton (SOU)\nTo: Manchester (MAN)\nDeparture:  10:33\nArrival:  11:16\nFlight Time:  00:43\nSeat:  7D\nFlight path: http://goo.gl/5ZdnO6\n\n********************************************************************\nPlease subscribe, comment and like, and follow me for regular full flight and behind the scenes videos!\n\nFacebook:  facebook.com/inflightvideo\nTwitter: twitter.com/inflightvideo\nG+: plus.google.com/+inflightvideo\nInstagram: instagram.com/inflightvideo\n********************************************************************\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "-Uib77etvuw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-04-15T08:48:12Z"
}