{
 "name": "Timelapse Flight | Philadelphia to Dublin | American Airlines B757-200",
 "description": "A timelapse flight from Philadelphia to Dublin onboard American Airlines Boeing 757-200 N934UW operating flight AA722 on April 4/5 2016.\n\nAfter a short taxi in Philadelphia we get airborne and head towards New York, lighting  up the clouds below.  From New York it's on towards Canada and out across the Atlantic as we are served dinner.  \n\nThe sun starts to rise around soon after and we are soon treated to a beautiful dawn sky over the North Atlantic, illuminating the clouds below in a beautiful pink color.\n\nThe cabin lights soon come on and breakfast is served, as we commence our descent.  We make a beautiful approach and landing into Dublin, landing ahead of schedule after a flight time from Philadelphia of just 5h41m. \n\nVideo taken from seat 23A.\n\nAirline:  American Airlines\nFlight:  AA722\nAircraft:  Boeing 757-200 N938UW\nFrom:  Philadelphia (PHL)\nTo:  Dublin (DUB)\nDeparture:  21:18\nArrival:  07:59+1\nFlight Time:  05:41\nSeat:  23A\nFlight Path:  http://goo.gl/LgMWVg\n\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "bwb7EPFC_-g",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-09-23T08:30:42Z"
}