{
 "name": "Timelapse Flight: Berlin Tegel to Birmingham (Embraer E-175) GoPro",
 "description": "Timelapse full flight video from gate to gate onboard Flybe Embraer E-175 G-FBJF, operating flight BE1859 from Berlin Tegel (TXL) to Birmingham (BHX) on 27 November 2014.\n\nThe video starts at the departure gate and includes the bus ride to the aircraft, before boarding from the rear stairs\n\nWe pushback from a remote stand at Berlin, before taxying straight out to runway 08R for departure.  We climb out getting a distant view of the city of Berlin, before making a left turn to backtrack towards Hannover, climbing to an initial cruise altitude of FL360.  Clear skies give us a lovely view of the German countryside as we climb to FL380, before the cloud starts to build up overhead Amsterdam.  It doesn't last long though, and as we descend towards the English coast at Clacton-on-Sea we get a great view, before turning right to the northeast of London and descending directly towards runway 33 at Birmingham.  \n\nVideo taken from seat 16D.\n\nAirline:  Flybe\nFlight:  BE1859\nAircraft:  Embraer E-175 G-FBJF\nFrom:   Berlin Tegel (TXL)\nTo:  Birmingham (BHX)\nDeparture:  13:28\nArrival:  13:59\nFlight Time:  01:31\nSeat:  16D\nFlight Path:  http://goo.gl/ugHsxH\n\nPlease enjoy the flight and feel free to subscribe/comment!\n\nGoPro Hero 3\n\nTimelapse vollen Flug Videos von Tor zu Tor Bord Flybe Embraer E-175 G-FBJF, Betriebs Flug BE1859 von Berlin-Tegel (TXL) nach Birmingham (BHX) am 27. November 2014.\n\nDas Video beginnt am Flugsteig und beinhaltet die Fahrt mit dem Bus zum Flugzeug, bevor Sie an Bord von den hinteren Treppen\n\nWir Pushback von einem Remote-Stand auf Berlin, vor dem Rollen gerade aus auf die Piste 08R für den Abflug. Wir klettern immer eine Fernsicht auf die Stadt Berlin, bevor eine Linkskurve in Richtung Hannover wieder ansetzen, Klettern auf eine Anfangsreiseflughöhe von FL360. Wolkenloser Himmel geben uns einen schönen Blick auf die deutsche Landschaft, wie wir klettern auf FL380, bevor die Wolke beginnt aufzubauen Gemein Amsterdam. Es dauert nicht lange aber, und so steigen wir in Richtung der englischen Küste in Clacton-on-Sea wir eine tolle Aussicht, bevor Sie rechts in den Nordosten von London und absteigend direkt auf Landebahn 33 in Birmingham.\n\nVideo vom Sitz 16D übernommen.\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈",
 "source": "youtube",
 "source_id": "XNBLe6MbORY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-01-16T11:45:36Z"
}