{
 "name": "10hrs in American Airlines FIRST CLASS (Not what you think…)",
 "description": "Watch this video to see what it’s like to fly in American Airlines’ Flagship First Class from London to Dallas on a 777-300!\n\nAmerican Airlines is the only airline in the United States with true International First Class. They call it Flagship First, but is it more of a Flagship Flop? With a price as high as $15,000 for a seat, we couldn’t help but wonder: Is it worth it?  \n\nJoin us for a brutally honest review of this 10 hour flight across the Atlantic Ocean.\n\nIn this video, we’ll show you everything First Class from this experience. We’ll take you inside the American Airlines International First Class Lounge as well as show you some of the other places you can visit with an American Airlines Flagship First Class ticket. We'll also show you inside the Flagship First Lounge in DFW.\n\nOnce onboard, we’ll show you everything this First Class Seat has to offer, including its special “party trick!” Believe it or not, the First Class Seat swivels!\n\nFrom there, we’ll show you the first class dining that’s available from American Airlines on this route as well as the drinks. We’ll explore the inflight entertainment and even discuss the service onboard.\n\nFlagship First on an American Airlines 777-300er is a special experience and we feel so very fortunate to share it with you! As always, please never mistake any criticism for a lack of gratitude. We simply want to help you understand exactly what to expect if you choose to fly in Flagship First Class!\n\nOnce the flight’s done, we’ll rate everything in the First Class experience using the “JebScore.” We’ll also tell you exactly what we paid.\n\n0:00 Introduction\n1:55 American Airlines International First Lounge\n3:05 Cathay Pacific First Class Lounge\n5:37 Boarding\n8:54 Flagship First Lunch\n10:19 Flagship First Bed\n11:53 Flagship First JebScore\n13:40 Pricing\n14:28 Bloopers\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nInstagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nTwitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nSpin Me (Instrumental Version) - Duty Division\nWind Under My Wings (Instrumental Version) - Elijah N\nDon’t Talk to Me That Way (Instrumental Version) - Victor Lundberg\nDance (Sped Up Version) (Instrumental Version) - Lvly\nLike Paradise (Instrumental Version) - waykap\nUntil You Love Me Again (Instrumental Version) - Maybe\nPeace by Piece - Staffan Carlen\nLike You Do (Instrumental Version) - Particle House\nJackknife - Erik Fernholm",
 "source": "youtube",
 "source_id": "vvxBBl7Vqg8",
 "type": "Flight",
 "company": "American Airlines",
 "stops": ["LHR","DFW"],
 "postdate": "2024-04-06T15:00:45Z"
}