{
  "name": "World's ONLY 3-Room FIRST CLASS Suite (Etihad A380 Residence)",
  "description": "Watch this video to see what it’s like to fly in the most exclusive cabin in the sky: Etihad’s Residence on their Airbus A380!\n\nThis three room suite on the Etihad A380 is unlike anything else in the air. We flew from Abu Dhabi to London and experienced everything the Residence had to offer: From the luxurious living room to the opulent bedroom and even the super lux shower! This may just be the world's biggest First Class seat and so much more!!\n\nIn this video, you’ll see a complete Etihad Residence Tour, along with the First Class food, impressive inflight entertainment, incredible accommodation, and even the top-notch service from Eithad Airways.\n\nEtihad Airways’ “Residence” is just about the most luxurious and over-the-top experience you can book on any commercial airline. I’ve dreamed of trying it for nearly a decade and can’t believe the opportunity finally came…and it’s all thanks to YOU! Because you watch our videos, we were able to share this unbelievable experience with you!\n\nWe’ll even show you how to book the flight for less using a trick a friend shared with us.\n\nAt the end, we’ll rate the entire experience using the JebScore and show you exactly how we bought our tickets and what we paid for this.\n\n0:00 Introduction\n1:52 Etihad First Class Lounge\n6:13 Boarding Etihad Residence\n8:17 Residence Lunch\n9:52 Etihad Residence Tour\n11:50 Residence Shower\n14:01 Etihad Residence JebScore\n16:05 Bloopers\n\nHere’s more about booking the Residence:\nhttps://samchui.com/2023/07/27/etihad-a380-first-class-bangkok-to-london-from-2571-residence-upgrade-available/\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nInstagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nTwitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nThrough the Maze - Dream Cave\nEternal Fire (Instrumental Version) - Adelyn Paik\nThe Right Thing to Do (Instrumental Version) - Andy Delos Santos\nMeant to Love - William Benckert\nDon’t Waste My Time (K-POP Version) (Instrumental Version) - Collin Lim\nNobody Loves Me Better (Instrumental Version) - Sture Zetterberg\nRemember Me (Instrumental Version) - Mr Kent & Ruby Red\nCandlelight Dinner - More than Family\nPullin’ Me In (Instrumental Version) - Craig Reever\nSafe and Sound (Instrumental Version) - CLNGR\nWhat’s Left (Instrumental Version) - CLNGR",
  "source": "youtube",
  "source_id": "8plrAkUP1QQ",
  "type": "Flight",
  "company": "Etihad",
  "stops": ["AUH","LHR"],
  "postdate": "2024-03-30T15:00:06Z"
 }