{
 "name": "2 DAYS on Canada’s LUXURY TRAIN (Rocky Mountaineer) 🇨🇦",
 "description": "Welcome onboard an incredible Luxury Train through some of the most spectacular landscapes in Canada. \n\nThis is 2 Days on the Rocky Mountaineer's flagship “First Passage to the West” in Canada! If you’re thinking of taking an unforgettable train journey, watch this first!\n\nWith its unmatched scenery, the Rocky Mountaineer’s First Passage to the West luxury train should find its way onto your bucket list. Even though Rocky Mountaineer has been around since the 1990’s, this is their most famous route! \n\nIn this video, we’ll travel from Banff in Alberta Canada to Vancouver, British Columbia Canada onboard this incredible Luxury Train in their premium Gold Leaf class of service. \n\nYou’ll see the Luxury Train features available on this train along with the Luxury Train Food! We’ll also take in some of the incredible sights on this Luxury Train trip. You’ll see the sights, the food, and gain insight into what it’s like to travel on the newest Luxury Train in Canada:: Rocky Mountaineer’s First Passage to the West!. \n\n0:00 Introduction\n2:25 Boarding Rocky Mountaineer\n18:53 Day 2 onboard Rocky Mountaineer\n29:39 Rocky Mountaineer Price\n30:20 Bloopers\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nDon’t miss my video about Amtrak’s California Zephyr:\nhttps://www.youtube.com/watch?v=m1gRPEZdKyI \n\nAnd, why not check out this one about Amtrak’s LONGEST Route: https://www.youtube.com/watch?v=4-RcNp1uhKE \n\nOh! And here’s a link to the video I mentioned about the Alaska Railroad: https://www.youtube.com/watch?v=kIJoUNP2-v4 \n\nIf you made it this far, here’s a playlist of all of the train videos on my channel: https://www.youtube.com/watch?v=43p7rNDG7rk&list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nYou Took Me Somewhere New - Rain Jewels\nSeduce - Trevor Kowalski\nA New Beginning - Tall Oak Town\nWonders Abound - JOYSPRING\nThat's Why I Gave You Up (Instrumental Version) - Sugar Blizz\nSummer Crush - Maiwan\nSpiral Dynamics - Lama House\nSunny Daydreams - Raccy\nHard to Love (Instrumental Version) - Katnip\nNight Time Bliss - Phello\nYou Took Me Somewhere New - Rain Jewels \nFell Good - Andre Aguado\nThe Rain Will Come Back (Instrumental Version) - Daniel Gunnarsson\nEchoes of Stillness - Rebecca Mardal\nReally Hurts - HATAMITSUNAMI\nIt Ain't Love (Instrumental Version) - Snake City\nGravity - Daxten\nKVARKEN - Ooyy\nEasily Distracted - Margareta\nYou Are The Solution (Sped Up Version) (Instrumental Version) - Loving Caliber\nWaiting Room - Ethan Sloan\nEvergreen Fields - Tape Machines",
 "source": "youtube",
 "source_id": "9bx2_uGtFeo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-10-14T15:00:12Z"
}