{
 "name": "22hrs in the World's BEST FIRST CLASS (Singapore Suites to NYC)",
 "description": "Watch this video to see what it’s like to fly on the world’s BEST FIRST CLASS! This is Singapore Suites First Class!\n\nForgive the adjective overload here, but it’s not hyperbole. I promise!\n\nSingapore Suites is the best FIRST CLASS in the world. In fact, a lot of people say it's beyond first class, so welcome to Singapore Suites First Class on the Singapore Airlines A380! \n\nWe’re about to spend 22 hours experiencing the ultimate luxury in the sky as we travel from Singapore all the way to New York City via Frankfurt on a Singapore Airlines A380, and you’re along for the trip of a lifetime onboard SQ26 operated by a Singapore Airlines A380.\n\nIn this video, we’ll showcase Singapore Suites First Class and all you can experience on the longest flight they currently offer with this service. At a whopping 22 hours, this is one of the most extreme experiences you could expect to have in First Class (PLUS) anywhere! \n\nUnfortunately, the flight will soon be onboard a Singapore Airlines 777-300 with Singapore First Class.\n\nYou’ll see the unbelievable SECRET lounge within a lounge reserved for Singapore Airlines’ most exclusive passengers. We’ll also show you the unspeakably incredible suites we combined into a massive room, complete with a double bed!\n\nYou’ll also experience some decadent food onboard as we experience something like SIX First Class meals over this trip!\n\nNaturally, you’ll see the First Class Singapore Suites inflight entertainment, too. \n\nIn short, this was the most incredible aviation experience we’ve ever had. Can you guess the JebScore? Stick around to the end to find out if you’re right about this First Class Singapore Suites experience!\n\n0:00 Introduction\n1:26 Changi Airport\n2:33 Singapore Airlines “Private Room” Lounge\n4:42 Boarding Singapore Suites \n8:45 Singapore Suites Bed Mode\n12:29 Frankfurt Layover\n13:47 Boarding Singapore Suites\n16:23 Singapore Suites JebScore\n17:40 Bloopers\n \nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.Instagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nPhoto of the A380 at 4:09 is via Flickr:\nhttps://www.flickr.com/photos/bribri/7721163326\n\nMusic:\nI’ve Had Enough (Instrumental Version) - Snake City\nBad Vibe - Crystal Shards\nFirst Horizon - ELFL\nQuiet Departure - Brendon Moeller\nLeft in Haze - ELFL\nOut Into Space (Instrumental Version) - Vicki Vox\nTake Me Away (Instrumental Version) - Ramin\nEyes of Yours - Edgar Hopp\nClose Your Eyes - Gold In June\nSugar Spun - Moss Harman\nGood Morning Sun - Gregory David\nEnergized Morning - Airae\nI’ve Had Enough (Instrumental Version) - REPRISE - Snake City\nEyes of Yours - REPRISE - Edgar Hopp\nNorthern Touch - Alysha Sheldon\nFrom the Cliffside - Tape Machines",
 "source": "youtube",
 "source_id": "qt2-0D-IDP4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-05-06T15:00:39Z"
}