{
 "name": "24hrs in Lufthansa 747 FIRST CLASS (South Africa to USA)",
 "description": "Watch this video to see what it’s like to fly in FIRST CLASS on the QUEEN OF THE SKIES, the Boeing 747!\n\nLufthansa FIRST CLASS on the 747 is a special experience. In fact, a lot of people say it's a must-have experience for Aviation Enthusiasts! So welcome to LufthansaFirst Class on the 747! \n\nWe’re about to spend 24 hours experiencing the ultimate luxury in the sky as we travel from Johannesburg all the way to Chicago via Frankfurt on two Lufthansa 747-8’s, and you’re along for the trip of a lifetime along this unbelievable journey. \n\nIn this video, we’ll showcase Lufthansa First Class and all you can experience on the longest flight they currently offer with this service. \n\nAt a whopping 24 hours, this is one of the most extreme experiences you could expect to have in First Class anywhere! \n\nYou’ll see the unbelievable First Class Terminal, a completely separate building for a special lounge reserved for Lufthansa’s most exclusive passengers. We’ll also show you the unspeakably incredible seats! You’ll also experience some decadent food onboard as we experience special First Class meals over this trip! Naturally, you’ll see the First Class inflight entertainment, too. \n\nIn short, this was a very special aviation experience we can’t wait to share with you! \n\nCan you guess the JebScore? Stick around to the end to find out if you’re right about this First Class Lufthansa experience! \n\n0:00 Introduction \n2:42 Virgin Clubhouse Johannesburg\n3:26 Boarding Lufthansa First Class 747\n10:58 Lufthansa First Class Terminal\n13:23 Boarding Lufthansa First Class 747 (Again!!)\n22:41 Bloopers\n\nHere’s a link to my brother’s Porsche channel, Rennthusiast:\nhttps://youtube.com/@Rennthusiast\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic: \nIf Only I Was a Poet (Instrumental Version) - Staffan Carlen\nWhy Did I - HATAMITSUNAMI\nLusick (Instrumental Version) - Collin Lim\nSunshine in Your Hair - Felix Salt\nDancing on a Memory - Hallman\nStarry Night (Instrumental Version) - Collin Lim\nNext Station (Instrumental Version) - I’MIN\nFlee the Night (Instrumental Version) - Daniel Gunnarsson\nFirst Step (Instrumental Version) - Kata\nGetaway Spa - Colors of Illusion\nBasement Vibes (Instrumental Version) - DAJANA\nWhat Do You Say_ (Instrumental Version) - Mindme\nNot Getting Younger (Instrumental Version) - Maybe\nHeavenly Bound - Aluvio\nAdore Me (Instrumental Version) - Maybe\nTBH (Instrumental Version) - Gamma Skies",
 "source": "youtube",
 "source_id": "2TD5vjLbDEQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-07-29T15:00:01Z"
}