{
 "name": "7 Days in Antarctica (Journey to the South Pole)",
 "description": "Watch this video to see what it’s like to spend 7 Days in Antarctica on my Journey to the South Pole and to travel in Antarctica!\n\nIn this Antarctica Travel Vlog, you’ll see what it’s like to fly from Cape Town to Antarctica’s only private jet runway and then spend a week flying around Antarctica’s Queen Maud Land. You’ll see the luxury accommodations provided by White Desert, the incredible airplanes operating in this unforgiving environment.\n\nWe’ll fight hurricane force winds and negative 35 degree temperatures in order to visit a spot on the map that’s nearly impossible to reach. Along the way, we’ll see what it’s like to spend a week on the coldest, driest, and windiest continent.\n\nThe South Pole is the southernmost point on planet earth and that, in and of itself, is enough for me to want to visit, but there’s more. Fewer than 500 tourists visit each year. Even if everything goes perfectly – which of course it won’t – getting there just isn’t easy. \n\nWe'll fly on an Airbus A340 to Antarctica and then onboard a specially modified DC-3 called a Basler as we answer the question can you travel to Antarctica (and beyond)?\n\n0:00 Introduction\n0:43 Departing Cape Town\n2:53 Arriving in Antarctica\n4:02 South Pole Attempt\n9:36 Emperor Penguins at Atka Bay\n12:10 South Pole Attempt 2\n \nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.Instagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nHere's a link to White Desert:\nhttps://white-desert.com/\n \nMusic:\nArmaments Yare - Bonnie Grace\nOceanic Adventure - Bonnie Grace\nWhat Happens Them - Kikoru\nA Heavy Load (Instrumental Version) - Sven Karlsson\nFinding Out About Her - Philip Ayers\nArrival of the Hour - Max Anson\nA Love That Once Belonged - Claude Signet\nTrembling Anticipation - Dream Cave\nSmall Sacrifice - Alfie-Jay Winters\nTwenty Eleven - Rocket Jr\nDemystify - Christian Andersen\nKind of Beautiful - Gold In June\nNight of Light - Colors of Illusion\nTiny Trips Away - Dag Anderson\nDaydream - Luwaks\nElectric Dream - Earle Belo\nThis Is It - Jon Bjork\nLegendary Walk - Bonnie Grace",
 "source": "youtube",
 "source_id": "LYDf3YCdPbE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-01-21T16:00:10Z"
}