{
 "name": "FIRST CLASS TRAIN Across Australia on \"The Ghan\"",
 "description": "Welcome onboard a First Class Train through one of the world's most incredible places: The Australian Outback! Watch this video before booking the Ghan train through Australia! \n\nWith its journey through the rugged Australian Outback, The Ghan should be at the top of your travel bucket list. \n\nIn this video, we’ll travel across Australia from Adelaide in the South to Darwin in the North onboard the ultimate First Class Overnight Train in the most luxurious Platinum Class Twin suite they have. \n\nYou’ll see the First Class Train cabins available on this train along with the First Class Train Food!\n\nWe’ll also explore the Australian Outback on our way, stopping at Marla to enjoy a breathtaking sunrise, Alice Springs for an exhilarating bike ride, and Katherine for a trip along the river. \n\nYou’ll see the sights, the food, and gain insight into what it’s like to travel on this incredible First Class Train: The Ghan. \n\n0:00 Introduction to this First Class Train\n1:40 Boarding the First Class Train\n8:19 Day Two of the First Class Train\n12:25 First Class Train Cabin Tour\n18:56 Day Three of the First Class Train\n24:49 Bloopers\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n\nHere's a link to the Journey Beyond website with more information about the Ghan:\nhttps://www.journeybeyondrail.com.au/ \n\nHere’s a video about the MOST INCREDIBLE First Class Train!\nhttps://www.youtube.com/watch?v=uzyYKAPcfmE\n\nDon’t miss my video about Amtrak’s California Zephyr: \nhttps://www.youtube.com/watch?v=m1gRPEZdKyI&t=0s\n\nAnd, why not check out this one about Amtrak’s LONGEST Route:\nhttps://www.youtube.com/watch?v=4-RcNp1uhKE&t=1227s\n\nOh! And here’s a link to the video we made about Amtrak’s Southwest Chief: https://www.youtube.com/watch?v=eYiMihP0OHU&t=164s\n\nJust one more…a video I made comparing Amtrak's Acela to a plane: \nhttps://www.youtube.com/watch?v=aVLnQFTazz8&t=0s\n\nIf you made it this far, here’s a playlist of all of the train videos on my channel: \nhttps://www.youtube.com/watch?v=43p7rNDG7rk&list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc&index=1&t=0s\n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nUsed to This (Instrumental Version) - Maybe\nI Was Here (Instrumental Version) - Maybe\nLife of the Party (Instrumental Version) - Maybe\nSleepless (4 AM) (Instrumental Version) - Loving Caliber\nHello Yellow (Instrumental Version) - Zorro\nThunder Lightning (Instrumental Version) - Gamma Skies\nEat Your Heart Out (Instrumental Version) - Maybe\nCarry You Home (Tribute Version) (Instrumental Version) - Akerman\nGood Things Will Come (Instrumental Version) - Tellow\nIf I Could, I Would (Instrumental Version) - Mindme\nTheres Still Time (Instrumental Version) - Erik Fernholm\nGet Over (Instrumental Version) - Mindme\nKnock On Wood (Instrumental Version) - Ray\nCome On Out (Instrumental Version) - No Inertia\nRead Receipts (Instrumental Version) - Zorro",
 "source": "youtube",
 "source_id": "gNmhrTOYcqg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-04-29T15:00:25Z"
}