{
 "name": "Japan's INCREDIBLE Overnight Ferry (More Like a Cruise?)",
 "description": "Watch this Japan Travel Guide to get a sense of this Japanese Ferry Travel! You'll see what it’s like to travel from Beppu to Osaka for 12 hours on Japan’s Newest Ferry, the Sunflower Kurenai!\n\nJoin us as we travel in the lap of luxury onboard a ferry that’s more like a cruise ship!!\n\nThis is only the third time we’ve made a video highlighting a ferry and it was the best yet! This Japanese ferry truly has it all! \n\nWe splurged for a Japanese Style room, complete Tatami Mats for sleeping. We also explored the Dinner Buffet and the Breakfast Buffet to experience delicious Japanese Ferry food! \n\nThat means you get to see it all!  You’ll have to be the judge of whether it’s worth the price for you. We’ll even rate the whole thing using the JebScore to give you a sense for the Ferry Terminal at Beppu, the Ferry food, the (really cool) room we booked, the onboard entertainment, and even the service!\n\nFor the latest pricing and schedules, check out this website:\nhttps://www.ferry-sunflower.co.jp/en/\n\nHere's a link to Paul \"Wingin' It\" Lucas's Shinkansen video Suzanne mentioned:\nhttps://www.youtube.com/watch?v=Ov-9tKkjCy8\n\nYou’ll also see the other amenities onboard, including the shop, onsen, massaging chairs, and even more!.\n\n0:00 Introduction\n1:30 Boarding the Sunflower Kurenai Ferry\n2:45 Exploring the Sunflower Kurenai Ferry\n3:38 Dinner on the Sunflower Kurenai Ferry\n5:39 Room Tour\n8:38 Breakfast on the Sunflower Kurenai Ferry\n9:37 JebScore\n10:52 Bloopers\n\nWatch more of our Videos \"At Sea:\"\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFeqYB4nI-30qFHSBrU7FvoQZ\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n \nCheck me out on Twitter/X, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nJapanese Temple - Sight of Wonders\nMidnight Mood - Far Orange\nIsland to Island - Adriel Fair\nHey D - Far Orange\nNo River Wide Enough - Airae\nApparitions - Amaranth Cove\nIf You Believe - Yonder Dale\nUp and Beyond - Airae\nAll We Wished For - Alexandra Woodward",
 "source": "youtube",
 "source_id": "cdtyKmWfO2M",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-11-25T16:00:31Z"
}