{
 "name": "LUXURY for LESS: All-Business Class Flight (Paris-NYC)",
 "description": "Watch this video to see how to travel in BUSINESS CLASS across the Atlantic Ocean for less! We flew with La Compagnie between Paris Orly Airport and Newark Liberty Airport for eight and a half hours and now we'll share it with you!\n\nLa Compagnie flies Airbus A321neo airplanes in an all business class configuration! That's right...every single seat is also a lie flat bed!\n\nThis may just be the best way to fly from Paris to New York for less!\n\nLa Compagnie is a French boutique airline with two A321's with only Business Class! If you know how to book it, it can be cheaper than the major airlines.. \n\nWe were so excited to be able to book this boutique business class airline. They say it's so special and everyone onboard has their own lie-flat seat. \n\nThere’s a ton of services and features onboard, and we’ll explore them all. \n\nWe'll also show you exactly how you can get this business class ticket for a better price. You'll find out how to get it for 1/2 price compared to the major airlines!\n\nWe’ll even give the experience a JebScore! We'll rate the Lounge, the La Compagnie Seat, the (incredible) La Compagnie Food, the La Compagnie Inflight Entertainment, and their impressive Service.\n\n0:00 Introduction\n3:28 Primeclass Lounge at Orly\n4:59 Boarding La Compagnie\n6:52 La Compagnie Inflight Entertainment\n8:03 La Compagnie Lunch\n11:17 La Compagnie Jebscore\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies/\n\nCheck me out on Twitter, too: \nhttps://twitter.com/Jebbrooks \n  \nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/\n\nMusic:\nLets Go on a Trip - baegel\nRainy Paris - Trabant 33\nAvocados on Hash Browns - baegel\nLets Talk - Matt Large\nThe BOP (Sway to It) - Sarah, the Illstrumentalist\nThat Flavour - Chronillogical\ntrue authentic self - Sarah, the Illstrumentalist\nBiltmore Hills - Sarah, the illstrumentalist",
 "source": "youtube",
 "source_id": "RtfLCPVEjmM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-12-23T16:00:21Z"
}