{
 "name": "Secret Life of Airports: Aircraft Turnaround in 35 Min!",
 "description": "Aegean Airlines ranks as one of the most celebrated airlines in Europe. In this video, you’ll go Behind the Scenes for yourself to see exactly what makes the airline special and whether you’d like to incorporate Aegean Airlines’ Business Class into your next Greek vacation.\n\nThanks to our friends at Fraport (who operate Thessaloniki and Rhodes airports), we were able to get behind the scenes to see exactly how loads of professionals work tirelessly to make our flights as smooth as possibl.e\n\nAegean Airlines operates a flight from Frankfurt to Thssaloniki and another one on to Rhodes. You’ll be onboard to see what it’s like to take the trip in Business Class.\n\nOur first flight was onboard an Aegean Airlines A321neo. \n\nIn this video, you’ll also see the beautiful scenery along the way, but best of all, you'll get out on the apron to see just how these airplanes are turned in 35 minutes or less~!\n\nWe’ll explore both the Thessaloniki airport and Rhodes airport, the Aegean Airlines Business Class seat, the Aegean Airlines service, the Aegean Airlines inflight entertainment, the Aegean Airlines Business Class food, and even the Aegean Airlines flagship lounge in Thessaloniki!\n\nDon't miss our video exploring Frankfurt Airport!\nhttps://youtu.be/Xe-6wtpAJ_w?si=8l7KgAGVwLn9-2Fa\n\nJust like that video at Frankfurt, this is NOT a sponsored video; however, the unprecedented access we’ll get in Greece wouldn’t be possible without our friends at Fraport Greece who made it possible. As always, we paid for all of our travel ourselves.\n\n0:00 Introduction\n1:16 Boarding Aegean A321neo\n4:31 Exploring Thessaloniki Airport\n7:43 Boarding Aegean A320neo\n9:25 Exploring Rhodes Airport\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nNo Signal - Phello\nViolet Sky (Instrumental Version) - Phello\nOvercast - Phello\nFrom Naxos to Paros - George Prokopiou\nFolktro - West & Zander\nTempo (Instrumental Version) = I'MIN\nNo Signal - Phello",
 "source": "youtube",
 "source_id": "L_xueUwL3Vo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-09-30T15:00:25Z"
}