{
 "name": "Sleeper Train to the ARCTIC CIRCLE (Will We Find Santa?)",
 "description": "Watch this video to experience a Polar Express train to the Arctic Circle in Finland! We’ll travel from Helsinki to Rovaniemi in order to visit Santa Claus.\n\nThis is the REAL LIFE Polar Express in Finland called the “Santa Claus Express.” It's a special offering of the famous \"Lapland Express\" where we'll visit Finland's Lapland! \n\nThis ~500 mile trip will take us 12 hours through some of the most magnificent scenery in the Northern Hemisphere! \n\nLapland has been home to Santa Claus for centuries and our final destination, directly on the Arctic Circle, is his official headquarters!\n\nAlong the way, we’ll tour the VR Rail Upstairs Sleeper Room. It’s like a hotel room on rails, complete with its own bathroom and shower! We’ll also sample the food in the Restaurant Car. \n\nBut, the best part has to be the scenery we’ll wake up to on the train! It is truly breathtaking. We even saw eight tiny reindeer!\n\nBut, can we find the Big Man himself? Our train journey will end with a visit to the Santa Claus Village in Lapland, Finland. That’s Santa’s official headquarters where we hope to put in a good word for you!\n\n0:00 Introduction\n1:30 Boarding the Santa Claus Express\n3:57 Arctic Train Room Tour\n5:49 Bedtime on the Train\n7:54 Lapland Sunrise\n9:23 Santa Claus Village\n9:55 Bloopers\n\nVR Finland Website\nhttps://www.vr.fi/\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n \nCheck me out on Twitter/X, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nMerry Christmas Day (Instrumental Version) - Stonekeepers\nChristmas Dinner - Home for the Holidays\nChristmas Wonders - Howard Harper-Barnes\nA Christmas Dance - Arthur Benson\nThe First Snow of Christmas (Instrumental Version) - The Snowy Hill Singers\nScream My Name (Instrumental Version) - Taynte\nA Christmas Kiss (Instrumental Version) - The Snowy Hill Singers\nChristmas Love (Instrumental Version) - In Wintertime\nAll For Christmas (Instrumental Version) - The Noel",
 "source": "youtube",
 "source_id": "-cHVgd5d0B8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-12-02T16:00:00Z"
}