{
 "name": "RARE VISITOR! French Bee Airbus A350-900 at Calgary Airport [4K]",
 "description": "Over the past few days, Calgary's been lucky enough to see this Airbus A350-900 from French Bee, a French low-cost airline!\n\nFrench Bee flies a route from Paris to Tahiti in French Polynesia, normally via San Francisco. Due to COVID though, they've switched that SFO stop to Vancouver for the past few months.\n\nRecently though, Vancouver has reportedly been having some fuel supply issues, and so French Bee has temporarily relocated that stopover to Calgary! Prior to this, we've only ever had one A350 in Calgary, so it's been an absolute pleasure seeing French Bee here. Enjoy this A350 footage filmed over the past few days.\n\nThank you to RadarBox for supporting this plane spotting video! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: French Bee (FBU/BF)\nAircraft: Airbus A350-941 (A359)\nFlight Number: BF716/BF717\nLivery: Standard\nEngines: 2x RR Trent XWB\nRegistration: F-HREU\nRoute: Paris-Orly (ORY) - Calgary (YYC) - Papeete (PPT) - Calgary (YYC)\nCallsign: FRENCH BEE 716/717 heavy\nRunway used: 17L, 17R, 35L\nDate filmed: July 16/17/18, 2021\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2021\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "A2MC-6fT_HM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-07-20T01:06:58Z"
}