{
 "name": "AIR SERBIA - Belgrade to Zagreb by ATR-72, Economy Trip Report",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nDL James\nJoe Pantry\nLaila Bergman\nScott Mathews \nHenry Bollington\nDoug Gard\nJonathan O’Connor\nKirby Jackson\nNatalie Napolitano\nCliff Hope\nMike Wooldridge\nSteven Steffen\nBailey Courtney\nJose Nanin\nNeil Smith \nStephen Newton\nAnthony Crawford\nPatrick McBride\nAlexander Schoell\nRob Johnston\nJoseph O’Brien\nAmber Watts\nKodzo \nEdward Powell\nSean Gorelik\nQuintin Soloviev\nSteve Cooksley\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: MAY 2018\nAirline: Air Serbia \nLivery: Air Serbia standard \nRoute: BEG-ZAG\nAircraft: ATR-72\nRegistration: YU-ALU\nFlight Number: JU 234\nMiles: 216\nAirborne time: 1h05m\nNotes: None\nCost to book: £59 one way\n\nThanks for finding my video and pressing play!\n\nFollowing on from my last video featuring Aegean Airlines, I travel in this video between Belgrade and Zagreb with Air Serbia. This is an airline which has proud Yugoslav roots in the old JAT airline (remember them?). \n\nSerbia is a proud nation and their national carrier even flies to New York five times a week, with a single A330. On this short flight, I had a basic economy ticket and travelled on a humble ATR72 to make the 210 mile trip to Zagreb, one of Europe’s most underrated cities. \n\nI recommend travelling to the Balkans if you can. Since the breakup of the former Yugoslavia the region is peppered with distinct and beautiful nations like Serbia and Croatia, and they’re well worth checking out. However you might want to avoid the thunderstorms in spring, as you can see in the video!\n\nOverall a perfectly acceptable short hop with Air Serbia and while there was no catering on my bargain basement ticket, the price was alright considering they have a monopoly on this air route. \n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @pauls_trips. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "merScdnB0_c",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-05-18T22:16:04Z"
}