{
 "name": "BRA Braathens Regional, Sweden’s AMAZING Little Airline: Gothenburg to Stockholm-Bromma",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nAbby Fitzpatrick \nJohn Walsh\nJoe Pantry\nLaila Bergman\nHenry Bollington\nJonathan O’Connor\nBailey Courtney\nNeil Smith \nPatrick McBride\nAlexander Schoell\nRob Johnston\nJohn Walsh\nAmber Watts\nKodzo \nSean Gorelik\nQuintin Soloviev\nDuenna\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: JANUARY 2018\nAirline: BRA Braathens Regional\nFlight #: TF11\nAircraft: Avro RJ100\nLivery: BRA Standard pastel rainbow      \nRoute: GOT-BMA\nTail number: SE-DSV\nMiles: 235\nAirborne time: 0h56m\nNotes: Aircraft swap from RJ85\nCost to book: Around £100, including bags and flexibility  - one way. \n\nThanks for finding my video and pressing play!\n\nI was in Gothenburg in 2016 and noticed a strange-looking airline with odd “rainbow” style tail fins. I found out they were BRA Braathens Regional Airlines, a small domestic carrier operating mostly within Sweden from their hub at Bromma. \n\nSo, naturally, I had to try them. At around £100 one way this was by no means a cheap flight. These Gothenburg to Stockholm shuttles are meant for the business traveller and priced accordingly. The flight was full of people off to do a day’s business in Sweden’s capital. \n\nHowever, even given the price, I was still impressed by their service standard. This is an airline that knows who its customers are and the product is sensible and thoughtful. There’s even a breakfast served on the flight, a coffee and drinks service, a hot towel and a second drinks run. Very impressive on a flight of under an hour. \n\nOf course, the real highlight for me was an opportunity to fly one of these old RJ aircraft again. I can remember when they were the staple of BA Cityflyer flights from London City back when I was starting my flying addiction. They’re a fun aircraft to fly. A bit cramped, but their uniqueness ensures charm overrides pragmatism for me. \n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nArtificial Music - Spring Autumn Sunset\nBonus Points - On The Rocks\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "06ozZHHGLcw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-02-11T07:47:31Z"
}