{
 "name": "Carpatair’s RARE Fokker 100 - Vienna to Ljubljana (for Adria Airways)",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nAbby Fitzpatrick \nDL James\nJohn Walsh\nJoe Pantry\nLaila Bergman\nHenry Bollington\nJonathan O’Connor\nCliff Hope\nBailey Courtney\nNeil Smith \nPatrick McBride\nAlexander Schoell\nRob Johnston\nJohn Walsh\nAmber Watts\nKodzo \nSean Gorelik\nQuintin Soloviev\nDuenna\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: FEBRUARY 2018\nAirline: Carpatair (on behalf of Adria Airways)\nLivery: Carpatair standard      \nRoute: VIE-LJU\nAircraft: Fokker 100\nRegistration: YR-FKA\nFlight Number: JP 137\nMiles: 163\nAirborne time: 0h31m\nNotes: Charter F100 covering regular Adria fleet\nCost to book: £87 one way through Adria, hand baggage only (Full itinerary VIE-LJU-ZAG)\n\nThanks for finding my video and pressing play!\n\nSome of you who follow me on other forms of social media will know I’ve not had much luck with aircraft swaps lately. The worst one was being denied my first Sukhoi Superjet from Stockholm-Bromma. But sometimes you just get lucky. \n\nI’d booked this flight as a plain old Adria Airways regional flight on a CRJ900, and it was only on the day of the flight that Adria changed this for a chartered Fokker 100. The full itinerary took me onward to Zagreb. For some shorter connections from Ljubljana, Adria doesn’t run flights but instead runs minibuses connecting passengers into the city centres. I don’t think I’ve ever taken a bus disguised as a flight before, and you’ll see in the video there’s a strange anomaly with air miles about this trip!\n\nUnfortunately travelling in winter does mean I take my fair share of night flights (its impossible to make all my itineraries “work” over a weekend without them). So, there’s really nothing to see on the ground...but that’s okay because I got to fly on an unusual aircraft type. Fokker 100s are increasingly rare to find in passenger service in Europe; I was delighted to find this old bird dragged away from her base in Romania to take me on the short hop into Slovenia. \n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nJoakim Karud - Make a Wish\nKronicle - Lucid Dreaming\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "ipgyDsv_18k",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-02-25T08:55:13Z"
}