{
 "name": "CROATIA AIRLINES: Domestic Business Class, Dash-8 Q400, Zagreb to Split Trip Report",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nDL James\nJoe Pantry\nLaila Bergman\nScott Mathews \nHenry Bollington\nDoug Gard\nJonathan O’Connor\nKirby Jackson\nNatalie Napolitano\nCliff Hope\nMike Wooldridge\nSteven Steffen\nBailey Courtney\nJose Nanin\nNeil Smith \nStephen Newton\nAnthony Crawford\nPatrick McBride\nAlexander Schoell\nRob Johnston\nJoseph O’Brien\nAmber Watts\nKodzo \nEdward Powell\nSean Gorelik\nQuintin Soloviev\nSteve Cooksley\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: MAY 2018\nAirline: Croatia Airlines \nLivery: Croatia Airlines standard \nRoute: ZAG-SPU\nAircraft: Dash 8 Q400\nRegistration: 9A-CQE\nFlight Number: OU 652\nMiles: 152\nAirborne time: 0h36m\nNotes: None\nCost to book: Booked as part of complex multi city itinerary\n\nThanks for finding my video and pressing play!\n\nWe’re nearing the end of my little sojourn in southeastern Europe. In this video I travel between Zagreb and Split on a wholly domestic flight within Croatia. \n\nZagreb Airport, which we’ve seen a few times before on my channel, is a lovely new building and everything a small international airport should be. It’s airy and spacious and there’s lots of glass allowing for good runway views. \n\nOur flight today also passes over somewhere else I must visit in the near future: Bosnia and Herzegovina. The Balkans have always interested me, as when I was growing up the wars there were the first wars I remember being televised (yes I’m too young to remember Gulf War I!). It’s great to visit the area and find how progressive all the nations are now. Croatia is particularly lovely. \n\nAs you know I have an irrational hatred of Q400 aircraft and forgot that the first row has a badly placed window...so I don’t recommend sitting in 2D! My arm was a little sore from holding the camera there...\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @pauls_trips. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "KWVtrT6PicE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-05-20T11:57:59Z"
}