{
 "name": "EASYJET SWITZERLAND Flight Experience, Bournemouth - Geneva (Airbus A319)",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nDL James\nJoe Pantry\nLaila Bergman\nHenry Bollington\nJonathan O’Connor\nCliff Hope\nMike Wooldridge\nBailey Courtney\nNeil Smith \nPatrick McBride\nAlexander Schoell\nRob Johnston\nAmber Watts\nKodzo \nSean Gorelik\nQuintin Soloviev\nSteve Cooksley\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: MARCH 2018\nAirline: easyJet Switzerland \nLivery: Easyjet Standard  \nRoute: BOH-GVA\nAircraft: Airbus A319\nRegistration: HB-JYN\nFlight Number: EZS 6395\nMiles: 480\nAirborne time: 1h24m\nNotes: None\nCost to book: £43 one way plus £3 seat selection fee. No hold baggage included. \n\nThanks for finding my video and pressing play!\n\nWe’re lucky in Britain to have a surprisingly large number of active regional airports offering flights to various places. As part of my unofficial quest to travel from as many of them as possible, I travelled from Bournemouth (formerly Hurn) to Geneva. \n\nEasyjet Switzerland is a Swiss franchise of the popular easyJet brand. It can trace its roots back to the old TEA group of airlines. Today, easyJet holds 49% of their Swiss franchise with a variety of private investors making up the rest. \n\nThe report is self explanatory, but I have to say how surprised I was that easyJet offer inflight entertainment (but no WiFi) on this route. They’re ahead of a lot of legacy airlines - BA are you watching? Despite a delay caused by weather in Geneva this was a great experience and well worth the very modest expense of £43 plus £3 seating fee. \n\nAs a minor point, the flight was basically fully loaded as the Saturday rotation was cancelled due to weather, and some passengers had been rebooked. It was almost exclusively ski traffic and people heading to the Geneva motor show. \n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @pauls_trips. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nNicolai Heidlas - Point of View\nBlue Wednesday - Best I Can\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "nmkVrpeb8YA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-03-11T08:48:30Z"
}