{
 "name": "LOT Polish Airlines’ BRAND NEW Boeing 737 MAX-8: London Heathrow to Warsaw, Business Class",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nAbby Fitzpatrick \nJohn Walsh\nJoe Pantry\nLaila Bergman\nHenry Bollington\nJonathan O’Connor\nBailey Courtney\nNeil Smith \nAlexander Schoell\nRob Johnston\nJohn Walsh\nAmber Watts\nSean Gorelik\nQuintin Soloviev\nDuenna\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nAnonymous Donor \n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: JANUARY 2018\nAirline: LOT Polish Airlines \nFlight #: LO282\nAircraft: Boeing 737-MAX8\nLivery: LOT Standard      \nRoute: LHR-WAW\nTail number: SP-LVB\nMiles: 915\nAirborne time: 2h33m\nNotes: Brand new aircraft \nCost to book: £288, LHR-WAW-KTW /6 month stopover/ KTW-WAW-LHR\n\nThanks for finding my video and pressing play!\n\nIn this video I fly on my first ever Boeing 737-MAX. For a short time, LOT is “proving” its new aircraft on the London route from Warsaw. So, naturally, I wanted to go and check out a MAX and find out what all the fuss is about. \n\nLOT is one of the oldest airlines still operating in the world today (founded 1929) and I’ve flown with them about half a dozen times before. They’re cheap but pleasant to fly with, and in this video I try their European business class. \n\nBusiness class within Europe is rarely anything spectacular, but I know a lot of commenters get hung up on the seats - the same as economy, with a blocked middle seat and usually a drop down table to share. Many people might point to the USA as a place where business class on flights of this length is better because the seat is. I don’t agree! In this video, I get access to the Singapore Airlines Lounge where I can get a proper cooked breakfast - it’s definitely several ranks higher than something like an Admirals’ Club, and remember that domestic business and first class within the USA doesn’t grant you lounge access anyway in and of itself. On most flights of 2h30 or under, you won’t get fed a proper meal in the USA. It’s just snacks and drinks. I get an impressive brunch thrown in here courtesy of LOT. It’s well-portioned and the quality was very good. I’d go so far as to say on the basis of this meal alone, LOT probably ranks in the top third of European business classes. \n\nThe Boeing Sky cabin on our aircraft is excellent - I really like the mood lighting and the use of soft shapes. Not only is the cabin bright and airy, it’s also very quiet. Just check out the takeoff footage to see how little noise from outside gets in. \n\nOverall, a first-rate experience for travelling within Europe and I can definitely recommend it. I can also recommend Poland as a weekend destination; it’s a very underrated country, inexpensive and intriguing. It also has a large number of top-rank hotel rooms available for very little money, plus the Poles have probably the finest hospitality and service culture in Europe. At least, I think so. \n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nVelkonz - Know Who You Are\nBlue Wednesday - Secret Garden \nDekobe - Galaxy\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "S7S56lXGxgo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-01-28T09:19:50Z"
}