{
 "name": "LUFTHANSA CITYLINE Business Class, CRJ900, Frankfurt to Zagreb",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nDL James\nJoe Pantry\nLaila Bergman\nHenry Bollington\nJonathan O’Connor\nCliff Hope\nBailey Courtney\nNeil Smith \nPatrick McBride\nAlexander Schoell\nRob Johnston\nAmber Watts\nKodzo \nSean Gorelik\nQuintin Soloviev\nSteve Cooksley\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: FEBRUARY 2018\nAirline: Lufthansa CityLine\nLivery: Lufthansa CityLine standard \nRoute: FRA-ZAG\nAircraft: CRJ-900\nRegistration: D-ACNL\nFlight Number: LH 5405\nMiles: 456\nAirborne time: 1h11m\nNotes: None\nCost to book: Booked as part of open jaw itinerary with stopover via Croatia Airlines, LHR-FRA-ZAG (open jaw+3 month stopover) SPU-LHR, £243 all in, Business Class, in the Z fare bucket during a sale. \n\nThanks for finding my video and pressing play!\n\nJoin me this week as I fly on a short but pleasant flight between Frankfurt in Germany and Zagreb in Croatia. The route for this flights takes us over the Swiss Alps, so despite the weather being mostly cloudy, we’re still treated to a wonderful view of the wintry Alps from 32,000 feet. \n\nThat kind of view is definitely the reason I love flying so much. Lufthansa are a pretty straightforward carrier who deliver what they promise in an unfussy way. I like that about them - they’re reliable and easy to get along with. However, I wish they’d tell me what food they’re serving me...I’ve literally *no idea* what the meal in this video was, other than it had some prawns and beef I think. Very tasty, but if someone can tell me what it was, I’d be grateful!\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @pauls_trips. I’ve started using it properly now and it would be great to see some of you there too. \n\nLet me know what you think of Lufthansa CityLine in the comments. I have some interesting flights to take in the next few weeks, including (much-requested) Thomas Cook from Fuerteventura to Birmingham, a Canary Islands inter-island hopper, and a spin on Luxair, Luxembourg’s neat little national carrier. \n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nNicolai Heidlas - Take The Chance\nVexento - Trippy Love\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "wFGTFlBi80E",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-03-04T09:25:50Z"
}