{
 "name": "NORWEGIAN, my favourite low cost airline: Stockholm to Gothenburg, Boeing 737-800",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nDL James\nJoe Pantry\nLaila Bergman\nHenry Bollington\nDoug Gard\nJonathan O’Connor\nCliff Hope\nEdward Powell\nMike Wooldridge\nBailey Courtney\nNeil Smith \nStephen Newton\nPatrick McBride\nAlexander Schoell\nRob Johnston\nJoseph O’Brien\nAmber Watts\nKodzo \nEdward Powell\nSean Gorelik\nQuintin Soloviev\nSteve Cooksley\nTom Freeborough\nDan\nStephen James\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nRachel Partridge\nAnonymous Donor \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nSee my upcoming plans at BA97 here: https://ba97.com/report.asp?handle=paul4040\n\nDate of Travel: JANUARY 2018\nAirline: Norwegian\nLivery: Norwegian standard with “Christopher Columbus” tail\nRoute: ARN-GOT\nAircraft: Boeing 737-800\nRegistration: LN-NIH\nFlight Number: DY4087\nMiles: 244\nAirborne time: 0h49m\nNotes: None\nCost to book: £51 one way including seat selection \n\nThanks for finding my video and pressing play!\n\nIn this video I travel on a Swedish domestic flight between Stockholm-Arlanda and Gothenburg-Landvetter. \n\nI really like Norwegian’s ethos and product. I’ve flown with them a few times now and the thing that impressed me most is the simplicity of their services. Nothing is difficult to use, they’re always affordable, and the inflight connectivity is the best I’ve experienced inside Europe. \n\nThis flight was cheaper than the equivalent train journey and, when you factor in getting to and from the airports at either end, around the same time. It also helped that the following day I needed to be at Gothenburg airport very early, to catch the BRA flight featured in this trip report! https://m.youtube.com/watch?v=06ozZHHGLcw\n\nIn all, a perfectly simple and good value experience again from Norwegian. The flight was punctual despite some bad weather around Sweden, and the whole experience was efficient and easy. \n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @pauls_trips. I’ve started using it properly now and it would be great to see some of you there too. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library:\nPryces - Tryagain\nPryces - 9th Wonder\n\n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "bVG5NOy13ys",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-04-08T09:43:55Z"
}