{
 "name": "Jetblue's FIRST FLIGHT Amsterdam - JFK (+ luxury Mint Studio Review)",
 "description": "Flying the inaugural Amsterdam to New York-JFK was an incredible experience! Follow me as I fly my favourite American carrier on their first flight from the Netherlands in the luxurious Mint Studio. (AD) Click here https://bit.ly/PAULLUCAS60 to get 60% OFF your first box + 25% off your next 8 boxes, or use my code PAULLUCAS60. \n\nI'm so excited to share this video with you; I loved my second long haul JetBlue flight and can't wait to share more of my round the world (westbound!) trip. We've got a trip on Breeze, distinguished Japanese budget carrier ZipAir, some fabulous Japanese trains, a strange JAL A350 domestic first class product, Thai jungle trains, a 747-400 still in passenger service, what else? Oh, Qatar Airways A380 economy and a couple of other surprises along the way! make sure yiu subscribe!\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\nFollow me on Instagram/Threads: paul_winginit ¦ https://www.instagram.com/paul_winginit\nMerch store: https://wingin-it.teemill.com/collection/all-products/\n\n0:00 Intro\n0:35 AMS Airport\n1:41 At the gate - and how I booked this flight!\n2:46 Hello Fresh sponsor segment\n4:10 gate party, and boarding our Jetblue A321LR\n6:27 Taxi and takeoff\n7:36 Studio suite details\n10:11 Lunch service\n11:16 More wow\n11:52 Amenities and goodies\n12:24 IFE\n13:30 Bed time (it's huge)\n13:49 Second meal\n14:44 Landing and conclusions\n\nMy website: www.winginit.me\n\nDate of Travel: 30 AUGUST 2023\nAirline: JetBlue\nLivery: JetBlue standard livery w/Streamers tail\nRoute: AMS-JFK *inaugural\nAircraft: Airbus A321LR\nFlight Number: B6 2289\nMiles: 3,634\nAirborne time: 8h29m\n\nStock footage provided under licence from Shutterstock.\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "UaGNZuYVXgw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-09-12T13:28:26Z"
}