{
 "name": "Seven LONG hours in Breeze's \"first class\" seat on the Airbus A220",
 "description": "Get an exclusive Surfshark deal! Enter promo code WINGINIT for an extra 3 months free at https://surfshark.deals/winginit\n\nBreeze are a breath of fresh air! I flew from Orlando to Provo, Utah via Santa Ana in California on a \"Breeze Thru\" connecting flight, which aims to maximise aircraft use and provide guaranteed connections. So, what's it actually like? It was half the price of Delta first class for almost the same route (Delta fly to SLC, 50 miles to the north). So, what's it like? The result surprised me! \n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\nFollow me on Instagram/Threads: paul_winginit ¦ https://www.instagram.com/paul_winginit\nMerch store: https://wingin-it.teemill.com/collection/all-products/\n\n0:00 Intro\n0:46 MCO Airport and the Club @ MCO\n1:57 Breeze Ascent explainer!\n3:33 Surfshark sponsor segment\n5:14 Breeze A220-300\n6:11 Boarding Breeze Airways A220-300 in Breeze Ascent (NICEST SEAT)\n7:07 Taxi and takeoff\n8:18 Cabin and seat impressions\n9:50 Meal/snack/drink/whatever service\n11:43 Loo review\n12:25 SNA and the BreezeThru connection experience (plus a look at the cheaper seats!)\n13:50 SNA-PVU and my impressions\n14:40 Approach and landing into Provo Airport plus my conclusions and thanks!\n\nMy website: www.winginit.me\n\nDate of Travel: 3 SEP 2023\nAirline: Breeze Airways\nLivery: Breeze Airways standard livery \nRoute: MCO-SNA-PVU\nAircraft: Airbus A220-300\nFlight Number: MX 603\nMiles: 2183 + 565\nAirborne time: 7h 09m total\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "X_u8dqOCvc0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-10-24T18:03:35Z"
}