{
 "name": "VIA Rail “The Canadian” | (Part 1/2: Toronto - Vancouver)",
 "description": "Get Rosetta Stone NOW for £174.50 instead of £349 for a LIFETIME subscription. Make that investment in yourself today - which language will you learn? Click for the special discount HERE: https://bit.ly/3KZcTsp\n\n*PART 2 is NOW LIVE!* https://youtu.be/5QCLkhANEkA\n\nHere you go - here's Part 1 of 2 of my epic, FOUR DAY trip from Toronto to Vancouver on VIA Rail's Train 1, the Canadian. This is one of the world's greatest train journeys and is an essential bucket list item for any self-respecting rail enthusiast. Who knows how long the original Budd 1955 rail streamliner cars will continue in service? I am absolutely delighted I got to experience a train so classic it was listed as a historic experience back in my 1980s rail annuals I read as a young boy. There is SO MUCH MORE to come in Part 2, including the unbelievably perfect Rocky Mountain scenery as well as more details about the logistics of travelling on The Canadian. \n\nThe pandemic taught me to do things while you can - just like all the British Airways 747s disappearing overnight, the Canadian now - as of 2023 - has killjoy buffer cars behind its iconic bullet lounge. Boy, am I glad to have done this in the summer of '22 - memories to last a lifetime! \n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\nI made a Bright Trip guide to train travel : https://www.brighttrip.com/europebytrain\nMerch store: https://wingin-it.teemill.com/collection/all-products/\nPreferred VPN: https://surfshark.deals/winginit - promo code WINGINIT for discount\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit",
 "source": "youtube",
 "source_id": "rr4lp3bKTjA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-02-26T16:00:05Z"
}