{
 "name": "Flybe Full Flight | Birmingham to Berlin-Tegel | Embraer E175",
 "description": "A full length, real time full flight video in real time from Birmingham to Berlin Tegel onboard Flybe Embraer E175 G-FBJF, operating flight BE1858 on 25 November 2014.\n\nThe flight begins on the ground in Birmingham with the aircraft being de-iced on an icy morning.  We board the aircraft 20 minutes after the scheduled departure time, and once onboard are informed by the captain that due to the delay we have missed our slot into Berlin and we must wait for a further 40 minutes.  \n\nWe finally push back an hour late from the stand at Birmingham, taxying out to runway 33.  We depart to the north breaking through the thick fog within seconds, to a beautiful sunny day above.  We make a right turn towards the east coast of the UK, crossing the North Sea before heading across the Netherlands and into Germany, where thick cloud starts to develop below.  During the flight I have included some shots of the cabin and the inflight service.  We make a right turn and begin our final approach, with the landing gear coming down above the clouds, before we see the last of the sunshine and drop into the foggy day below, emerging from the cloud just a few seconds before touching down on runway 26R.  We taxi to our remote stand where today's flight ends.\n\nVideo taken from seat 21A.\n\nAirline:  Flybe\nFlight:  BE1858\nAircraft:  Embraer E-175 G-FBJF\nFrom:  Birmingham (BHX)\nTo:  Berlin Tegel (TXL)\nDeparture:  10:41\nArrival:  13:09\nFlight Time:  01:28\nSeat:  21A\nFlight Path:  http://goo.gl/xPnO22\n\nPlease enjoy the flight and feel free to subscribe/comment!\n\nGoPro Hero 3\n\n✈ ✈\nEquipment used:\n\nCamera: GoPro Hero4 Silver http://goo.gl/Wz7Uxt\nMount: Generic suction mount http://goo.gl/E2vRBs\nSwivel Mount: http://goo.gl/vWQVne\nBoya Frame Case for GoPro: http://goo.gl/tqM3H1\nBattery: Anker E7 25600mAh  http://goo.gl/ZXfxOy\nMicroSD cards: Sandisk 128GB http://goo.gl/KDjm4Y\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n\nWould you like to view my full flight videos ahead of everyone else, and support inflight Video at the same time?  Please consider supporting me on Patreon at https://www.patreon.com/inflightvideo.  Patrons get early access to all of my full length, full flight videos, as well as other perks including access to giveaways, freebies, and regular live chats to talk about what's coming soon for inflight Video!  You'll also be supporting me by allowing me to reserve seats with a good view, and access a wider range of interesting flights to film.  Thank you!\n\n✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈✈\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "ilqfp1MLVjE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-01-24T21:09:00Z"
}