{
 "name": "Atlanta (ATL) to Orlando (MCO) Full Flight Experience",
 "description": "Thanks for watching this Full Flight Experience!  In May 2017 I had the opportunity to take a research trip to the Highlands of Scotland and experience some of my favorite locales in the world!  There were plenty of opportunities for walking, exploring, and recording my discoveries, and the fun started even before I arrived.\n\nThis six-part journey continues at ATL as I traverse the world's busiest airport from end to end to catch my second flight to Orlando International Airport aboard a brand-new Airbus 321. A common hop for vacationers and excited families, I'm catching my transatlantic flight in Orlando. You can't help but feel what the kids are feeling, though: excitement and anticipation for their trip to Disney World and the other fun things to do in the heart of Florida.\n\nI've flown this leg myself on several occasions, but always as one of those happy kids. Like those kids, I'm on my way to exploration, and hope you enjoy the ride, too! I'll share some fun facts en route to our destination!\n\nThanks for flying in, and stay tuned for the upcoming legs of this journey to and from the British Isles!\n\n--------------------------------\n\nFlight Information\nAirline: Delta Airlines\nFlight Number: DAL897\nDate of Flight: Saturday, May 6th, 2017\n\nOrigin Airport: Atlanta Hartsfield/Jackson International Airport (KATL/ATL)\nDestination Airport: Orlando International Airport (KMCO/MCO)\n\nDeparting Gate: A1\nBoarding Time: 12:42 EDT\nScheduled Departure: 12:54 EDT\nActual Departure from Gate: 13:00 EDT\nTakeoff Runway and Time: RWY 9L / 13:07 EDT\n\nLanding Runway and Time: RWY 36L / 14:10 EDT\nScheduled Arrival: 02:27 EST\nActual Arrival at Gate: 02:21 EST\nArriving Gate: 73\n\n--------------------------------\n\nAircraft Information\nType: Airbus 321-200\nRegistration: N315DN \nAircraft Delivery: December 2016\nEngines: 2x CFM56-5\nSeat: 21A\n\n--------------------------------\n\nGear\nNikon D3200/18-55mm\nCanon Vixia HFM30\nEdited in Adobe Premiere Pro/IrfanView\n\nAircraft, flight information, and facts developed from Planespotters.net, flightaware.com, Google Maps, wikipedia.com, and atlairport.com. Labor statistics from sba.gov.\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "h671lAP7X-c",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-10-18T00:10:50Z"
}