{
 "name": "WestJet 767-338ER(WL) [C-FOGJ] Taxi and Takeoff from Calgary Airport ᴴᴰ",
 "description": "After nearly two months of delays due to some red tape with Transport Canada, on October 22nd, WestJet started widebody flights for the first time. It ferried to Toronto two days earlier, but my video of it wasn't as good as I would have liked, and I wasn't able to get the first flight with passengers either. it's great to see this 24-year-old bird flying with her new owner. She served Qantas and Australian Airlines for two decades as VH-OGJ before flying across the Pacific to be refitted with winglets and repainted into WestJet livery. The 767 will continue to fly Calgary-Toronto for the next few months as WestJet tries to achieve ETOPS certification in order to begin the Hawaii flights. WestJet's first example, C-FOGJ is seen here taxiing and taking off for Toronto with a great spool up. ATC is included with captions as usual, and enjoy!\n\nThanks for watching! Please comment, rate, and subscribe!\n\nFLIGHT INFO\nAirline: WestJet (WJA/WS)\nAircraft: Boeing 767-300ER\nAircraft Name: None\nLivery: Revised\nEngines: 2x GE CF6-80C2B6 \nRegistration: C-FOGJ\nRoute: YYC-YYZ\nCallsign: WestJet 668\nRunway used: 35R shortened\nLocal Time: 1320\nFlightAware: http://flightaware.com/live/flight/CFOGJ\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOfficial Website: http://www.alexpraglowski.ca\nChannel: https://www.youtube.com/dude8472productions\nFacebook: https://www.facebook.com/AlexPAviation\nInstagram: https://www.instagram.com/ap.aviationphotography\nTwitter: https://www.twitter.com/AlexPYYC\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\n© Alex Praglowski Aviation 2015\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. \n\nMEDIA: Please contact me at the email in the \"About\" section of my channel.",
 "source": "youtube",
 "source_id": "sOia8QGDzKk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-10-24T23:53:40Z"
}