{
 "name": "I Flew Around The WORLD in Business Class *During LOCKDOWN*",
 "description": "I flew around the world in business class during lockdown. This is my story...\n\nFlying around the world in previous years would be limiting just to the cost, time and energy. In 2021 however, you’re face with lockdowns, testing and entry restrictions. I’m going to share with you today how I did this, what it was like and the challenges which I faced along the way including hotel quarantine. \n\nDeparting London I flew on British Airways new A350-1000 on their Club Suites, otherwise known as Business Class. This flight over to Dubai was around 6.5 hours, allowing me time to indulge in errr their cardboard boxes meals but fantastic bedding in their suite. Arriving in Dubai I stayed at the Armani hotel (only one night through… man can’t afford $500 a night!). During my time in Dubai I went hot air ballooning, jet skiing and even drove and F1 car. \n\nNow it’s time for the next flight. Onboard Etihad’s First Class, with their 787-9 flying 15 hours over to New York. Yes I know this is mainly for Business Class… but I got an incredible deal (via Air Canada Aeroplan… more on my IG). Sadly the First Class lounge at Abu Dhabi airport is closed so I had to make do with the Business Class lounge (yes I’m being sarcastic… it’s still brilliant!). \n\nUpon arrival into NY I stayed in Chelsea but only briefly as I’m off on my next flight, JetBlue Mint’s business class bound for Las Vegas. \n\nJetBlue is in my opinion the best business class for domestic flying in the US… and I highly recommend it. Arriving into Vegas I stayed at the Venetian. After exploring a quiet vegas, it’s time to head over to the airport for my next flight. This time… over to LAX on AA First Class.. Not a huge amount to report back on this trip, so onto the next one I say! \n\nIn LAX I met up with my friend James where we went inside a private jet studio in Hollywood… yes this is a thing! After some plane spotting near in-and-out at LAX I headed inside the terminal to catch my next AA First Class flight over to Texas. \n\nI’m positioning to Texas as I’m catching a special flight from Dallas, to somewhere I’ve wanted to visit for many years… Hawaii! This is on American Airlines First Class 777-200ER. The flight time is over 8 hours which blows my mind as this is similar in flight time to London - India. \n\nUnfortunately my time in Hawaii was restricted to lockdown in my hotel room… aka hotel quarantine. This meant I was not even allowed out of my room… such a shame but a reason to go back. \n\nFrom HNL I flew for 5 hours over to San Francisco onboard Hawaiian Airlines A330 in their First Class. \n\nFrom San Francisco I met up again with my friend James. After touring some of the main tourist sights in and around the Bay Area I headed to SFO international airport. This time I’m onboard Qatar Airways A350-900 for a 15.5 hour flight over to Doha, Qatar. This aircraft features their latest QSuites so I’m able to showcase to you what these are like to fly during the current worldwide situation. \n\nBack in Doha, I stayed in the airport hotel, named the Oryx Hotel. After some rest and a shower it’s time to get onboard my next flight to London. This final flight is onboard Qatars 777-300ER which features again, their QSuite Business Class product. \n\nSo what did you think? Let me know down below in the comments. Make sure you check out my IG to follow my travels live: will.luxurytravel",
 "source": "youtube",
 "source_id": "mYLzZUgqVPU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-06-06T20:20:19Z"
}