{
 "name": "18 MINS of BIG MILITARY PLANES! Abbotsford Airshow Departures (4K)",
 "description": "The Abbotsford Airshow is the largest airshow in Western Canada, and (usually) takes place every year in August. The 2023 show had a great lineup of aircraft on static and flying display, particularly with the U.S. Air Force bringing a B-52, C-5, KC-135, and C-17, in addition to their EA-18s (not in the video) F-35s, and F-15s.\n\nI stuck around after the show the following Monday to catch some of these U.S. and Royal Canadian Air Force aircraft departing Abbotsford for their respective home bases. It's a rare opportunity (at least, here in Canada) to see so many military planes on the move in a short period of time like this, so I hope you enjoy!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\n00:00 - Introduction\n00:19 - USAF F-15 Eagle (x2) to Portland (PDX)\n02:03 - USAF B-52H Stratofortress to Barksdale AFB (BAD)\n03:55 - USAF F-35A Lightning II (x2) to Hill AFB (HIF)\n05:35 - USAF C-5M Super Galaxy to Travis AFB (SUU)\n07:55 - USAF KC-135 Stratotanker to Peoria (PIA)\n09:31 - RCAF CT-155 Hawk to CFB Cold Lake (YOD)\n10:25 - RCAF CP-140 Aurora to CFB Comox (YQQ)\n13:03 - USAF C-17A Globemaster III to McChord AFB (TCM)\n14:13 - USAF A-10C Thunderbolt II (x2) to Boise (BOI)\n16:31 - RCAF CF-18 Hornet (x2) to CFB Cold Lake (YOD)\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "siqErNxk0kM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-08-21T21:00:23Z"
}