{
 "name": "Air Greenland Airbus A330-200 in Fort McMurray, Alberta! (4K)",
 "description": "On January 27th, this Air Greenland Airbus A330 flew into Fort McMurray, Alberta, operating a charter flight for the Arctic Winter Games.\n\nThe Arctic Winter Games are a multi-sport and cultural event for Indigenous peoples living around the Arctic Circle, and have been taking place every two years since 1970.\n\nThis year, the Games are being held in the Regional Municipality of Wood Buffalo in Northeastern Alberta, with participants coming from as far away as northern Scandinavia and Greenland, hence this special flight to Fort McMurray.\n\nNow, Air Greenland and Fort McMurray are two things I never expected to say in the same sentence. They're one of the most unique airlines in the world, and their operation is fascinating.\n\nAir Greenland's A330 usually flies exclusively between Greenland and Denmark, so seeing it in Canada is an exceptionally rare event. Add Fort McMurray of all places into the mix, and you can see why I had to make the trip up from Calgary to see it!\n\nThis is one of the largest aircraft to ever land in Fort McMurray, and a 7500 foot runway plus an A330 was bound to make for quite the interesting arrival. The plane stayed overnight and left the following morning back to Greenland.\n\nEnjoy this very rare, all-red A330!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Air Greenland (GRL/GL)\nAircraft: Airbus A330-200 (A332)\nFlight Number: GL6775/GL930\nLivery: Standard\nEngines: 2x Pratt & Whitney PW4168A\nRegistration: OY-GRN\nRoute: Kangerlussuaq (SFJ) - Fort McMurray (YMM) - Kangerlussuaq (SFJ)\nCallsign: GREENLAND 6775/930 heavy\nRunway used: 08 (arrival), 26 (departure)\nDate filmed: January 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "y7OoPOu7Vms",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-01-29T15:00:37Z"
}