{
 "name": "Alberta Government WATER BOMBERS! Canadair CL-215Ts at Red Deer Regional Airport [4K]",
 "description": "As winter wraps up, aerial firefighting contractors across Canada have been preparing for the upcoming fire season. At Red Deer Regional Airport, both Air Spray and Buffalo Airways in particular have been especially busy with training flights.\n\nHowever, one new sight this season are these Government of Alberta Canadair CL-215Ts. These amphibious firefighting planes were previously operated by Conair of B.C. on contract for Alberta.\n\nBack in February though, Air Spray was awarded that contract, and will operate these planes on behalf of the Government of Alberta for at least the next 10 years (https://www.airspray.com/news/air-spray-wins-alberta-aerial-firefighting-contract).\n\nI’ve never actually managed to catch one of these on the move, so was very glad to see these two CL-215Ts going up for a training flight the other day. Enjoy these very unique-looking planes!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nOperator: Air Spray AirTankers (ASB) \nAircraft: Canadair CL-215T (CL2T)\nLivery: Alberta Government\nEngines: 2x\nRegistration: C-GFSL / C-GFSM \nRoute: Red Deer (YQF) - Red Deer (YQF)\nCallsign: AIR SPRAY 202/203 Trainer\nRunway used: 35/17\nDate filmed: April 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "z1CkZxQlUhU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-04-16T14:07:44Z"
}