{
 "name": "ALL BLACK LIVERY! Air Canada Jetz A320 at Calgary Airport (4K)",
 "description": "Back in September, Air Canada unveiled this all-black livery on one of their Airbus A320s. Fin 416, Charlie Foxtrot November Victor Victor, was first delivered to Canadian Airlines in 1994, and has been with Air Canada in some capacity since 2001. \n\nToday, this plane is part of the Air Canada Jetz fleet, operating charter flights, and this time of year, usually carrying NHL teams around.\n\nNow, this is certainly old news by now, and it has been to Calgary a couple times already. I managed to film it arriving once in October, but was waiting to get a daylight departure shot which I finally got just the other day.\n\nThis will apparently become the new Air Canada Jetz livery going forward, and it looks phenomenal, especially in sunlight! Enjoy the video!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPraglowski\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Air Canada Jetz (ACA/AC)\nAircraft: Airbus A320-211 (A320)\nFlight Number: AC7017/209\nLivery: All-Black (2023)\nEngines: 2x CFMI CFM56-5A1\nRegistration: C-FNVV\nRoute: Winnipeg (YWG) - Calgary (YYC) - Vancouver (YVR)\nCallsign: AIR CANADA 7017/209\nRunway used: 35R/35L\nDate filmed: October and December 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "VYyuL9qhH-M",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-12-24T15:00:22Z"
}