{
 "name": "DELIVERY FLIGHT! Buffalo Airways 737-300 Landing and Up Close at Edmonton Airport (4K)",
 "description": "On Thursday, August 3rd, Buffalo Airways took delivery of their very first jet aircraft - a Boeing 737-300 Freighter! \n\nThis plane marks a huge new step for the company which is famous for their fleet of classic aircraft like the Douglas DC-3, Curtiss C-46, Lockheed Electra, and more. Based in Yellowknife, Northwest Territories, Buffalo operates cargo and charter flights throughout the NWT and into Nunavut, as well as aerial firefighting.\n\nNow their cargo operation includes various contracts from UPS, FedEx, and DHL, but the majority of that freight actually comes from Buffalo’s in-house courier Buffalo Air Express.\n\nAt the moment, most of that gets trucked from Edmonton up to Hay River and then flown into Yellowknife from there. The 737 will streamline that process significantly, and the plan is to fly it every weekday between Edmonton and Yellowknife to meet this demand for next-day freight to the North. \n\nThe 737 acquisition was announced about a year and a half ago, and after a successful test flight a few weeks back, the plane was ferried from Bournemouth, UK to Edmonton. It’ll spend a few weeks here undergoing some avionics modifications before it gets its Canadian registration and enters service.\n\nOnce it arrived in Edmonton though, the plane was greeted with this water cannon salute from the Edmonton International Airport, and then brought into North Cariboo Air's hangar and opened up to the public! Buffalo, YEG, and North Cariboo all put on a wonderful event where we got a rare opportunity to poke around this newest addition to Buffalo's fleet.\n\nIt was a genuine treat to be part of this historic day and everyone involved did a fantastic job, so a huge congratulations to Buffalo Airways, and enjoy the video! \n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Buffalo Airways (BFL/J4)\nAircraft: Boeing 737-301(BDSF) (B733)\nLivery: New (2023)\nEngines: 2x CFMI CFM56-3B2\nRegistration: 2-ESKA (to be C-FBAE)\nRoute: Iqaluit (YFB) - Edmonton (YEG)\nCallsign: 2 Echo Sierra Kilo Alpha\nRunway used: 02\nDate filmed: August 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "az4ntVjE0h0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-08-04T16:30:00Z"
}