{
 "name": "FIRST VISIT! Air Canada Cargo 767 Freighter at Calgary Airport (4K)",
 "description": "On September 3rd, one of Air Canada Cargo's Boeing 767 Freighters flew into Calgary for the first time ever! Although definitely not the first visit here for this particular airplane since it previously flew for Canadian, Air Canada and later, Rouge, it is the first time one of their converted 767s has been here.\n\nBack at the end of 2020, Air Canada announced that they'd convert a couple of their retired 767s to freighters given the demand for air cargo at the time. Since then, they're now up to 6 operating 767 Freighters, including two brand new ones! By extension, this is also the first time one of their 767s in the new livery has been here, which, I have to say, looks so sharp!\n\nThis one was here bringing show jumping horses for the annual Spruce Meadows Masters event that takes place just south of Calgary. It arrived from Toronto on Sunday afternoon and then left about 3 hours later heading back there. \n\nIt's worth mentioning that one of the 767s with winglets showed up the next day but unfortunately in darkness. Hopefully these won't be the only times we get to see these planes! Enjoy the video!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nAirline: Air Canada Cargo (ACA/AC)\nAircraft: Boeing 767-38E(ER)(BDSF) (B763)\nFlight Number: AC7296/7297\nLivery: New (2017)\nEngines: 2x General Electric CF6-80C2B6F\nRegistration: C-GDUZ\nRoute: Toronto (YYZ) - Calgary (YYC) - Toronto (YYZ)\nCallsign: AIR CANADA 7296/7297 heavy\nRunway used: 35R\nDate filmed: September 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "6JMC4R3fcy8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-09-06T21:00:03Z"
}