{
 "name": "MILITARY AIRPLANES ONLY! KC-135, A400M, C-17, C-130 at Halifax Stanfield (YHZ)",
 "description": "Back at the start of June, quite a few interesting military aircraft paid a visit to Halifax Stanfield International Airport in Nova Scotia, Canada! This included up to 6 KC-135s from the U.S. Air Force, plus some other aircraft from the Royal Air Force and Italian Air Force too. \n\nThe KC-135s were apparently doing a training exercise in the Gulf of St. Lawrence, but the others were likely just transiting through Halifax. Still very glad to have seen all of this action - this is the first time I've been able to film a KC-135 in flight!\n\nI happened to be there in early June doing some plane spotting, and compiled all of the military stuff I saw into this video! Hope you enjoy this rare military action!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\n00:00 - USAF KC-135R Stratotanker landing\n00:40 - Italian Air Force C-130 to Keflavik (KEF)\n01:57 - Royal Air Force A400M from Brize Norton (BZZ)\n03:07 - Royal Canadian Air Force CP-140 touch and go\n03:53 - USAF KC-135R Stratotanker landing and taxiing\n05:48 - Royal Air Force C-17 to Brize Norton (BZZ)\n09:05 - USAF KC-135R Stratotanker landing and taxiing\n11:56 - USAF KC-135R Stratotanker takeoff\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "plkSyC2HzBQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-07-12T21:00:32Z"
}