{
 "name": "U.S. Air Force B-52 Stratofortress SCREAMING Takeoff from Abbotsford Airport!",
 "description": "This past weekend, the U.S. Air Force sent one of their B-52 Stratofortresses to the Abbotsford Airshow in British Columbia. \n\nThe Abbotsford Airshow typically has a great line-up of aircraft on static display, and this was the first time a B-52 had been here in a couple of years. These jet bombers have been in service with the U.S. Air Force since 1955, and have been, quote, the backbone of the country's strategic bomber force.\n\nPowered by 8 Pratt and Whitney TF33 engines, these slightly newer B-52H models are the last variant still in service. This particular B-52 was built in the early 1960s and is based at Barksdale Air Force Base in Louisiana. It stayed on static display for all three days of the show and then left early on Monday morning heading back home. \n\nI've never had the chance to see a B-52 flying for myself, so wanting to hear these classic engines before they eventually get replaced with much quieter ones, I made the trip over from Calgary to see it depart after the show!\n\nEnjoy this spectacularly loud departure!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nOperator: United States Air Force (USAF) \nAircraft: Boeing B-52H Stratofortress (B52H)\nLivery: Standard\nEngines: 8x Pratt & Whitney TF33-P-3\nRegistration: 60-0011\nRoute: Abbotsford (YXX) - Barksdale AFB (BAD)\nCallsign: SCOUT 99\nRunway used: 07\nDate filmed: August 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "EL32klF6asc",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-08-19T14:00:18Z"
}