{
 "name": "WORLD'S LARGEST SINGLE-ENGINE BIPLANE! Antonov An-2 at Springbank Airport",
 "description": "The Antonov An-2 is a Soviet-era utility biplane that was produced from the late 1940s all the way until 2001. Thanks to its rugged design, short takeoff and landing capability, and highly adaptable airframe, over 18,000 of these planes were built. That said, they're not a super common sight in North America.\n\nFor the past couple of years though, two of these planes have been based out of Springbank Airport just west of Calgary. This is where the story gets interesting!\n\nBoth of these planes are owned by a company called \"2Solitude\" (https://www.2solitude.com), which retrofits An-2s and turns them into, basically, flying RVs!\n\nOne of them is privately operated and has a full interior with a kitchen and everything, sitting on the world's largest composite floats! The other one is a test bed for a turboprop conversion, swapping out the original radial engine for a Honeywell TPE331-12 turbine. This one too, will get its own set of floats eventually.\n\nThe final result is, to paraphrase the company's website, \"a bush plane that is your camp\".\n\nOn Saturday, the turbine one went up for a couple of circuits, and I took the opportunity to finally catch this rare Soviet biplane in action. A big thank you to the 2Solitude team for letting me take a look around the planes, too! Enjoy the video!\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nThank you to RadarBox for supporting the creation of plane spotting videos on this channel! Find out more about them at https://www.radarbox.com/?referrer=AlexAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nBecome a Channel Member:\nhttps://www.youtube.com/channel/UCN1SQ1Ffsm_13OQu7MwHXbA/join\n\nWebsite: https://www.alexpraglowski.ca\nInstagram: https://www.instagram.com/alexpraglowskiaviation\nTwitter: https://www.twitter.com/AlexPraglowski\nFacebook: https://www.facebook.com/AlexPAviation\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nFLIGHT INFORMATION\nOperator: 2Solitude\nAircraft: Antonov An-2R (AN2)\nLivery: \"Russian Bare\"\nEngines: 1x Honeywell TPE331-12\nRegistration: N73AN\nRoute: Springbank (YBW) - Springbank (YBW)\nCallsign: Antonov November 73 Alpha November\nRunway used: 35\nDate filmed: July 2023\n\n-=-=-=-=-=-=-=-=-=-=-=-\n\nOutro song - \"Take Flight\" by Nyhtian: https://youtu.be/bCTTwQ_269c\n\n© Alex Praglowski Aviation 2023\n\nThis video is the property of Alex Praglowski Aviation and may not be used for any purpose without prior permission. Contact me at the email in the \"About\" section of my channel for usage.",
 "source": "youtube",
 "source_id": "j-Zqg5uZbsM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-07-23T14:00:23Z"
}