{
 "name": "What Happens in an Emergency Landing and What To Do Next",
 "description": "This started off just like any other flight.  Then it changed and before long we were back where we started but landing under full Emergency Landing conditions. \n\nWhat Happens in an Emergency Landing and What To Do Next\n\nThis is the full story of my journey on Sri Lankan Airlines Flight UL605 from Melbourne to Colombo. Only 30 minutes out of Melbourne there was the smell of burning and smoke filled the back of the cabin. \n\nWhat happened next is a text book example of how well the aviation industry is trained for these types of emergency events.  In this video I cover the full story - how things where handled by the flight and cabin crew - what happened at the airport to prepare for our landing - what happened when we landed - and then I cover exactly what happened next as Sri Lankan Airlines handled 250 disrupted passengers. \n\nThroughout the process I explain it from a passenger perspective but also as someone who works in the travel industry and has been actively involved in crisis management for many years.  I'll tell you what was happening behind the scenes. \n\nThen as each step unfolds I'll give you handy hints and tips so that if you find yourself in this situation you know exactly what to do to make it easier and less stressful. \n\nIntertwined within this story is a full Sri Lankan Airlines business class flight review which I happened to be filming when the drama unfolded.  So not only do we get to see what Sri Lankan Airlines business class is like these days but was also get to see how they handle things when things go wrong. \n\nIt's a fascinating story of the Sri Lankan Airlines Emergency Landing of flight UL605 at Melbourne Airport and what happened next. I hope you enjoy the video. \n\nThanks for watching and, as always, happy travels. \n\nDennis\n\n#emergencylanding #srilankanairline #aviation\n00:00 Introduction\n01:09 Qantas First Class Lounge\n01:51 Boarding\n02:46 Taxi & Take Off\n03:35 Smoke in the Cabin\n04:31 Emergency Declared!\n05:47 Crisis Management Experience\n06:16 Emergency Landing\n07:51 Disembarkation\n08:30 Disaster Strikes My Duty Free\n08:48 Airport Chaos\n10:59 I'm on Channel Nine News\n11:33 Time to Move Quickly - Flight Rescheduling\n12:36 Back at the Airport\n13:23 Malaysian Airlines to KL\n14:27 Malaysian Airlines to Colombo\n14:47 Welcome to Sri Lanka\n15:21 Back at the Airport Again\n16:03 UL - Usually Late!\n17:04 Boarding\n17:42 Sri Lankan Business Class Review\n20:06 The Verdict - my reflections on Sri Lankan Airlines\n21:13 Landing in Melbourne Again\n22:30 And Finally - what happened to our aircraft",
 "source": "youtube",
 "source_id": "Utmk8XuNy10",
 "type": "Flight",
 "company": "Sri Lankan Airlines",
 "stops": ["MEL"],
 "postdate": "2024-02-24T22:00:13Z"
}