{
 "name": "Atlanta to Denver Full Flight on an Updated Boeing 757",
 "description": "Thanks for watching this Full Flight Experience!  This is the second in a series of four flight experience videos relating to my trip to Denver with my wife Beth.  We went for our wedding anniversary and, until the day of our trip, she had no idea where we were going; it was a complete surprise!  Follow our journey from our home airport in Louisville, Kentucky to Denver, Colorado and back over an exciting weekend of travel and exploration!\n\nThis second video covers our flight aboard a recently updated Boeing 757 from Atlanta to Denver.  We had pleasant weather for our morning flight, with some great views of the high plains and Front Range before touching down in Colorado.  \n\nThanks again for watching, and enjoy!\n\nFlight Information\nAirline: Delta Air Lines\nFlight Number: DAL1382\nDate of Flight: Thursday, October 29, 2015\n\nOrigin Airport: Atlanta Hartsfield-Jackson International Airport (KATL/ATL)\nDestination Airport: Denver International Airport (KDEN/DEN)\n\nDeparting Gate: B7\nScheduled Departure: 09:40 EDT\nActual Departure from Gate: 09:39 EDT\nTakeoff Runway and Time: RWY 26L / 09:54 EDT\nLanding Runway and Time: RWY 16L / 10:39 MDT\nScheduled Arrival: 11:04 MDT\nActual Arrival at Gate: 10:54 EDT\nArriving Gate: C40\n\nAircraft Information\nType: Boeing 757-232\nRegistration: N685DA\nAircraft Delivery / Update: March 1995 / March 2015\nEngines: 2x Pratt & Whitney 2037\nSeat/s: 31A & 31B\n\nVideo Highlights and Timeline\n01:40 - OUTBOUND TAXI\n04:20 - TAKEOFF\n10:30 - SHORT FINAL AND LANDING\n\nTechnical Specs\nCamera: Nikon D3200 with 18-55mm lenses\n\nA big thanks to my wife Beth as my assistant (and often primary) cameraperson throughout the journey!\n\nThis video is the sole property of www.milesbyfoot.com.  Any unauthorized use of the video or audio content from this video is prohibited.  If you'd like to use any portion of this video, please e-mail me at milesbyfoot@gmail.com and I'll be happy work with you!",
 "source": "youtube",
 "source_id": "CnP2ZVLfqHE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2015-11-30T13:07:55Z"
}