{
 "name": "Getting Around Atlanta International Airport (ATL) - Complete Airport Guide and Tour",
 "description": "Thanks for joining me on this guide to Hartsfield-Jackson Atlanta International Airport! This world-famous airport connects more passengers to their next flight than any other airport on Earth, and if you're planning to pass through here, this guide's for you! This airport serves the great city of Atlanta, Georgia, but as the primary hub of Delta Air Lines, it's also a place to connect to flights all around the world. Most other major American airlines have a large presence here, too. In short, it's where America comes to fly!\n\nI do a lot of original research while preparing these videos, so please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about ATL! The contents of this video are accurate as of their publication in December 2023, but may be subject to change permanently or temporarily without notice.\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every few weeks!\n\nPlease travel safely!\n\nThe contents of this video and its production are not endorsed by any private or public entity portrayed therein, and none of those entities provided any input or compensation in the production of this video. All material provided in this video is subject to change, permanently or temporarily, without notice.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnails illustrated by my artist wife, Beth! This one features the eastern tiger swallowtail, Georgia's state butterfly.\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n01:30 - Airside Terminal Overview\n02:30 - Connecting on Delta: Concourses A, B, C, D, and Plane Train\n03:50 - Concourse E (Delta and Short-Haul International)\n04:35 - Concourse F (Long-Haul International)\n05:25 - Concourse T (Non-Delta Domestic and Delta)\n06:15 - American, United, Spirit, Frontier, jetBlue, Alaska, and Southwest\n07:45 - Delta Destinations and Sky Clubs\n08:35 - Art at ATL\n09:20 - Planespotting at ATL\n10:05 - Overnight at ATL\n10:40 - Arriving at ATL and Ground Transportation (MARTA Light Rail/Rental Cars)\n12:10 - Conclusion\n13:40 - End Screen\n\nThanks again for watching, and keep moving forward!\n\n#atlanta #atl #aviation #travel #airport #deltaairlines  \n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nCanon Vidia\nNikon D3200\nClip Studio Paint\nAdobe Premiere Pro\nTechSmith SnagIt\nIrfanView\nAudacity\n\nMusic\nCave In - Giants' Nest\nFlower Burst - Giants' Nest\nEvening Mood - Sum Wave\nInnuendo - Phello\n\nSources\ndelta.com\nunited.com\namerican.com\nwikipedia.com\natl.com\nflyfrontier.com\nfaa.gov\nflightaware.com",
 "source": "youtube",
 "source_id": "VFmyZOhYJNw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-12-19T16:00:18Z"
}