{
 "name": "Getting Between Dallas's and Houston's Airports - Bus/Train/Transit Experience (DFW - DAL/IAH - HOU)",
 "description": "Thanks for joining me for a unique adventure as we connect between Texas's busiest airports in Dallas and Houston!\n\nToday's video covers what you need to know when you have to get between Bush Intercontinental and Houston Hobby, as well as from Dallas Love Field to Dallas Fort Worth International Airport and back!\n\nThe information provided in this video is accurate and current both when I recorded this in October 2021, as well as at the time of upload in June 2022. Prices and routing are subject to change, so double check the websites for each transit authority if it's been a while since this video!\n\nCheck the chapters if you're interested in something specific!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every two weeks!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n00:30 - Houston Transit (IAH - HOU)\n02:20 - Houston Transit (HOU - IAH)\n03:10 - Dallas Transit (DAL - DFW)\n04:15 - Dallas Transit (DFW - DAL)\n05:15 - Conclusion\n06:00 - End Screen\n\nThanks again for watching, and keep moving forward!\n\n#dallas #dfw #dfwairport #airport #aviation #travel #dal #iah #houston #hou #publictransport #train #bus  \n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nNikon D3200 (18-55/55-200mm)\nFeiyuTech G6 Gimbal\nAdobe Premiere Pro\nIrfanView\n\nridemetro.org (Houston Metro Bus)\ndart.org (Dallas Light Rail)",
 "source": "youtube",
 "source_id": "RnTQjEDa3l8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-06-05T16:00:09Z"
}