{
 "name": "Getting Around Indianapolis International Airport - Complete Airport Tour",
 "description": "Thanks for joining me on this tour of Indianapolis International Airport! Today's tour covers the busiest airport in Indiana, which provides service to dozens of destinations in the United States, Mexico, and Canada. Indianapolis's central location makes it a nexus of travel for world-famous sports and cultural events, so this airport needs to function efficiently while not being too large to overwhelm visitors!\n\nIND is an award-winning airport for a number of reasons, and I hope my video shows you the ease with which you can transit through, and the things you can do while you're here! See both terminals, how to get around, and where to find what you need during your time at IND!\n\nI do a lot of original research while preparing these videos, so please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about IND!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every weekend!\n\nPlease travel safely!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of those entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnails illustrated by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n01:00 - Airlines & Destinations\n01:10 - American\n01:30 - Delta\n01:50 - Southwest\n02:30 - United\n03:00 - Allegiant\n03:20 - Frontier & Spirit\n03:35 - Alaska & Air Canada\n03:50 - Contour\n04:00 - Landside Terminal \n04:35 - Airside Concourses\n05:35 - Lounges (Delta & USO)\n05:50 - Arriving at IND & Ground Transportation\n06:20 - Service Awards\n07:10 - Conclusion\n07:50 - End Screen\n\nThanks again for watching, and keep moving forward!\n\n(This video was recorded in March 2022, before the federal mask mandate was lifted for air travel.)\n\n#indianapolis #indy #aviation #airport #travel \n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nNikon D3200\nClip Studio Paint\nAdobe Premiere Pro\nTechSmith SnagIt\nIrfanView\nAudacity\n\nMusic\nDrinks on You - Andre Aguado\nSummer Haze - Andre Aguado\n\nSources\ndelta.com\nunited.com\naa.com\nflyfrontier.com\nallegiantair.com\nspirit.com\nsuncountry.com\ncontourairlines.com\nalaskaair.com\naircanada.com\nsouthwest.com\nwikipedia.com\nind.com\nfaa.gov",
 "source": "youtube",
 "source_id": "4XWdHWzAOns",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-07-03T16:30:00Z"
}