{
 "name": "The Ultimate ASMR Airport Walk - Chicago O'Hare (ORD) Walking Tour - No Music No Interruptions!",
 "description": "Thanks for joining me for another ambient airport walk; this time, we're walking through the incredible Chicago O'Hare, one of the busiest airports in the world! \n\nUnlike other tours I do, this one covers every terminal as I explore it; no music, no narration, no interruptions! \n\nWhether you want to see the detailed layout of this airport, you're curious about what's around the corner, or you want to relax to the sights and sounds of travel, I hope you enjoy this video and those to come! \n\nPlease comment and tell me what you liked or didn't like about this video. Do you like more annotations as we walk? Maybe better footage of the art and exhibits? Is metadata interesting to you, like the time of the walk, direction, distance walked, etc.? \n\nCheck the chapters if you're interested in something specific!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every two weeks!\n\nThis video was recorded in March 2022, before the federal mask mandate was lifted for air travel.\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n00:25 - Concourse B\n16:30 - B/C Tunnel\n19:45 - Concourse C\n30:45 - Terminal 1 Spotting\n31:40 - Terminal 2 (E/F)\n45:40 - Terminal 2 Spotting\n46:30 - Concourse G\n52:15 - Concourse G Spotting\n52:35 - Terminal 3 (H/K)\n1:09:15 - Concourse H/K Spotting\n1:10:15 - Concourse L\n1:19:35 - Concourse L Spotting\n1:20:20 - ATS to Terminal 5\n1:23:00 - Terminal 5 Landside\n1:23:50 - Concourse M\n1:44:25 - Concourse M Spotting\n1:45:30 - Terminal 1 Landside\n1:48:15 - Terminal 2 Landside\n1:50:05 - Terminal 3 Landside\n1:53:45 - Rental Car Center\n1:55:18 - End Screen\n\nThanks again for watching, and keep moving forward!\n\n#chicago #ohare #airport #aviation #ambient #travel  \n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nNikon D3200 (18-55/55-200mm)\nFeiyuTech G6 Gimbal\nAdobe Premiere Pro\nIrfanView",
 "source": "youtube",
 "source_id": "chbm65oLVQM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2023-03-11T16:00:18Z"
}