{
 "name": "Washington National Airport - DCA - 4K Airport Tour",
 "description": "Thanks for joining me on this airport tour of Ronald Reagan Washington National Airport, now in 4K! Today's tour covers one of the three airports serving the country's capital, and it's the oldest, closest, and potentially most interesting of the three. \n\nAs a hub for American Eagle, DCA provides service to dozens of destinations around the country. Security regulations limiting the distance planes to and from DCA can travel, along with the frequent, shuttle-style service provided to the airport give it a unique destination profile.\n\nI try to cover what I can in a short video, but I'm sure there are things I've missed; please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about DCA!\n\nFinally, let me know where you'd like to see next! Now that I've been vaccinated, I'm able to travel with more confidence. Stay tuned for new flight and airport videos every two weeks!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nThumbnail by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n01:00 - American Airlines Terminals\n02:20 - JetBlue Terminal\n02:35 - Alaska, United, Delta Terminal\n03:05 - Air Canada, Frontier, Southwest Terminal\n03:30 - DCA's History\n03:55 - New Checkpoints\n04:10 - Metro Connection\n05:10 - Conclusion\n\nThanks again for watching, and keep moving forward!\n\n#airport #airporttour #dca #reagan #washingtondc #aviation #travel\n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nClip Studio Paint\nAdobe Premiere Pro\nIrfanView\nAudacity\n\nMusic\nMetro - Ealot\n\nSources\nflyreagan.com\nflightaware.com\naa.com\nunited.com\ndelta.com\nflyfrontier.com\njetblue.com\nsouthwest.com\naircanada.com\nalaskaair.com\nwikipedia.com\nvirginiaplaces.org\n\nHistoric photos of DCA by Jack Delano\nPhoto of Franklin Roosevelt in the public domain",
 "source": "youtube",
 "source_id": "aIm6vr1V5Bs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-09-26T17:02:00Z"
}