{
 "name": "18 HOURS 🤯 in Singapore Airlines BUSINESS CLASS! (Singapore-Tokyo-Los Angeles)",
 "description": "Download EXMO now and save LOADS on trading commissions!* http://bit.ly/EXMO_Paul_Lucas\n\nWATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8 \n\nThis is the LAST pre-pandemic video I have! And boy was this a mega flight... 18 hours on a DIRECT flight with a stop in Tokyo (don't worry, it's all explained!). I can absolutely recommend Singapore Airlines' business class if it's luxury and personal service you're after...and WOW, does their Book the Cook feature seriously impress or what?\n\nMerch store: https://teespring.com/stores/wingin-it-3\n\nFollow me on Stereo: paullucas ¦ https://stereo.com/paullucas\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nSanrizuka Struggle article: https://simpleflying.com/sanrizuka-struggle/\n\nDate of Travel: 10 MAR 2020\nAirline: Singapore Airlines\nLivery: Singapore Airlines standard\nRoute: SIN-NRT-LAX\nAircraft: Boeing 777-300ER\nFlight Number: SQ 12\nMiles: 3324 + 5451\nAirborne time: 6h55m + 9h45m\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***\n\nMerch store: https://teespring.com/stores/wingin-it-3\n\n*EXMO has been given Temporary Registration to carry out crypto-asset activities.",
 "source": "youtube",
 "source_id": "8D8C-LGci3k",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-05-20T14:00:42Z"
}