{
 "name": "Aer Lingus AERSPACE Review on the GORGEOUS A321LR: what is it like???",
 "description": "Get Surfshark VPN at http://surfshark.deals/winginit - Enter promo code WINGINIT for 83% off and THREE EXTRA MONTHS for free!\n\nWATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nWelcome aboard Aer Lingus' new-ish European premium product, AerSpace. They don't market this as a business class and...it's sort of confusing...especially during the pandemic! But it was still a great experience and the A321LR is a super piece of kit I'd love to fly on to the States when it reopens for British travellers!\n\nMerch store: https://teespring.com/stores/wingin-it-3\n\nFollow me on Stereo: paullucas ¦ https://stereo.com/paullucas\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nDate of Travel: 9 JULY 2021\nAirline: Aer Lingus\nLivery: Aer Lingus standard Eurowhite livery\nRoute: DUB-LHR\nAircraft: Airbus A321LR\nFlight Number: EI 154\nMiles: 279\nAirborne time: 0h55m\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***\n\nMerch store: https://teespring.com/stores/wingin-it-3",
 "source": "youtube",
 "source_id": "xPfqaVI5eSs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-07-24T16:36:57Z"
}