{
 "name": "Flying the TWIN OTTER | Campbeltown-Glasgow | Scenic Mull of Kintyre flight!",
 "description": "Get Surfshark VPN at http://surfshark.deals/winginit - Enter promo code WINGINIT for 83% off and THREE EXTRA MONTHS for free!\n\nBritain is back out of lockdown! And my first trip was to...the Mull of Kintyre, taking in the shortest standalone flight on the island of Great Britain (alright, yes, Papa Westray-Westray is shorter but not technically on the island of GB, and you can still book Glasgow-Edinburgh too but that's a technical stop rather than a standalone route so...hey, everyone needs clickbait!). Enjoy the video, from a beautiful part of the world.\n\nMerch store: https://teespring.com/stores/wingin-it-3\n\nFollow me on Stereo: paullucas ¦ https://stereo.com/paullucas\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nDate of Travel: 28 APR 2021\nAirline: Loganair\nLivery: Loganair Saltire livery\nRoute: CAL-GLA\nAircraft: BHC-6-400 Twin Otter\nFlight Number: LM 444\nMiles: 58 \nAirborne time: 0h25m\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***\n\nMerch store: https://teespring.com/stores/wingin-it-3",
 "source": "youtube",
 "source_id": "4tOi9PU6tFU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-05-31T13:44:31Z"
}