{
 "name": "The world's MOST UNIQUE Airport...has disappearing runways",
 "description": "Get Surfshark VPN at http://surfshark.deals/winginit - Enter promo code WINGINIT for 83% off and THREE EXTRA MONTHS for free!\n\nI hope you've enjoyed my pandemic trips in the UK - I've really enjoyed my domestic travels AND I am pleased to say I am posting this video from Europe where I've filmed six fabulous videos. Flying is back! And so am I - next month I head to Mexico and the United States where I have no less than 31 (THIRTY ONE!) videos lined up to film featuring everything from crazy Mexican budget carriers to the USA's shortest flight, mega Amtrak trips, some luxury business class long haul, two brand new American carriers and  of course, JetBlue's new transatlantic route to London!\n\nPlease do enjoy this trip to Barra and I hope you like the slightly vloggy style of video, which I have done as a bit of a one-off. You should definitely get yourself out to the Scottish islands if you get a chance!\n\n0:00 Introduction\n1:26 Lomond Lounge\n3:02 What makes Barra UNIQUE then?\n5:50 Boarding\n8:51 Takeoff from Glasgow\n11:33 UNIQUE beach landing at Barra\n13:30 Rainy\n14:35 Takeoff of the return flight to Glasgow\n15:16 Exploring the area and Eoligarry beach\n19:34 Boots meal deal highlights\n21:50 Barra airport in detail\n25:18 Leaving for Glasgow again - takeoff\n\nMerch store: https://teespring.com/stores/wingin-it-3\n\nFollow me on Twitter: @paul_winginit ¦ https://twitter.com/paul_winginit\n\nFollow me on Instagram: paul_winginit ¦ https://www.instagram.com/paul_winginit\n\nMy website: www.winginit.me\n\nDate of Travel: 4 AUG 2021\nAirline: Loganair\nLivery: Scottish Saltaire livery\nRoute: GLA-BRR\nAircraft: Twin Otter\nFlight Number: LM 456\nMiles: 139\nAirborne time: 1h01m\n\nJoin me on PATREON where you'll get perks like AD-FREE EARLY ACCESS viewing of all my trip report videos, my tips and tricks for hacking fares, my \"best of the month\" airfare rundown, and MORE...support me: https://www.patreon.com/winginit\n\nIf you want to find out more about my future plans and join in conversations I have about travel, follow me on Twitter: @paul_winginit. \n\nMake sure you have your notifications set! 🛎 \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel!\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains\n\n♫ I use Epidemic sounds; give it a try: http://share.epidemicsound.com/paulwinginit\n\n***DON’T FORGET TO SUBSCRIBE!***\n\nMerch store: https://teespring.com/stores/wingin-it-3",
 "source": "youtube",
 "source_id": "kZNprhKtJlk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-09-24T12:21:11Z"
}