{
 "name": "AIR NOSTRUM (for Iberia Regional) CRJ1000 Trip Report: Malaga to Madrid",
 "description": "Special thanks to my incredible $5+ Patrons: \n \nHenry Bollington\nAbby Fitzpatrick \nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nRobert Livingston\nRami A\nYasseen\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: AUGUST 2017\nAirline: AIR NOSTRUM for IBERIA REGIONAL\nAircraft: CRJ-1000\nLivery: Iberia Regional with “Vigo” special vinyls     \nRoute: AGP-MAD\nTail number: EC-MJO\nMiles: 267\nAirborne time: 0h58m\nNotes: None\n\nThanks for finding my video and pressing play! \n\nOne of my absolute pet hates with aircraft is when seats don’t line up with windows! I fell victim to this on this flight and had to crane my hand to film out of the window...occupational hazard I guess. \n\nThis is a short flight on a regional jet - a CRJ1000 - from Malaga to Madrid. It was scorching that day, and in case you’re wondering why I’m introducing the video wearing a jacket, it’s because the air con at Malaga airport was turned right up to 11!\n\nThe gap between so called full service airlines and budget carriers gets ever narrower. Nothing came free on this flight despite being a top tier Oneworld Emerald member. My view is reinforced that status is a game the customer doesn’t usually win and that’s partly why I’m stepping out of that game to fly with whoever I fancy. Lounge access was welcome - though I could have got in using my Priority Pass as well!\n\nEnjoy the report. \n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek \n\nMusic courtesy of Ikson\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "5Eo5BwqCQwg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-29T04:00:40Z"
}