{
 "name": "AIRBUS A220 - my new favourite aircraft! SWISS INTERNATIONAL, Zurich - London City",
 "description": "WATCH: AZUMA: Britain’s NEW high speed train: https://youtu.be/Y8ti6V73F0c \n\nSpecial thanks to my incredible $5+ Patrons: \n \nHenry Bollington\nAbby Fitzpatrick \nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nRobert Livingston\nVista Aviation\nAlly Mullins\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: NOVEMBER 2017\nAirline: SWISS INTERNATIONAL AIRLINES \nFlight #: LX456\nAircraft: Bombardier CS-100\nLivery: Swiss standard livery    \nRoute: ZRH-LCY\nTail number: HB-JBC\nMiles: 472\nAirborne time: 1h24m\nNotes: First flight on a C Series aircraft \n\nThanks for finding my video and pressing play!\n\nWoah, the C-Series is a great aircraft. \n\nThis was my first ever flight on one. I wasn’t really sure I’d like it. I don’t like any other Bombardier aircraft - I find the CRJ series natty and poorly built and I have an aversion to the Dash 8 which is an aircraft that’s never really inspired my confidence. \n\nBut the C-Series is different. It’s a wonderful, airy, pleasant ambience. And not to mention quiet. This was a perfect winter midday flight. Glassy smooth with good views from the large and nicely shaped windows. It was one of those flights that made me happy to be alive, just cruising around in the blue sky in a shiny new aircraft. \n\nBuild quality in the aircraft felt solid. Everything got a little pull or a knock from me to check it was nicely built. I liked the tray table apparatus which secures your tray from being moved when the person in front reclines. That’s thoughtful. I also really appreciate the extra width the cabin offers over the Embraer regional jets (which are excellent, EXCELLENT aircraft by the way). \n\nI very much hope the C-Series is a commercial success. It’s a simple but impressive piece of kit...and of course, it operates into my favourite UK airport - London City. \n\nI have lots of videos coming out, including in midweek in the run up to New Year. Make sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nTea Boy - Monday \nCjbeards - Seashore \n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "QCv7SYn-v1Q",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-15T07:06:41Z"
}