{
 "name": "American Airlines 777-200 International Business Class (Domestic First): Dallas Fort Worth - Miami",
 "description": "Special thanks to my $5+ Patrons: \n\nChristoph H \nAlly Mullins\nHenry Bollington \nNathan Rubenstein\nAbby Fitzpatrick \nNeil Smith \n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: 16 JULY 2017\nAircraft: Boeing 777-200\nTail: N768AA\nLivery: AA standard plain grey \nRoute: DFW-MIA\nWeather on Departure: Scattered clouds, winds calm \nWeather on Arrival: Scattered clouds, winds calm \nAirborne Time: 2h22\nMiles: 1120\nRemarks: None\n\nThanks for finding my video and pressing play! \n\nOne of the great things about domestic flights in the USA is the chance to fly widebody aircraft on some routes. DFW to MIA is one of those, and AA operate 777s on this route on a couple of flights a day. \n\nWhile this was marketed as AA Domestic First, the trip takes place in the 777's International Business cabin. AA has a great product here and there is plenty of storage and space within the seat. Food has also improved on AA with a decent meal being provided (you can pre order on AA.com, which is very welcome). AA also invited me to \"Flagship Dining\" in the Admirals Club as their Flagship Lounge is under construction at DFW. You don't normally get access to any lounges flying in Domestic First, but as I am a BA Gold member (until that runs out!), I was allowed in. \n\nEnjoy the report. \n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek \n\nMusic courtesy of Czech Vibes Sound\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "APVihS2jiQw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-08-20T07:25:25Z"
}