{
 "name": "BRITISH AIRWAYS FIRST CLASS Flight, Boeing 777-200 - Houston to London!",
 "description": "WATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nMusic: Ehrling - Sthlm Sunset, Bonus Points - Brunch for Two\n\nSpecial thanks to my $5+ Patrons: \n\nChristoph H \nHenry Bollington \nAbby Fitzpatrick \nNeil Smith \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: 23 JULY 2017\nAirline: BRITISH AIRWAYS\nAircraft: Boeing 777-200\nLivery: BA Standard with crest    \nRoute: IAH-LHR\nTail number: G-YMMJ\nMiles: 4830\nAirborne time: 9h11m\nNotes: 12F longhaul cabin \n\nThanks for finding my video and pressing play! \n\nBritish Airways have one of the most accessible, but least aspirational First Class products on the market. My return fare (Stockholm-London-Houston and return) cost a shade under £1000, in business class - I upgraded into First using Avios. \n\nThis will be the last in a series of videos featuring BA First Class. That said, my flight was very pleasant, despite the obvious corner-cutting now endemic at British Airways. I’ve just spent the last of my Avios on a Cathay Pacific First Class ultra long haul between Hong Kong and JFK, and that will mark the end of my relationship with BA and Avios. \n\nGoing forward there will be a lot more focus on non-aligned and unusual airlines. \n\nIn this video though, enjoy the simple pleasure of travelling smoothly and calmly across the Atlantic, with three course meals and a flat bed. \n\nEnjoy the report. \n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #boeing \n\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "rYQyB27HOL8",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-07T23:31:57Z"
}