{
 "name": "BRITAIN’S BEST TRAIN: The GWR Pullman service “Royal Duchy” - London to Cornwall",
 "description": "WATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nSpecial thanks to my incredible $5+ Patrons: \n\nChristoph H \nHenry Bollington\nAbby Fitzpatrick \nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nThanks for finding my video and pressing play! \n\nThis is, in my opinion, Britain’s best public train. With a full service Pullman restaurant, a first class carriage, classic HST diesel haulage and a trip into England’s riviera county, Cornwall, this is the real deal. This one’s called the Royal Duchy after the Duchy of Cornwall (the Duke himself is Prince Charles). \n\nThe only thing that could make this trip better was the weather! We start at Paddington and wend our way down the Great Western Main Line, past Exeter, the Dawlish sea wall, and Plymouth, and crossing the most iconic railway bridge in England - Brunel’s magnificent Royal Albert Bridge. \n\nMy journey took me to Newquay so I alighted here at Par for the branch line to take me there. The cost of the ticket? £38.00 in first class. The meal in the Pullman car? Well that was more than the ticket! Well worth it though and I STRONGLY recommend you take this train or another of GWR’s Pullmans (all the Pullman trains are here: https://www.gwr.com/plan-journey/journey-information/on-board/pullman-dining) if you can manage it. \n\nEnjoy the report. \n\nOh, here’s the Realtimetrains link (it’s free to use and totally awesome): http://www.realtimetrains.co.uk\n\nPS: as a couple of you have pointed out, that's not the Dart river, but the Plym. My mistake!\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nGWR CLASS 800, THE NEXT GENERATION: https://m.youtube.com/watch?v=AvRmOOqi4FM\n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #trains\n\nMusic courtesy of Philip E Morris and Kronicle\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "TCHiaHQMeQI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-10-22T21:33:42Z"
}