{
 "name": "FIRST DAY! BMI Regional, City of Derry - London Stansted, Embraer 145",
 "description": "Fancy being a Patron? https://www.patreon.com/paulstripreports\n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: 02 MAY 2017\nAircraft: Embraer E-145\nTail: G-RJXC\nLivery: BMI Regional standard\nRoute: LDY-STN\nWeather on Departure: Partially cloudy, winds 15kts\nWeather on Arrival: Overcast, winds 25kts\nAirborne Time: 1h11m\nMiles: 374\nRemarks: Inaugural day of operations\n\n\nThanks for finding my video and pressing play! \n\nJoin me as I fly with BMI Regional on the first day of their new City of Derry to London Stansted route. \n\nThe link to London, abandoned by Ryanair in March 2017, provides a vital economic and cultural link to Derry-Londonderry and Northwest Ireland. As someone with a close connection to Derry and Donegal, I jumped at the chance to fly the route on the opening day.\n\nObligatory Derry plug:\n\nDerry-Londonderry is probably the most complete example of a walled city anywhere in Europe, and is an essential visit to anyone visiting Northern Ireland or to anyone with an interest in Anglo-Irish history or social justice. It’s a unique and brilliant place and certainly the most compelling city in the whole of Ireland, with the added bonus of its spectacular Donegal hinterland being within spitting distance of the city limits. \n\nLet’s hope the route is a success.\n\nFrom the BMI Regional press release:\n\n“The route, which is a public service obligation, or PSO, has previously only been operated on a daily basis. The new bmi regional service will be twice daily every day except Saturdays (when there will be one flight each way) and timed to compliment business schedules, making it easy for business travellers to do the round-trip in a day.\nJochen Schnadt, chief commercial officer of bmi regional, commented, “The North West region of Ireland is undergoing a sustained period of economic growth, and has received significant investment in new jobs and growth projects over the past 12 months. It is important for businesses that the region is well connected to the UK capital and bmi regional is proud to be bringing its quality, premium product to this route. Whereas previously business travellers between Derry and London have had to stay overnight in the city, they will now be able to commute there and back in a day, saving both money and time, and hopefully resulting in continued economic growth for the Derry region.”\nNorthern Ireland’s second city, Derry is an economic, creative and cultural hub. In 2013, it was named the UK City of Culture thanks to its winning combination of rich cultural heritage and vibrant social scene. The only completely walled city in Ireland and the UK, it is a bustling, youthful city with great restaurants, bars, museums and more. It is also the gateway to the wider North West and its spectacular coastline, which is regularly used for big film productions including the latest Star Wars franchise and Game of Thrones.”\n\nDerry Journal article referencing the morning flight: http://www.derryjournal.com/news/bus...vice-1-7943555\n\nMY MOST-WATCHED VIDEO - BRITISH AIRWAYS FIRST CLASS 787 REPORT: https://www.youtube.com/watch?v=4LRFyTtxlRg \n\nWHEN RYANAIR FLEW THE ROUTE: https://www.youtube.com/watch?v=LCZj7d3q-6M \n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #derry #londonderry #strokecity #stansted #london #bmiregional             \n\nMusic courtesy of Andrew Applepie and Flamingosis\n\n****DON’T FORGET TO SUBSCRIBE!****",
 "source": "youtube",
 "source_id": "UcT_dfl5vBM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-05-03T11:51:44Z"
}