{
 "name": "FIRST CLASS, Sheffield to London St Pancras International with East Midlands Trains",
 "description": "Check out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\n\nWATCH: AZUMA: Britain’s NEW high speed train: https://youtu.be/Y8ti6V73F0c\n\nSpecial thanks to my incredible $5+ Patrons: \n \nHenry Bollington\nAbby Fitzpatrick \nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nRobert Livingston\nVista Aviation\nAlly Mullins\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\n\nThanks for finding my video and pressing play!\n\nHere’s a little trip report I’ve had in my back pocket for a while. I travelled on this trip back in September (as you can probably tell from the weather!) and finally got around to editing it. \n\nEast Midlands Trains offer some of the best value first class fares in the whole country. This trip took just over two hours and cost just £16.50 (that’s with a third off thanks to my railcard), fantastic value. These cheap fares can only usually be found in the middle of the day, outside the peak. So what better way to travel to London than in first class?\n\nThere is a lunch menu on board East Midlands Trains. Link to the PDF here: https://www.eastmidlandstrains.co.uk/Documents/Menus/1/EMT%20All%20Day%20Menu%20Web%20Friendly.pdf\n\nSo join me as I travel on a 125mph-capable Class 222 Meridian train and race south down one of Britain’s perhaps lesser known main lines. \n\nFor those of you wanting to see more train trips...I have another one coming out in the next week or so, Plus I’ve got plans to film something great - and a bit different - in January. \n\nI have lots of videos coming out, including in midweek in the run up to New Year. Make sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nLakey Inspired - Elevate\nJoakim Karud - Celebrate \n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "l-o32yczhdM",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-17T09:29:49Z"
}