{
 "name": "HELVETIC AIRWAYS (for Swiss Airlines), Business Class, Embraer 190: Brussels to Zürich",
 "description": "Special thanks to my incredible $5+ Patrons: \n \nHenry Bollington\nAbby Fitzpatrick \nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nRobert Livingston\nVista Aviation\nAlly Mullins\nRami A\nYasseen\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: NOVEMBER 2017\nAirline: HELVETIC AIRWAYS (operating for Swiss)\nFlight #: LX781\nAircraft: EMBRAER 190\nLivery: Helvetic standard livery \nRoute: BRU-ZRH\nTail number: HB-JVM\nMiles: 300\nAirborne time: 0h53m\nNotes: First time flying Helvetic (or any Swiss Airlines flight!)\n\nWelcome to a BONUS MIDWEEK VIDEO!\n\nI’ll be posting a few of these bonus videos in the run up to Christmas to “use up” all the reports I’ve filmed on my iPhone.  I’ve got some great content planned for January 2018 using a new, proper camera and some professional editing software. \n\nHelvetic are a strange airline. They run their own flights, mainly on a charter basis, but as in this report they subcontract to Swiss International Airlines on certain intra-European routes. On this short hop in business class, follow me though the whole journey, with a bit of a focus on the excellent Brussels Airlines “Loft” Lounge at Brussels Airport. \n\nOverall, a pleasant flight on one of my favourite aircraft, the Embraer 190. Despite the 30 minute delay I enjoyed this flight, though it did help my hotel in Zurich was just a 5-minute tram ride from the airport!\n\nThis flight was booked as part of a complex multi-city itinerary with Swiss Airlines (including a 6-month stopover and a surface sector) so the costs I paid probably won’t be reflective of your own plans, if you’re interested!\n\nThe trip report I talk about in the beginning of the video is here - VLM Airlines London to Antwerp: https://m.youtube.com/watch?v=h2dmE6dBY44\n\nAnother trip will be coming on Sunday, as always. \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library\nRon Gelinas - We Are Harmony\nWonki - Anywhere\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "X1oqhZwBNgk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-11-30T09:01:13Z"
}