{
 "name": "Manchester to Milton Keynes Central with VIRGIN TRAINS, First Class",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nAbby Fitzpatrick \nJohn Walsh\nHenry Bollington\nJonathan O’Connor\nNeil Smith \nJohn Walsh\nAmber Watts\nSean Gorelik\nQuintin Soloviev\nStephen James\nJayden S\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: https://Instagram.com/paulstripreports \n\n\nThanks for finding my video and pressing play!\n\nThis report wasn’t meant to come out today and I explain why in the video.\n\nI have done quite a few Virgin Trains videos and won’t be making any for a while, so I can focus on more variety next year (if you want to know my plans, look at the Community tab in my channel, or your notifications, I posted a post about them yesterday!). \n\nOverall a fairly standard trip with Virgin West Coast. However, Virgin should be under no illusion that what they serve on board is NOT a dinner. The purpose of them serving hot meals on board is because their morning and evening trips cross breakfast time and dinner time. This gives busy people the opportunity to eat their meal on the train and not have to worry about getting up early for a breakfast, or make a dinner when they get home. There’s no way their tiny third of a fish with one potato and a few strips of root vegetables is a dinner! This was surprising because their breakfasts are quite sufficient. \n\nAs this was a night trip there’s not much to see outside so apologies if you feel this report is a bit light on content. However, starting next Sunday, new look Trip reports are coming in 4K HD, so sit tight and I hope you’re looking forward to 2018 as much as I am!\n\nMake sure you have your notifications set! 🛎 \n\nEnjoy the report and Happy New Year! 👍🏻\n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nTopher Mohr and Alex Elena - Vespers\nFunk Down - MK2\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "RRUQv36xYj4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-31T10:29:44Z"
}