{
 "name": "SWISS INTERNATIONAL Business Class Flight Experience: A319, Bucharest - Zürich",
 "description": "Tip jar: http://paypal.me/paulstripreports (all money goes towards paying for MORE content!)\n\nSpecial thanks to my incredible $5+ Patrons: \n \nAbby Fitzpatrick \nJohn Walsh\nHenry Bollington\nJonathan O’Connor\nNeil Smith \nAmber Watts\nSean Gorelik\nQuintin Soloviev\nRobert Livingston\nVista Aviation\nPeter Bos\nAustin Matemba\nLiam Doyle\nRachel Partridge\nBailey Courtney\nAnonymous Donor (x2)\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: NOVEMBER 2017\nAirline: SWISS INTERNATIONAL AIRLINES \nFlight #: LX1885\nAircraft: Airbus A319\nLivery: Swiss standard livery    \nRoute: OTP-ZRH\nTail number: HB-IPY\nMiles: 864\nAirborne time: 2h03m\nNotes: None\n\nThanks for finding my video and pressing play!\n\nMerry Christmas! I’m releasing this on Christmas Eve (UK) and hope you all have a relaxing and happy Christmas. \n\nThis is a short report focusing on a standard Swiss International A319 flight between Bucharest and Zurich, in business class. I’ve found Swiss to be a good quality carrier and this trip was no exception. \n\nBucharest-Otopeni Airport is one of the few pieces of infrastructure in Bucharest which is efficient and modern. I’ve been here a few times and the new terminal is airy and pleasant. It’s also efficient and sensibly laid out, and there are a few airline lounges to choose from (though they are mostly the same!). \n\nThe only real complaint I can make is about the weather! Every time I’m in Bucharest I’m treated to this depressingly grey low cloud with poor visibility! So, there’s not a huge amount to see on the ground with this video, although the inflight service was top-notch thanks to a great crew. \n\nI have lots of videos coming out, including in midweek in the run up to New Year. Make sure you have your notifications set! 🛎 \n\nEnjoy the report. \n\n_____________________________________\n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #railfan\n\nMusic courtesy of YouTube Audio Library \nBlue Wednesday - Rewind\nBlue Wednesday - Secret Garden \n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "SGbS9I0ti2E",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-12-24T08:28:27Z"
}