{
 "name": "VIRGIN TRAINS FIRST CLASS - London Euston to Liverpool Lime Street",
 "description": "Check out my Europe by Train Bright Trip guide: https://www.brighttrip.com/europebytrain\n\nWATCH NOW: My AMAZING trip to the Isles of Scilly! https://www.youtube.com/watch?v=na9DkXYffQ8\n\nSpecial thanks to my $5+ Patrons: \n\nChristoph H \nAlly Mullins\nHenry Bollington \nAbby Fitzpatrick \nNeil Smith \nAnonymous Donor\n\nJoin them on PATREON and support me: https://www.patreon.com/paulstripreports \n\nFollow me on Snapchat: pauls_trips ¦ https://snapchat.com/add/pauls_trips\n\nFollow me on Twitter: @pauls_trips ¦ https://twitter.com/pauls_trips\n\nFollow me on Instagram: paulstripreports ¦ https://www.instagram.com/paulstripreports/\n\nDate of Travel: AUGUST 2017\nTrain type: Class 390 PENDOLINO \nLivery: VTWC standard   \nRoute: EUS-LIV\n\nThanks for finding my video and pressing play! \n\nThis is my third Virgin West Coast Trip Report and probably the most comprehensive. I really enjoyed this brief journey, of just over two hours. We travel from London Euston station and head for Liverpool Lime Street. City centre to city centre, it’s 2h12 minutes of pleasant scenery and tasty food, with breakfast served to my seat. \n\nVirgin provide good value for money on this route. My ticket cost around £30 and included lounge access, free WiFi, onboard entertainment, and a cooked breakfast and beverages. Not bad. Of course, you have to book ahead to get the best deals!\n\nNext UK train trip will be uploaded in 4 weeks’ time - it’ll be a belter, the GWR Pullman. Until then, I’ve got three air trips to publish.\n\nThe signalling maps featured can be found here: http://www.opentraintimes.com/maps\n\nEnjoy the report. \n\nDo you have any ideas for future trip reports? Something you've never seen on YouTube before? Why not suggest it to me in the comments? I read every single one! 👍🏻\n\nEnjoy the video, and thanks for watching. If you subscribe, then thanks for being part of the channel! \n\nBA FIRST CLASS TO HOUSTON: https://m.youtube.com/watch?v=_O8FpAe-pD0\n\nSLEEPER TRAIN?: https://www.youtube.com/watch?v=YKQgkqdIhDc\n\n#paulstripreports #vlog #review #flying #travel #aviation #avgeek #trains #virgintrains #railfan\n\nMusic courtesy of Czech Vibes Sound\n\n***DON’T FORGET TO SUBSCRIBE!***",
 "source": "youtube",
 "source_id": "qiRIEri2tLE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2017-09-24T00:41:43Z"
}