{
 "name": "Flying Over Australia's Largest Aircraft Parking Lot",
 "description": "Surreal. Beautiful. Sad. Hopeful. Inspired. \n\nThis will go down as one of the most incredible experiences in my life.  As an avid avgeek and keen photographer I’ve always dreamt of flying over and photographing an aircraft graveyard.  I still hope to do so one day. \n\nThis was different though. What we have up in Alice Springs at the moment is not an aircraft graveyard.  Rather it is a covid induced parking lot.  And that’s very different.  \n\nThese aircraft are not here because they have reached the end of their economic and productive life.  On the contrary, most of these aircraft are in the prime of their life.  They’re here because the industry and the world has no use for them.  Covid has decimated the global tourism and travel industry and these aircraft, just like the empty airports, closed travel agencies and the empty desks at our office are the visual sign of that.\n\nEach aircraft represents hundreds, if not thousands, of lost jobs, lost dreams and careers that have ended prematurely.  They also represent the thousands of families who have been kept apart by this damn virus.  \n\nBut then as our flight continued I began to see hope and with it my energy and optimism grew.   \n\nWhat we have here are the building blocks of recovery. As vaccination rates increase our world is finally starting to open up it is these aircraft that will help reunite families and restore jobs, hope and dignity to millions around the world.  \n\nEach aircraft represents thousands of new jobs and a step towards bringing the world closer together. \n\nAn aircraft is pretty useless as city bus. Passionate travel industry people are rarely suited to careers elsewhere.  Our challenge now is to bring back both and to rebuild in a better and more sustainable way.  Personally, it’s a challenge I look forward to being part of. \n\n\nIf you’d like to see these incredible aircraft in the desert at Australia’s largest aircraft storage facility in Alice Springs I recommend you get in quick.  Contact Alice Springs Helicopters https://www.alicespringshelicopters.com.au/   This flight cost me AUD$500 for 20 minutes. \n\n#alicespringsaircraftstorage #planegraveyard #aviation",
 "source": "youtube",
 "source_id": "re8IG2fVo-c",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-11-08T10:06:25Z"
}