{
 "name": "Qantas 787 over Antarctica - the most beautiful flight review ever!",
 "description": "Massive thanks to Dashlane for sponsoring this video.  Use the following link and coupon code DENNIS to take advantage of the exclusive special offer available to my viewers:  https://www.dashlane.com/dennis\n\nThe flight review documents the most beautiful flight ever - a Qantas 787 charter flight to Antarctica on Valentines Day 2021 from Adelaide Australia.  \n\nSometimes you are given an opportunity and you definitely don't turn it down! For me that opportunity was to represent the Mawson's Huts Foundation on a special Qantas 787 charter flight down to Antarctica.  My job was simply to sell the raffle tickets and run the auction of Mawson memorabilia.  It was my first time flying over Antarctica and certainly the first auction I have ever run.  \n\nMore details on the Foundation can be found here: https://www.mawsons-huts.org.au/\n\nLuckily I brought my camera along and managed to create this pretty unique flight review of Antarctica Flights' Antarctica sightseeing flight.  Using Qantas 787 aircraft these flights operate from various Australian capital cities over the summer months.  Each flight is around 13 hours long and spends 4 hours over the ice in Antarctica south of New Zealand.  \n\nThe views as we fly over this remote Antarctic landscape at low altitude are breathtaking.  All the while experts onboard describe what we are seeing and the work being undertaken in the various research stations. \n\nThe views and the atmosphere on board combined to make this a truly memorable and fun flight.  We were also blessed with clear blue skies as we soared over the glaciers, mountain ranges, icebergs, deserts and even a volcano! \n\nA massive thank you to the Mawson's Huts Foundation, Antarctica Flights, Qantas, all the wonderful the crew on board, my mate Paul Cook and of course Dashlane for your continued support.\n\nFlight Details:\n\nDate:                   14 February 2021\nFlight Number:  QF2908\nAircraft:               Boeing 878-9 Reg VH-ZNB (Nov 17)\nFlight Time:        13 hours & 37 minutes\nDeparted:            Adelaide 08:30\nArrived:                Adelaide 22:07\nSeat:                     Economy Class 46D\n\n#antarctica #antarcticaflightreview #qantas787 #flightreview\n00:00      Adelaide Airport Arrival\n02:28 Boarding\n03:28 Take-off\n05:09 Antarctica flight details\n05:49 Cheers, here’s to a great flight\n06:35 Mawson’s Huts Foundation and raffle \n07:37 Ice Part 1: Wow!\n11:40 Seat Swap\n12:00 Ice Part 2: The Highlights\n13:50 Ice Part 3: Cockpit Footage\n15:39 Route Map\n15:50 Auction Time\n17:28 Dinner",
 "source": "youtube",
 "source_id": "T0IfIeAKcgk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-04-11T12:21:40Z"
}