{
 "name": "British Airways A318 Club World from London to New York",
 "description": "For many years, British Airways Flight 1 meant one thing: Concorde from London to New York. Today, British Airways Flight 1 has a different connotation. It's a British Airways A318 flying from London City (LCY) to Shannon (SNN) and on to New York (JFK). It's certainly British Airways' most unique route and, let's face it, a British Airways A318 flying across the Atlantic probably ranks up there as one of the most unique routes on the planet.\n\nHere's a link to the full, unedited takeoff and landing footage from this flight:\nhttps://youtu.be/KfQNbMgnqLc\n\nBut first, are you in the market for some new headphones? If so, please use the link below. Doing so will mean a small commission for this channel, which will help me produce even more content!\n\nhttps://jeb.flights/bose\n\nNow, in this video about British Airways Flight 1, I'll highlight the ground experience at LCY and SNN, the British Airways A318 Club World seat, the British Airways A318 Club World food, the British Airways A318 Club World in-flight entertainment, and the British Airways A318 Club World service.\n\nBritish Airways Business Class has been discussed by other trip reporters at length. Here's my take on what is, arguably, the strangest British Airways Business Class around. Club World is a product with many variants. And this version of Club World is unique to the Airbus A318. It's worth noting British Airways A318 Club World is a special seat design worth taking a look at in this video about British Airways Flight 1.\n\nIn the end, I'll give the experience on British Airways A318 a score. But, I'm curious to know...after watching the video, how would you rate the British A318 service from London to New York?\n\nI'll even give you my decision about whether I think this flight earned the designation it shared with Concorde: British Airways Flight 1.\n\nFor more trip reports, please subscribe to my channel!\nhttp://jebbrooksflies.com\n\nCheck me out on Instagram:\nhttps://www.instagram.com/jebbrooksflies/\n\nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n\nMusic:\nElasticity - Chelle Ives\nChillseekers - Chill Cole\nTraditional Irish Folk Music - Gavin Luke\nThe Infinite Dreamer - Chill Cole\nBursts of Brightness - Chill Cole",
 "source": "youtube",
 "source_id": "NVUTCBmh3aA",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-03-02T15:02:03Z"
}