{
 "name": "Czech Airlines ATR-72 Economy Trip Report",
 "description": "Czech Airlines just turned 95 years old, in this video, we'll explore Czech Airlines ATR-72 Economy Class. We'll look at Czech Airlines Seat, Food, and Service. \n\nThe flight was from Hamburg to Prague and gave us the opportunity to see how Czech Airlines serves a short intra-European Route. \n\nNot only was this my first flight with Czech Airlines, this was also my first flight on an ATR-72. Don’t you love hopping onboard a new aircraft type? Boarding is different than what we’re used to on most other airplanes. Here, our luggage went up front and we entered from the rear. \n\nI know some passengers don’t like flying on turboprop aircraft and I think that’s too bad. Modern turboprops like the Czech Airlines ATR-72 aren’t very different from jets. \n\nTurboprops like the Prat and Whitney engines on this Czech Airlines ATR-72 and jets are both built with turbine engines. Jets encase their turbines with fan blades while turboprops have a propeller on the outside. This is much different than old school piston engines, which also have propellers, but are much different mechanically and are typically only found in smaller aircraft. \n\nIn other words, I believe turboprops like the Czech Airlines ATR-72 are just as safe as jets. Leave a comment with your thoughts on turboprops. I for one was happy onboard this ATR! \n\nThe seating on the Czech Airlines ATR-72 is arranged in a 2-2 configuration with European Business Class located at the back of the plane. European business class, by the way, simply means the seat next to you is blocked. \n\nThe boarding process for the Czech Airlines ATR-72 was efficient and we were ready to takeoff in no time. \n\nThe seat onboard the Czech Airlines ATR-72 is comfortable with 30 inches of pitch and it’s 17 inches wide. \n\nThere was space under the Czech Airlines ATR-72 seat for my large backpack. My iPad found the seat-back pocket comfortable. And the tray table has all the space you’d need in order to have a snack or get some work done. \n\nThe passenger service unit on the Czech Airlines ATR-72 includes lights and individual gaspers or air vents. Unfortunately, the lights didn’t work. Fortunately, the air vents did. \n\nThere’s a buy onboard menu on the Czech Airlines ATR-72 with prices designed to deter all but the most ravenous of passengers. I was sorry ATR flights don’t have the donuts onboard. They were pushing them hard, so they must be something… \n\nStreaming inflight entertainment is available on the Czech Airlines ATR-72. \n\nIn short, we had access to a lounge, the crew were great, the seat sufficient, the food fine, the Czech Airlines ATR-72 was very nice, and you wouldn’t really expect IFE on a flight like this. It was a very nice flight. One item of note: Despite paying cash for the flight on a SkyTeam partner and adding my Delta SkyMiles number, the fare (which was not the lowest one) didn’t qualify for any miles over at Delta. I did have access to Sky Priority benefits thanks to my Delta Diamond status, but I earned no miles for this trip. \n\nOh, well. We arrived on time. I left the flight eager to fly with Czech Airlines again. But, what do you think? Leave a comment with your perspective on Czech Airlines. \n\nFor the unedited take-off and landing footage:\nhttps://youtu.be/gtJDKfAmFWU\n\nFor more trip reports, please subscribe to my channel! \nhttp://jebbrooksflies.com\n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic: \nAtascado - Timothy Infinite \nRomantico - Timothy Infinite \nCalentar - Timothy Infinite",
 "source": "youtube",
 "source_id": "HDRmAP8Za8M",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-12-21T14:00:10Z"
}