{
 "name": "Miniatur Wunderland Airport: An AvGeek Must See",
 "description": "In this video, we’ll explore a bit of Miniatur Wunderland, the world’s largest model railway. We’ll spend most of the time watching the action at Miniatur Wunderland Airport, an unbelievable scale model of Hamburg’s Airport. Miniatur Wunderland Airport includes all of the action of the real thing, just on a smaller scale.\r\n\nMiniatur Wunderland Airport took 150,000 hours of work to build. Miniatur Wunderland Airport has 40,000 LED bulbs, 62 miles of wiring, 50,000 lines of code. The cost to build Miniatur Wunderland Airport? Four million Euros. While Miniatur Wunderland Airport was not quite as expensive as the real Hamburg Airport, this is one serious exhibit!\r\n\nMiniatur Wunderland Airport hosts around 250 takeoffs and landings each day. There are 787’s, A330’s, 777’s, 747’s, even Concorde! There are a host of support vehicles at Miniatur Wunderland Airport. Everything from a Miniatur Wunderland Airport fire department to catering trucks and super tugs, Miniatur Wunderland Airport has it all. Perhaps most striking is just how similar it is to the real thing!\r\n\nTickets for adults to enter Miniatur Wunderland are about 15 Euros, kids get in for half of that price. You can book your ticket online, which might help you skip the lines, which can get pretty long at certain times of the year. Oh, and by the way, this is NOT a sponsored video. I paid for my ticket.\r\n\nHere's a link to the website to book your Miniatur Wunderland tickets:\r\nhttps://www.miniatur-wunderland.com/\n\nFor more trip reports, please subscribe to my channel! \r\nhttps://www.youtube.com/jebbrooksflies \r\n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \r\n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \r\n\nMusic: \r\nNorthbound Train: Marc Torch\r\nWayfinders: Trevor Kowalski\r\nAll In My Head: Hallman\r\nFading Love: Hallman",
 "source": "youtube",
 "source_id": "jQ7MWnOSgVE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-12-14T14:00:11Z"
}