{
 "name": "The World's FIRST Inaugural Flight",
 "description": "The world's first inaugural flight took place between St. Petersburg, Florida and Tampa, Florida in the United States of America in 1914. In this video, we'll explore the history of this flight along with the organization that perpetuates the legacy of the world's first inaugural flight.\n\nInaugural flights are some of the most exciting things in aviation. Whether it is the first time an airline operates a new route or a new aircraft type, any inaugural flight is exciting! \n\nBut, surely the first time any person paid to be flown in any aircraft anywhere in the world tops it off...the ultimate inaugural flight!\n\nBack on January 1, 1914 – about ten years after the first ever flight right here in North Carolina – Tony Jannus, lifted off the water just off of St. Petersburg, Florida with the first paying airline passenger on the first commercial flight in world history. 23 minutes later, they’d flown 21 miles to Tampa. Shortly, they returned having finished the first round trip airline flight ever. \n\nDuring its initial operation, the St. Petersburg-Tampa Airboat Line carried 1,203 passengers. Today, that’s a couple of A380’s…back then, it took three months!\n\nAlong with exploring the history of the world's first inaugural flight, we'll check in with this year's winner of the Tony Jannus Award, Dr. Tom Enders, former CEO of Airbus. He'll share his thoughts on the world's first inaugural flight along with a bit of reflection on his own amazing career.\n\n[1] This footage was provided by the Tony Jannus Distinguished Aviation Society.\n\nFor more trip reports, please subscribe to my channel! \nhttps://www.youtube.com/jebbrooksflies \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies\n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nSunrise On The New World - Grant Newman\nThe Kingdom of Nature - Grant Newman\nThe Battle of the Nile - Grant Newman\nCelebration (Instrumental Version) - Lvly",
 "source": "youtube",
 "source_id": "PtGWVDLfvFs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2019-11-23T15:00:07Z"
}