{
 "name": "18 Hours NYC to New Zealand (WORLD’S LONGEST FLIGHTS)",
 "description": "Watch this video to see what it’s like to travel on one of the world’s LONGEST FLIGHTS! This is Air New Zealand’s flagship route from New York to Auckland.\n\nWe made the trip from New York’s JFK international airport to Auckland’s International Airport onboard Air New Zealand Flight Number 1!\n\nThis video will showcase what it’s like to travel onboard the fourth longest flight on planet earth! We’ll highlight everything you’ll experience in Air New Zealand Business Class for almost 18 hours. \n\nYou’ll see the Business Class Lounge used by Air New Zealand in New York, the quirky Air New Zealand Business Class seat, the scrumptious Air New Zealand Business Class food, the Inflight Entertainment, and even get a sense for Air New Zealand’s incredible onboard hospitality.\n\nThis Air New Zealand 787 Dreamliner flight was supposed to take about 17 hours, but thanks to a long taxi time at JFK Airport and “seasonable winds,” we were onboard for a whopping 18 hours and 10 minutes!\n\n0:00 Introduction\n1:02 Air New Zealand JFK Lounge\n3:31 Boarding Air New Zealand’s Longest Flight\n6:12 Dinner on Air New Zealand\n7:20 Air New Zealand Business Class Bed\n9:54 Breakfast on Air New Zealand\n11:03 Air New Zealand JebScore\n13:08 Bloopers\n\nMore of the World’s Longest Flights:\nhttps://youtube.com/playlist?list=PLQhp4hw0kFepv_ng3oYsO_LgZgTUYKyFe\n \nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.Instagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nCirrocumulus - Static Glow Sounds\nWanna Run Away with You (Instrumental Version) - The Big Let Down\nSaturday Lights - FLYIN\nTree Tops - Autohacker\nMorning Caption - Billo Boi\nGoing Under (SLCT Remix) (Instrumental Version) - The Eastern Plain",
 "source": "youtube",
 "source_id": "trUSa530Ol4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-11-26T16:00:29Z"
}