{
 "name": "2 DAYS on Rocky Mountaineer's LUXURY TRAIN \"Rockies to Red Rocks\" 🇺🇸",
 "description": "Welcome onboard an incredible Luxury Train through some of the most spectacular landscapes in the USA. This is 2 Days on the Rocky Mountaineer's new Rockies to Red Rocks route in the United States!\n\nIf you’re thinking of taking an unforgettable train journey, watch this first! With its unmatched scenery, the Rocky Mountaineer’s Rockies to Red Rocks luxury train should find its way onto your bucket list. \n\nEven though Rocky Mountaineer has been around since the 1990’s, this is their first Luxury Train in the United States! \n\nIn this video, we’ll travel from Denver from Moab, Utah and Arches National Park onboard this incredible Luxury Train in their premium Rocky Mountaineer Silverleaf Plus class of service. You’ll see the Luxury Train features available on this train along with the Luxury Train Food! We’ll also take in some of the incredible sights on this Luxury Train trip. \n\nYou’ll see the sights, the food, and gain insight into what it’s like to travel on the newest Luxury Train in the United States: Rocky Mountaineer’s Rockies to Red Rocks. \n\n0:00 Introduction\n1:39 Day One on the Rocky Mountaineer Rockies to Red Rocks\n19:12 Day Two on the Rocky Mountaineer Rockies to Red Rocks\n28:33 Bloopers\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nDon’t miss my video about Amtrak’s California Zephyr: \nhttps://www.youtube.com/watch?v=m1gRPEZdKyI\n\nAnd, why not check out this one about Amtrak’s LONGEST Route: https://www.youtube.com/watch?v=4-RcNp1uhKE\n\nOh! And here’s a link to the video I mentioned about the Alaska Railroad: https://www.youtube.com/watch?v=kIJoUNP2-v4\n\nIf you made it this far, here’s a playlist of all of the train videos on my channel: https://www.youtube.com/watch?v=43p7rNDG7rk&list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc\n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nLike a Breeze - Brett Gregory\nEvery You - Benjamin Carey\nRescue Me. -Bireli Snow\nBefore I Knew You - Harper Rey\nJust Spend Time - Ryan Freeman\nGood Vibes (Instrumental Version) - East of Heaven\nInto the Earth - King Peaks\nOmnipresent - North Sphere\nYou Is Magic - River Run Dry\nProud of You - Briar Edwards\nWe Sail - Benjamin Carey\nThe Coldest Nights - River Run Dry\nChuggin' Away - River Run Dry\nPlease Tell Me - Plain Strolls\nSomething Like This - Plain Strolls",
 "source": "youtube",
 "source_id": "6b-cecHEfdU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-06-18T15:00:06Z"
}