{
 "name": "JetBlue A321 Mint Experience from Newark to St. Maarten",
 "description": "Watch this video to see the JetBlue Mint Experience and decide whether you want to book jetBlue’s Classic Mint Business Class to the Caribbean!\n\nThere aren’t very many ways to enjoy a lie flat seat from the United States to Caribbean destinations, but jetBlue’s Mint is one.\n\nIn this video, you’ll see jetBlue’s Classic Mint seat, the Mint food, jetBlue’s inflight entertainment, and you’ll even experience jetBlue’s Mint Service onboard this A321 from Newark to St. Maarten!\n\nThis jetBlue A321 is called \"Fly In Mint Condition.\" It's a jetBlue A321 Mint equipped airplane with jetBlue Classic Mint installed. That's the older, original version of Mint. In this video, I'll even explain the difference between jetBlue's Refreshed Mint and jetBlue Classic Mint. You'll also see why this is the best jetBlue Mint for Couples!\n\n0:00 Introduction\n1:34 Classic versus Refreshed Mint Comparison\n3:20 Boarding jetBlue Classic Mint and Seat Tour\n6:14 Departing EWR for SXM\n6:47 jetBlue Inflight Entertainment\n9:12 jetBlue Mint Breakfast\n11:06 jetBlue Classic Mint JebScore\n\nFor the most up-to-date about jetBlue Mint Routes and jetBlue Mint Routes, check out this website:\nhttps://www.jetblue.com/flying-with-us/mint\n\nJetBlue “Throne Seat” Review from the Transcon Throwdown:\nhttps://www.youtube.com/watch?v=YUXb8peSr1w\n\nJetBlue Mint Studio Review:\nhttps://www.youtube.com/watch?v=41xsJCqXJjY\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nHanging in the Air – Moon Craters\nBackyard Stories – Sum Wave\nAnyone – Maiwan\nViews – Rannar Sillard\nHeart of Fire – Segmental\nTropic Fun – Maiwan\nBear Hats – Smartface",
 "source": "youtube",
 "source_id": "G5Fmmfd4VWQ",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-02-19T16:00:07Z"
}