{
 "name": "United Airlines INAUGURAL FLIGHT to Amman, Jordan in Business Class",
 "description": "Watch this video to see what it’s like to fly with United Airlines on 787 Dreamliner to Amman, Jordan!\n\nUnited Airlines has announced more new routes to fascinating destinations than any other US airline and I booked a ticket on the first of these flights. I traveled in United Airlines First Class “Polaris” from Washington Dulles Airport to Amman, Jordan.\n\nYou’ll see everything, from the *incredible* Polaris Lounge in Washington to the epic party the airline hosted at the gate. You’ll see the United Airlines First Class Polaris Seat, the United Airlines First Class food and service, not to mention the United Airlines Inflight Entertainment.\n\nYou’ll even get the highlights of the United Airlines Inaugural Flight festivities. From the party to the food to the giveaways and even some incredible Jordanian Dancing!\n\nNo doubt about it, United Airlines did this right!\n\nBut, best of all, I had the chance to meet up in Petra with my friend and fellow YouTuber, Dennis Bunnik. Check out his channel here:\nhttps://www.youtube.com/c/DennisBunnikTravels\n\n0:00 Introduction\n2:08 United Airlines Polaris Lounge\n4:09 Amman Inaugural Flight Gate Party\n5:34 Boarding United Airlines Business Class\n8:09 United Airlines Business Class Dinner Service\n10:42 United Airlines Business Class Breakfast Service\n11:43 United Airlines JebScore\n13:18 Water Canon Salute & Petra\n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nAla Shawiti Digle – Ali Sabah\nWe Are A Long Ways Away – DJ Denz The Rooster\nI’ve Felt Like This Before – Isobelle Walton\nSabah – Ali Sabah\nPast Life – Josef Falkenskold\nGoji – Ran the Man\nTo the Sky – Josef Falkenskold\nSwing Platter – Dusty Decks\nHere Goes Nothing – Josef Falkenskold\nFailed Effort – Guustavv\nGhaith – Ali Sabah",
 "source": "youtube",
 "source_id": "VmDug1xUYj0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-05-14T15:00:12Z"
}