{
 "name": "What's it like to take New Zealand's WORLD FAMOUS Ferry?",
 "description": "Watch this New Zealand Travel Guide to get a sense of what it’s like to travel the 58 miles over three+ hours from New Zealand’s South Island to the North Island in the comfort of New Zealand’s Interislander Ferry, the Kaitaki..\n\nJoin us as we travel across the Cook Strait from the Picton at the top of the South Island to New Zealand’s bustling capital of Wellington on the North Island aboard the Kaitaki ferry!\n\nThis is only the second time we’ve made a video highlighting a ferry and it was incredible! \n\nKiwirail runs this ferry as part of its Great Journeys of New Zealand brand, which is an apt name. They also run the TranzAlpine, Coastal Pacific, and Great Northern trains. The schedules line up to make it possible to travel by rail and ferry all the way from Christchurch to Auckland and back using these services.\n\nWe splurged for the lounge access to make this a luxury travel experience. That means you get to see the Kaitaki Plus Lounge where we indulged in the range of food and drinks they make available. You’ll have to be the judge of whether it’s worth the increased price for you. For the latest pricing and schedules, check out this website:\n\nhttps://booking.interislander.co.nz/Booking/Travel-Details.aspx\n\nYou’ll also see the other amenities onboard, including the restaurants, bars, food, and drinks.\n\nAnd, if you stick around to the end, I’ll even rate it using the JebScore!\n\n0:00 Introduction\n2:19 Interislander Ferry Booking\n3:12 Interislander Kaitaki Ferry Tour\n5:50 Queen Charlotte Sound\n7:50 Cook Strait\n9:17 Jebscore\n\nWatch our first Ferry Video here:\nhttps://www.youtube.com/watch?v=XIzPF-L74W4\n\nFor more trip reports, please subscribe to my channel!\nhttp://www.JebBrooksFlies.com\n \nCheck me out on Instagram:\nhttps://www.Instagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too:\nhttps://twitter.com/jebbrooks\n \nAnd don't forget to take a look at my travel blog:\nhttps://greenergrass.com/\n \nMusic:\nWaste Our Time (Instrumental Version) - BLAEKER\nJust Carry On (Instrumental Version ) - Windshield\nDreaming of You (Instrumental Version) - Chyara\nMy California (Instrumental Version) - Pastis\nStay For Now (Instrumental Version) - Ray\nCarry On (Instrumental Version) - Kadant\nRacing For Life (Instrumental Version) - Duty Division",
 "source": "youtube",
 "source_id": "LGdsFB7lzDU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-12-17T16:00:07Z"
}