{
 "name": "British Airways Airbus A380 Full Flight: London to Boston",
 "description": "A full length, full flight video with British Airways onboard Airbus A380 G-XLEE, operating flight BA213 from London to Boston on June 22 2018. \n\nThumbnail: Thanks to Sean Noel O'Connell: https://www.flickr.com/photos/134579296@N02/35421449903/\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTS\n\nOur flight today begins on a beautiful summer's day in London.  We enter the beautiful Terminal 5, home of British Airways.  We make our way through the terminal to board our incredible Airbus A380 that will take us across the Atlantic Ocean to the USA.  \n\nWe board our aircraft and take our seat, before we push back and taxi to runway 27R for a departure to the west.  We get some incredible views as we climb across southwest England and Wales, crossing the Pembrokeshire coast in South Wales getting a great view of the entire coastline up to Anglesey.  Then we cross Ireland, again getting a fantastic view from coast to coast before we go 'feet wet' and cross the Atlantic Ocean.  \n\nAfter around 4 hours of flight we cross the Canadian coastline in Newfoundland, and head across Nova Scotia towards the US border.  From there we see the entire of Maine and cross into Massachussetts, descending off the coast and making a beautiful approach and landing on schedule to runway 4R at Logan International Airport.\n\n0:00:07 Outside Heathrow Terminal 5, entering terminal\n0:02:11 After security, walk to departure lounge\n0:04:50 Walking to transit, train to B pier\n0:13:45 Leaving transit, walk to gate\n0:19:15 At the gate, waiting to board\n0:20:02 Boarding called, boarding our aircraft and taking our seat\n0:34:26 Cabin view\n0:42:59 Captain Phil Prentice welcomes us onboard and gives an overview of our flight\n0:48:31 ATC: Pushback and engine start\n0:52:52 Safety video\n0:56:40 Taxi clearance\n1:07:50 Takeoff from runway 27R\n1:27:51 Cabin view\n1:32:32 Welsh coastline\n1:42:23 Irish coastline\n1:54:08 Bar Service\n2:35:57 Lunch service - Thai Curry chosen\n2:45:24 Bar Service\n3:11:36 Cabin tour\n3:28:45 Tour of airshow map system\n3:34:00 Tour of inflight entertainment (IFE) system\n5:28:12 Cabin view\n5:36:52 Tour of airshow map system\n5:52:37 Canadian coastline\n6:58:25 Snack Service\n7:42:42 ATC: Contacting Boston Approach\n7:45:22 Descent into Boston\n7:50:43 Downwind to Boston Logan\n7:56:03 Final approach to runway 4R\n8:04:49 Boston planespotters taking photos of our aircraft!\n8:18:20 Disembarking aircraft, walking to immigration\n8:23:04 After immigration, walking to outside of terminal\n\n\n\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "T985ld3GAIU",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-08-17T13:00:06Z"
}