{
 "name": "GOODBYE VLM AIRLINES: Fokker 50 Full Flight - London City to Antwerp",
 "description": "In August 2018 I finally managed to get a flight onboard a Fokker 50.  I took a flight with VLM Airlines onboard their Fokker 50 from London City to Antwerp.  Little did I know that just a week after my flight, VLM Airlines would enter liquidation and cease operations, thus ending scheduled Fokker 50 operations in Europe.\n\nOur flight today begins outside the small terminal at London City Airport.  We enter the terminal and make our way to security, before heading to the departure lounge and watching the movements at this tiny but busy airport.  Before long our aircraft arrives from Antwerp and we proceed to board this 27 year old aircraft, originally delivered to Brazilian airline Rio Sul in 1991!  Soon the Pratt & Whitney engines spool into life and we taxi to runway 27, before making a leisurely departure over the city of London.  We make our way towards Dover and out over the English Channel where we are served breakfast and coffee.  Before long we start our descent over Belgium, being handed a mint (a rarity these days).  We are soon on our final approach over the fields of Flanders, before touching down on schedule at Antwerp Airport.  We disembark the aircraft and make our way through the tiny airport of Antwerp to the taxi ramp.\n\n0:00:04 Outside London City Airport, entering terminal\n0:01:35 After security, walking to departure lounge\n0:02:45 Watching aircraft movements at London City, and our aircraft arriving from Antwerp\n0:03:39 Walking to departure gate\n0:05:34 Our aircraft on stand\n0:06:12 Boarding the aircraft\n0:10:50 Cabin view\n0:11:09 ATC: Route clearance to Antwerp\n0:11:37 Cabin view\n0:16:39 Fokker 50 Engine start & Taxi\n0:28:46 Takeoff from runway 27\n0:31:50 Cabin view\n0:43:20 Seat view\n0:57:33 Breakfast service\n0:59:45 Cabin view\n1:15:24 Mint during descent\n1:16:53 Approach and landing in Antwerp\n1:23:08 Disembarking aircraft and walking through terminal to taxi rank\n\n#inflightvideo #fullflight #fullflightvideo",
 "source": "youtube",
 "source_id": "xMN_r2UiGTI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-09-04T12:59:55Z"
}