{
 "name": "Southwest Airlines Full Flight: Chicago to St Louis - Boeing 737-700",
 "description": "A full length, full flight video with Southwest Airlines onboard Boeing 737-700 N7726A, operating flight WN5476 from Chicago to St. Louis on June 23 2018.\n\nThumbnail: Thanks to Dean Heald https://www.flickr.com/photos/31892280@N02/\n\nMERCH & MORE: inflightvideo.tv\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTS!\n\n\nPATREON: http://patreon.com/inflightvideo\n\nOur flight today begins outside the terminal at Chicago's Midway airport, home to Southwest Airlines.  We enter the terminal and proceed to the friendly TSA checkpoint, before heading airside to the Southwest gates.\n\nOur flight is soon called for boarding and we make our way to our assigned position on the boarding podium.  Fortunately we are in group A today so are among the first to board - however once onboard the flight is pretty full as it is a continuation of a service from Orlando.  We find a window seat towards the back on the right and before long we push back and make a speedy taxi to the runway, blasting off with a powerful takeoff over Chicago's southern suburbs.  We make a right turn on track to St Louis and climb to our cruising altitude for this short flight.  We are served complimentary coffee and snacks, and sample the free wifi on this low cost airline.  \n\nBefore long we commence our descent into St Louis and touch down on schedule, before a fast taxi to the gate.  We disembark into the terminal building where we will be connecting to our next flight.\n\nAirline: Southwest Airlines\nFlight: WN5476\nAircraft: Boeing 737-700 N7726A\nFrom: Chicago (MDW)\nTo: St. Louis (STL)\nDeparture: 15:25\nArrival: 16:10\nFlight Time: 0:45\nSeat: 17F\n\nTIMELINE\n\n0:00:05 Outside the terminal at Midway, walking into terminal and to TSA\n0:02:33 After TSA, walking to departure lounge\n0:08:36 View of movements at Midway\n0:09:57 Gate area at Midway\n0:12:54 Boarding commences\n0:13:22 Boarding the aircraft and finding a seat\n0:26:32 Cabin view\n0:30:49 Cabin view\n0:38:43 Pushback and engine start\n0:44:48 Takeoff\n0:54:10 Drinks service commences\n0:54:53 Drinks order taken\n1:00:27 Drinks being served\n1:03:21 Cabin view\n1:08:07 Buy on board menu\n1:09:43 Southwest Airlines Peanuts served\n1:11:13 Inflight entertainment brochure\n1:17:20 Commencing approach into St Louis\n1:27:40 Final approach and landing in St Louis\n1:35:19 Disembarking, walking through terminal",
 "source": "youtube",
 "source_id": "np-rwmoYScE",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-09-07T13:00:11Z"
}