{
 "name": "TAP Air Portugal Full Flight: Manchester to Lisbon - Airbus A320 (with ATC, multi camera, map)",
 "description": "A full length, full flight video with TAP Air Portugal from Manchester to Lisbon, onboard Airbus A320-200 CS-TNS operating flight TP321 on 19 January 2018.\n\n**Every moment of the flight from airport to airport, external view and ATC courtesy of World Aviation HD - check out his amazing channel http://youtube.com/user/directorphilip2 **\n\nAirline: TAP Air Portugal\nFlight: TP321\nAircraft: Airbus A320 CS-TNS\nFrom: Manchester (MAN)\nTo: Lisbon (LIS)\nDeparture: 11:03\nArrival: 13:30\nFlight Time: 2:27\nSeat: 6F\nFlight Path: http://infl.it/tp321map\n\nBECOME AN INFLIGHT VIDEO VIP AT http://patreon.com/inflightvideo\n\nPLEASE SUBSCRIBE FOR WEEKLY FULL FLIGHTSMY CAMERA GEAR: https://www.amazon.com/shop/inflightvideo\n\nOur journey today begins on a cold January morning at Manchester Airport, UK.  We enter the terminal and proceed to check in, before heading through security and to our gate, where our aircraft is waiting for us.\n\nWe board the aircraft and take our seat in 6F, before we make an on time push back and departure.  We taxi to runway 23R and make a beautiful takeoff on a clear sunny day, filmed externally from the viewing terrace by World Aviation HD.\n\nWe get some great views of Wales as the weather remains clear for most of the flight.  We cross the Bristol Channel and Devon, before crossing the English Channel towards France.  We cross the tip of Brittany near to Brest, before crossing the Bay of Biscay and reaching the Spanish coast near to Gijon.\n\nWe cross into Portugal and commence our descent, before making a stunning approach and landing across the beautiful city of Lisbon and touching down smoothly on time.  We disembark the aircraft and take a bus to the terminal, before passing through the aircraft to emerge on a beautiful warm day in Portugal.\n#inflightVideo #FullFlight #FullFlightVideo",
 "source": "youtube",
 "source_id": "hNdhe0o-jok",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2018-02-02T14:00:08Z"
}