{
 "name": "24 HOURS IN HELSINKI FINLAND",
 "description": "Please like share and subscribe to TrekTrendy for more worldwide travel vlogs: http://bit.ly/1WNqym8\n\nFlight layovers can be an awesome opportunity to explore a new city, and this is exactly what happened here. I had 24 hours in Helsinki, Finland to explore the city in between my flight from London and my flight to Gdansk. I stayed at the Hilton airport hotel over night as my flight from London arrived quite late. I made sure I woke pretty early the next day so I could have a good few hours of exploring the city. I took the new airport train which took about 20 minutes into the city costing 4 euros each way. Getting into Helsinki central station you think it's firstly quite a modern building but upon entering the main area it's got a really cool art deco feel to it. \n\nAfter checking the Trip Advisor app to ensure I was heading in the right direction I came across a gorgeous park in the centre of town. There also was a bunch of live music and a market on which I investigated. It was like a British car boot sale but instead in a park! \n\nI then passed a floating market selling fresh seafood and then went onto the pier to get my first look at this gorgeous city. Wow Helsinki you are amazing! I could see where I'd been walking and the three main areas I wanted to see, which as you'll see in the video were: the Uspenski Cathedral, Helsinki wheel, and the Senate Square where I was able to explore the main Helsinki Cathedral. \n\nCheckout the video and let me know what you think, but for a few hours in the city I think I managed to fit quite a lot in! \n\n----- Background music -----\n\nMusic: Aritus – Flight by Aritus is licensed under a Creative Commons License.https://soundcloud.com/aritusmusic/flight\n\n----- Image use -----\n\nWith special thanks to Hilton hotels for use of their hotel image.",
 "source": "youtube",
 "source_id": "Oy_Brktg3yo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-09-13T21:03:04Z"
}