{
 "name": "5* TOURIST GUIDE SPAIN - Part 2: Luxury hotels, Seville, Malaga and Fuengirola",
 "description": "Thanks for watching guys, give this video a thumbs up if you enjoyed it and subscribe for more weekly travel vlogs: http://bit.ly/1WNqym8\n\nThis is part 2 of my Spanish adventure (come tourist guide to Spain) along the Costa del Sol, where I enjoyed some stunning 5* hotels, explored Seville and sunbathed on Fuengirola beach. Join me and my girlfriend on our roadtrip, pick up some useful tips on how to do the same and even checkout Malaga airports new business class lounge. \n\n*** First stop: AMA Andalusia Resort & Health Retreat you can check this hotel out here: http://bit.ly/2a1mtLI and my word what a place. It's a health hotel so expect top notch but healthy dining, excellent facilities and an awesome Spa! \n\n*** Second stop: Seville for the afternoon. I do seem to have a habit of visiting new cities in a whistle-stop manor. Seville was awesome, I checked out the Cathedral, explored the old city streets and relaxed in a rooftop bar drinking Mojitos. \n\n*** Third stop: The wonderful DoubleTree by Hilton Hotel Resort & Spa Reserva del Higueron. You can check this out here: http://bit.ly/29MLGtI The room was amazing, got an upgrade which was lovely, with sea views and a bath in the middle of the room! I do wonder what it would be like to share with someone you weren't too familiar with as everything is open plan including the toilet! \nIt's worth to note there were a couple of niggles. The facilities which I disagreed with; the rooftop pool which was chargeable to the tune of €15pp each day and a closed main pool. Overall though this was forgiven due to the room and location. \n\nLastly we checked out Malaga's relatively new Business class lounge, which was interesting... Typical of third party lounges, they're never as plush and luxurious as airline run/owned ones. The whole lounge felt like a massive waiting room, which whilst I get is the point, it should really feel more relaxed and a space to unwind. The facilities were ok, with some basic breakfast items (being 5am), cava, beer, wine etc. As well as a computer business facility and rather odd cinema room. \n\nMy flight back to Bournemouth was great, I got some shuteye, watched an episode of Game of Thrones and arrived fresh for a days work.\n\nSound disclaimer:\nKeep On Going by Joakim Karud https://soundcloud.com/joakimkarud\nCreative Commons — Attribution-ShareAlike 3.0 Unported— CC BY-SA 3.0 \n\nImage disclaimer: \nWith thanks to the AMA Andalusia Resort & Health Retreat & DoubleTree by Hilton Hotel Resort & Spa Reserva del Higueron for use of their photos.",
 "source": "youtube",
 "source_id": "C7ZiePVM3lY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-07-17T16:40:31Z"
}