{
 "name": "LARGEST FIRST CLASS LOUNGE?! - Turkish Airlines Istanbul Tour",
 "description": "Please like, share and subscribe to TrekTrendy for more worldwide travel vlogs: http://bit.ly/1WNqym8\n\nA few weeks ago I was lucky enough to try out the flagship and award winning Turkish airlines lounge at Istanbul international airport. In fact some trivia for you before I begin, in the last few days it’s actually been renamed to the July 15 Heroes of Democracy lounge… \n\nAnyway, the lounge is accessible if you’re flying on one of Turkish airlines’ premium products Business class or First class. If however you’re like me and have Star Alliance Gold and you’re flying on a Star Alliance airline you can get access. The check in to the lounge is either through the automatic barriers where you scan your boarding pass (which is great and should be done in more lounges around the world) or by means of a reception area. \n\nWalking in I got a similar feeling to the gold souks in Dubai mall... I know a unique experience for an airport. One main walkway takes you into the beautiful open plan first floor of the lounge filled with natural light. There are multiple rooms off in each direction including a cinema, showers, spa, billiards and luggage store. A feature I loved was that there were multiple food and beverage stations dotted around the lounge so you never had to queue to get food/drink or indeed it didn't feel rushed like you do in some lounges around the world. \n\nWe then walked downstairs to the ground floor, where I was immediately met with a pretty awesome video game arcade complete with Playstation's, arcade machines and a virtual golf course! \n\nContinuing on there was a lounge area complete with grand piano, chandelier, a sort of more formal eating area. Then the next zone, which was called the Turkish tea rooms seemed partly closed which was a shame but I could at least poke my head in to view! I then checked out the alcoholic drinks selection which was good but did lack some of the more premium spirits I would have expected to see. Also I didn't see Champagne, but I know in some lounges this is available upon request so this may have been the instance. \n\nWalking on I came across a live chef's theatre where you could order cooked food which I thought was impressive. I opted for a Turkish mezze which was excellent. \n\nI hope you enjoyed the video, I did enjoy making it although I was rather tired due to being out in Kiev, Ukraine the night before! \n\n----- Background music -----\n\nWith special thanks to Cris Taylor - dünyam for the background music.  Checkout his work: http://bit.ly/2aONVvT \nAs usual I make every effort to ensure the music I use is appropriately credited, but do let me know if there is any issue with music use. \n\n----- Image use-----\n\nWith thanks to Turkish Airlines for use of their lounge imagery",
 "source": "youtube",
 "source_id": "NoGWfXz2iNY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2016-08-15T19:58:04Z"
}