{
 "name": "Air France 787 Business Class – FIRST International Flight in 1+ Year",
 "description": "In this video, you’ll see what it’s like to fly to Paris on an Air France 787 Dreamliner in Business Class!\n\nWith borders slowly opening up to international travelers, more and more people find themselves booking flights abroad. Perhaps you’re one of them? Watch this video to decide whether you’d like to fly with Air France.\n\nTonight’s flight across the Atlantic Ocean will clock in at a more typical seven hours and we’ll reach an altitude of 38,000 feet over the nearly 4,000 mile journey.\n\nYou’ll see the Delta Sky Club an Air France business class ticket gets you into. You’ll get to check out the Air France 787 Business Class Seat, the Air France Inflight Entertainment, and the Air France Business Class food. But, perhaps most importantly, you’ll get a sense of the impeccable Air France Service on this overnight flight!\n\n0:00 Introduction\n1:23 Delta Sky Club\n3:01 Air France 787 Arrival\n3:41 New International Travel Protocols\n4:20 Boarding Air France 787\n6:30 Air France Business Class Inflight Entertainment\n7:13 Air France Business Class Dinner Service\n7:47 Air France Business Class Bed\n8:29 Air France 787 JebScore\n\nFirst, check out Blake Kasparian's Instagram account here:\nhttps://www.instagram.com/Kasper_Aviation/\n\nDon’t miss the Menus by heading here:\nhttps://greenergrass.com/menus\n\nAnd be sure to check out the JebScore:\nhttps://greenergrass.com/jebscore/\n\nDelta Air Lines Inaugural A350 Flight:\nhttps://www.youtube.com/watch?v=aFUGR0-7XWc\n\nDelta A350 from Detroit to Amsterdam:\nhttps://www.youtube.com/watch?v=QFn1dc5h-EY\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nAround We Go – Aluvio\nSalamanca – Sara, the Illstrumentalist\nHappy to See You – Sara, the Illstrumentalist\nEverything’s Better With You – Sara, the Illstrumentalist\nI Choose You – Sara, the Illstrumentalist\nJust Maintaining – Sara, the Illstrumentalist\nA Place Like Home (Instrumental Version) – Bigersson Lundberg",
 "source": "youtube",
 "source_id": "_2u9CgsNZIs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-09-25T16:00:30Z"
}