{
 "name": "Amtrak Roomette Overnight on the Northeast Regional Train",
 "description": "In this video, we’ll share our experience taking the Amtrak Commuter train, the Northeast Regional, overnight from Washington, DC to Boston, Massachusetts for ten hours in an Amtrak Roomette.\n\nWe discovered how comfortable an Amtrak Viewliner Roomette is for two people!\n\nIn this video, you’ll see exactly what it’s like to board this Amtrak Commuter Train at Washington’s Union Station and travel through eight states over 458 miles inside an Amtrak Roomette, Amtrak’s smallest private room.\n\nAmtrak Commuter Train service through the northeast corridor is Amtrak’s most popular and they’ve recently added an Amtrak Viewliner with Sleepers.\n\nThis experience onboard an Amtrak Commuter Train in a Roomette proved challenging. We didn’t sleep as well as we thought we would and paid a price for it. Learn from our mistakes by watching this video about this Amtrak Commuter Train from Washington to Boston on the Northeast Regional Train in an Amtrak Roomette!\n\n0:00 Introduction\n3:47 Boarding Amtrak’s Northeast Regional Commuter Train\n4:50 Amtrak Viewliner Roomette Tour\n6:26 Departing Washington’s Union Station\n7:47 Amtrak Viewliner Roomette Bed Turndown\n9:06 Waking up in the Amtrak Viewliner Roomette\n13:58 Arriving into Boston’s South Station\n15:48 Bloopers\n\nAmtrak Room Comparison:\nhttps://www.youtube.com/watch?v=54SqYY_KwO0\n\nAmtrak Cardinal (Another Viewliner Experience)\nhttps://www.youtube.com/watch?v=agz6Y6-UaH4\n\nDon’t miss my video about Amtrak’s Empire Builder:\nhttps://www.youtube.com/watch?v=iYhuB2uzN9k \n\nAnd here’s a link to the video we made about Amtrak’s Southwest Chief:\nhttps://www.youtube.com/watch?v=eYiMihP0OHU Here's a video I made comparing \n\nAmtrak's Acela to a plane: \nhttps://www.youtube.com/watch?v=aVLnQFTazz8 \n\nAnd, while we’re at it, here’s a playlist of all of the train videos on my channel: https://www.youtube.com/playlist?list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nOff We Go – Jimmy Wahlsteen\nThe Long Walk – Jamie Norwood\nSummer Vibe – Tomas Skyldeberg\nMilky Way Express – Lupus Nocte\nThe Role of Pain – Martin Klem\nIn Heaven – A Month of Sleep",
 "source": "youtube",
 "source_id": "EYwMOl8eZNg",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-06-19T16:00:16Z"
}