{
 "name": "Amtrak Roomette, Bedrooms, and Seat Compared",
 "description": "Ready for your own Amtrak Adventure, but not sure whether to book an Amtrak Roomette, Bedroom, Family Bedroom, Coach Seat, or something else? \n\nIn this video, you'll see each one, including the pros and cons of each option, and if you stick around to the end, I’ll even show you how much they all cost!\n\nIn this Guide to Amtrak, you’ll see the differences between Amtrak’s Coach and Private Rooms. You’ll get a sense of each of the five types of Private Rooms offered by Amtrak: Amtrak Roomette, Amtrak Bedroom, Amtrak Family Bedroom, Amtrak Bedroom Suite, and Amtrak Accessible Bedrooms.\n\nYou’ll see the pros and cons of each option and even see how much you might have to pay for each option on Amtrak.\n\nI’ll share what you get when you travel on Amtrak, no matter what kind of ticket you booked as well as what comes with each step “up” in price and accommodation level.\n\nWhether you want a Coach Seat, Amtrak Roomette, Amtrak Bedroom, Amtrak Family Bedroom, or something else, this video will help you narrow down the right choice for you.\n\nFor even more about an Amtrak Roomette, check out this video about the Amtrak Cardinal:\nhttps://www.youtube.com/watch?v=agz6Y6-UaH4\n\nFor even more about an Amtrak Family Bedroom, check out this video about the Southwest Chief:\nhttps://www.youtube.com/watch?v=eYiMihP0OHU\n\nFor even more about an Amtrak Bedroom, check out this video about the Empire Builder:\nhttps://www.youtube.com/watch?v=iYhuB2uzN9k\n\nAnd, while you’re at it, why not watch this video about the California Zephyr:\nhttps://www.youtube.com/watch?v=m1gRPEZdKyI\n\nOr, this one where a plane and train compete to see which is faster:\nhttps://www.youtube.com/watch?v=aVLnQFTazz8\n\nOr, here’s one about Amtrak’s Acela:\nhttps://www.youtube.com/watch?v=KHF8ajhAZa8\n\nAwww, shucks…why not just watch this playlist of train videos!\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFepS_ZVMUVMsf43z3FYjn4cc\n\n0:00 Introduction\n2:35 Amtrak Coach Seat\n4:13 Amtrak Roomette\n5:35 Amtrak Bedroom\n6:30 Amtrak Bedroom Suites\n7:06 Amtrak Family Bedroom\n8:05 Amtrak Accessible Bedroom\n8:39 Wrap Up\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nWay Back When (Instrumental Version) – Gamma Skies\nLagom – Ooyy\nGolden Crates – Dusty Decks\nBurth Within Sight – Dylan Sitts\nMad Zach – Smartface\nLet Me Know in Time – Tomas Skyldeberg",
 "source": "youtube",
 "source_id": "54SqYY_KwO0",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-05-22T16:00:03Z"
}