{
 "name": "Emirates First Class A380 - 25 Hours Cairo to New York",
 "description": "Watch this video to see what’s it like to fly on the world’s biggest commercial jet in FIRST CLASS with Emirates?!\n\nNobody has done more with the Airbus A380 Super Jumbo than Emirates, especially in “Emirates First Class.” \n\nBut does it still live up to the hype? We spent 25 hours traveling halfway around the planet putting Emirates First Class to the test on the A380.\n\nIn this video, you’ll join us for two incredible Emirates First Class A380 flights, a visit to the Emirates First Class Lounge, and one of the most magnificent aviation experiences available today.\n\nYou’ll see the Emirates First Class A380 seats, which are really more like private cocoons. We’ll highlight all of the details and give you a sense for what it’s like to sit, sleep, and eat in them.\n\nYou’ll see a grand total of seven meals from our Emirates First Class A380 journey from Cairo to Dubai and onto New York’s JFK International Airport.\n\nYou’ll see the Emirates First Class A380 inflight entertainment, which is among the best in the world.\n\nYou’ll see the Emirates First Class A380 service we experienced. In a bit of a spoiler alert, I’ll say the Emirates First Class cabin crew were always there when we wanted something, but they didn’t hover unnecessarily. Put another way, it was true Emirates First Class Service!\n\nYou’ll even go inside not one, but two Emirates Lounges. The Emirates Lounge in Cairo and the mind-blowing Emirates First Class Lounge in Dubai.\n\nEmirates 777-300 New First Class:\nhttps://www.youtube.com/watch?v=AsswlMIo4vY\n\n0:00 Introduction\n1:28 Boarding Emirates First Class A380 to Cairo\n5:31 Emirates First Class Lounge\n8:50 Boarding Emirates First Class A380 to New York City\n11:05 Emirates First Class A380 Seat Tour\n13:59 Getting Comfortable on Emirates A380\n15:37 Emirates A380 Bar\n17:58 Emirates First Class Shower Spa\n18:43 Emirates First Class A380 JebScore\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nThe Northern Saga – Luwaks\nSabah – Ali Sabah\nLow Res Goddess – Young Community\nTogether at Dawn – Joseph Alesci\nOur Youth is Running Out – Alec Slayne\nIn the Beginning of Time – Of Water\nRestless (Instrumental Version) – Kadant\nIndulgent (Uygar Duzgun)\nLighthearted Daydream – Dez Moran\nDraw Lines in the Sand (Instrumental Version) – Blood Red Sun\nA New Decade Begins – Of Water\nBetter (Not Bitter) (Instrumental Version) – King Sis\nYou Me (Instrumental Version) – Penny Lane\nCore Memory – Colors of Illusion\nEnd Destination (Instrumental Version) – Lvly",
 "source": "youtube",
 "source_id": "Sof5NoiGz5Q",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-12-11T17:00:12Z"
}