{
 "name": "First Class Bus \"The JET\" from Washington, DC to New York City",
 "description": "Watch this video to see what a First Class Bus in the United States looks like. \n\nI took \"The Jet\" from Washington, DC to New York City! It claims to be an all-new, first-class travel experience that combines the luxury of a private jet with the affordability and convenience of a motorcoach. But, does it live up to the hype of a First Class Bus? \n\nWatch this video and you’ll see what it’s like to board, ride, and arrive in style on a First Class Bus with the Jet, a motorcoach a step above the rest. \n\nOn this First Class Bus trip from Washington, DC to New York City, you’ll see the first ever “Hoverseats,” which effectively allow you to float above the bumps and dips of the interstate as you travel the 228 miles along the spine of the Northeast Corridor, I-95. \n\nFrom the First Class Bus attendant delivering food and drinks to you to ultra high-speed wi-fi, luxurious bathroom, and space-age seats, all of this First Class Bus experience can be yours for as little as $99. \n\nYou’ll even meet the CEO of the Jet since he kicked off our First Class Bus ride! \n\nThe Jet offers a First Class Bus from Washington and New York, and also makes the return First Class Bus from New York to Washington. \n\nCheck out the Jet’s website:\nhttps://thejet.coach\n\n0:00 Introduction \n2:12 Boarding the First Class Bus \n3:05 Departing Washington, DC \n3:45 The Jet Hoverseats \n5:46 First Class Bus Catering \n6:07 First Class Bus Bathroom \n7:19 First Class Bus WiFi \n7:57 First Class Bus Jebscore \n9:44 First Class Bus Final Thoughts\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies\n \nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks\n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic: \nArise – Jakob Ahlbom \nReading Between The Lines – Mandala Dreams\n Places to Go – Andre Aguado \nA Toast 2 Life – Matt Large \nAmanecer – El Neon",
 "source": "youtube",
 "source_id": "Oh1ULPYMQhI",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-12-18T16:00:09Z"
}