{
 "name": "Flight Over Denali National Park",
 "description": "In this video, you’ll see some unbelievable views from our flight over Denali National Park. \n\nIf you watch this video, you’ll join us for a flight over a completely cloudless Denali. You’ll see the glaciers, mountains, and snowcapped peaks, not to mention the tundra, Denali Park Road, and so much more that make this one of the most remarkable flights around.\n\nKantishna Air Taxi offers visitors to the remote Denali National Park the opportunity to take a so-called “Flightseeing” trip around the area to gain a new perspective on Denali National Park. But we booked a flight with them as a means to avoid the six-and-a-half hour bus ride out. \n\nWe’d planned to fly from Kantishna, at the very back of Denali National Park out to the entrance. It was scheduled to be about 35 minutes, but the weather on our departure day was beyond perfect. And our pilot offered a thrilling ride up to the very edge of Denali’s 20,000+ feet. \n\n0:00 Introduction\n1:26 Hello Jetsetters!\n2:34 The Kantishna Airport\n4:02 Taking off\n5:30 Denali Views Begin\n9:20 Landing at the Denali National Park Entrance\n\nHere’s episode one of the #WildernessToWaikiki Trip! (Flying Alaska Airlines to Alaska):\nhttps://www.youtube.com/watch?v=oKM6kQtnzfc \n\nHere’s episode two of the #WildernessToWaikiki Trip! (The Alaska Railroad):\nhttps://www.youtube.com/watch?v=kIJoUNP2-v4\n\nHere’s episode four of the #WildernessToWaikiki Trip! (Flying from Alaska to Hawaii):\nhttps://youtu.be/Kiq5mLcYqj4\n\nHere's episode five of the #WildernessToWaikiki Trip! (Flying from Honolulu to Dulles):\nhttps://youtu.be/zwd3bPWAmX4\n\nHere’s a link to that video I made about my flight to Everest:\nhttps://www.youtube.com/watch?v=wbeQoKczgqU\n\nHere are some other videos I’ve made about propeller-driven airplanes:\nhttps://www.youtube.com/playlist?list=PLQhp4hw0kFepjHkKYKza7ID1dvJJQ3KiL\n\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nOn The Trail – Tigerblood Jewel\nRevolt – Luwaks\nFinding Out About Her – Philip Ayers\nOverthinking – Dylan Sitts\nBeautiful Awakening – Sublimance\nFragment – Ever So Blue\nThe Street Performer – The Fly Guy Five",
 "source": "youtube",
 "source_id": "w2hh5Ahhlbk",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-07-31T16:00:41Z"
}