{
 "name": "High Speed Train “The Brightline” from Miami to West Palm Beach",
 "description": "Watch this Brightline Review to see what train travel in the United States SHOULD look like! \n\nBrightline Train is a privately-owned and operated train in Florida that connects Miami with Fort Lauderdale, West Palm Beach, and – eventually – Orlando. It runs along the Florida East Coast and connects major cities in the region with High Speed Rail.\n\nBrightline Orlando, scheduled to open in 2022, will be a tremendous addition to the region and will make it easy for people connecting from airports all over the state to get to the theme parks there. The Brightline Train Orlando will transform the area.\n\nBrightline Florida Train offers a level of service unmatched in the United States. From the brilliantly designed (and located) stations in city centers, to beautiful and comfortable cars and energy-efficient locomotives, Brightline is what train travel SHOULD be like all over the United States.\n\nIn this video, you’ll see everything from the Brightline Miami Station to the Brightline Premium Lounge. You’ll see how to store your Brightline Bags, and watch the Brightline Train Full Speed!\n\nBright Line Train was once going to partner with Virgin Trains to become Virgin Trains USA, but that didn’t work out.\n\nRailfans will love this video as it shows off the power of the Siemens Charger SCB-40 locomotives and the beautiful cars, also built by Siemens.\n\nBut it hasn’t quite caught on. Would you travel by Brightline Train if you were in Florida? Let me know in the comments. Seems like a lot of people prefer Rental Cars over Trains.\n\n0:00 Introduction\n2:02 Brightline Premium Lounge\n3:08 Boarding Brightline\n4:51 Brightline Departing Miami\n7:16 Brightline JebScore\n8:47 Brightline Plus Transfer\n9:29 Bloopers\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/\n\nFor more about Brightline:\nhttps://www.gobrightline.com/\n\nMusic:\nHe’s So Fine – Martin Landstrom\nMisterio (Instrumental Version) – Clara Mendes\nThe Bee’s Knees – Gary Combs\nBy the Way – Shiver Disk\nYou’re Never Alone (Instrumental Version) – Colbae\nThe Street Performer (Sting) – Martin Gauffin",
 "source": "youtube",
 "source_id": "Mz9y84oJv0E",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-12-26T14:00:07Z"
}