{
 "name": "Is Aspen Airport the USA's Most Extreme Airport? #AirportsRevealed",
 "description": "Aspen/Pitkin County Airport may be the most extreme airport in the USA. It’s got a relatively short and narrow runway, surrounded by mountains, subject to unpredictable weather, and requires unusual operations to safely operate. In short, simply getting to Aspen is an adventure because it is the most extreme airport in the USA.\n\n0:00 Introduction and Overview\n2:15 Departing Dallas-Fort Worth International Airport for the Extreme Aspen Airport\n4:14 Onboard American Eagle CRJ700 for the Extreme Aspen Airport\n6:08 Beginning the Extreme Aspen Airport Landing\n6:50 Final Approach for the Extreme Aspen Airport Landing\n7:57 Exploring Aspen Airport Terminal\n8:46 Aspen Airport Boarding, Taxi, and De-Icing\n10:23 Extreme Aspen Airport Take-off\n11:20 Landing at Denver International Airport\n\nIn this video, I’ll highlight some of what makes Aspen Airport the most extreme airport in the USA. We flew into Aspen Airport with American Eagle on a CRJ-700 from Dallas and back out on a United Express CRJ-700 to Denver. Our flights to and from Aspen Airport were smooth and on-time, while also offering the opportunity to see the incredible Rocky Mountain landscape laid out below us. Flying in the Rocky Mountains presents some unbelievable views for passengers heading to Aspen. The views from the windows were some of my most memorable -- it's impossible not to be amazed byRocky Mountain Flying!\n\nWe explore the approach and departure from Aspen Airport along with a bit of the action inside the Aspen Airport terminal.\n\nFor more trip reports, please subscribe to my channel!\n http://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.instagram.com/jebbrooksflies \n\nI’m on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nMalleable – Peter Sandberg\nMountain Spring High – Gabriel Lewis\nInto The Blue – Luwaks\nMidnight Zenith – Luwaks\nParallax – Luwaks\nTimeless Clouds – Luwaks\nThe Warmth of The Sun On Her Skin – Peter Sandberg\nBelow Horizon – Luwak",
 "source": "youtube",
 "source_id": "nRBgdzQt9Xs",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-01-30T15:15:09Z"
}