{
 "name": "Luxury Greek Ferry? LUX DELUXE Room on Minoan Lines’ Festos Palace",
 "description": "In this video, you’ll get a sense of what it’s like to travel the roughly two hundred miles over nine hours from Athens to Crete in the most luxurious way possible onboard a Greek Ferry.\n\nJoin me as I travel from the Port of Piraeus near Athens to Heraklion on the island of Crete onboard Minoan Lines' Festos Palace ferry!\n\nThis is my first ever Greek Ferry Review and I figured this was a great place to start!\n\nThe Minoan Lines Festos Palace offers a range of ticket types and you'll learn about each of them along this journey from Piraeus to Milos and onward to Heraklion, but I'll spend the most time revealing the most luxurious option available onboard a Minoan Lines ferry: The Lux Deluxe room.\n\nThis Luxury Overnight Ferry features a so-called \"Lux Deluxe\" room, which includes a bed, a shower, a toilet, a TV, and so much more. You’ll see everything it has to offer.\n\nYou’ll also see the other amenities onboard, including the pool, food, and drinks.\n\nWith 227 islands, it’s no wonder Greece has a rich history as a sea faring nation. And that tradition continues today as millions of people – locals and tourists alike – rely on Ferries to get around this country. I’ll even rate it using the JebScore!\n\n0:00 Introduction\n2:07 Boarding the Greek Ferry\n3:16 Lux Deluxe Room Tour\n4:52 Lunch onboard the Greek Ferry\n7:07 Greek Ferry JebScore\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/ \n\nMusic:\nOcean Deep – Rasmus Faber\nSweet Moonlight – Rune Dale\nThrough the Blaze – Rasmus Faber\nI Wann Stay Here With You (Instrumental Version) – Loving Caliber",
 "source": "youtube",
 "source_id": "XIzPF-L74W4",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-10-02T16:00:25Z"
}