{
 "name": "New JetBlue Mint Studio Review",
 "description": "JetBlue recently announced they’d transform US Business Class with a complete redesign of the Mint Cabin on their A321LR to prepare for beginning their service to London in Summer 2021.\n\nIn advance of JetBlueMint service to London, the airline began serving the JFK - LAX route with the new Mint service and I was lucky enough to get onboard!\n\nIn this JetBlue Mint Studio Review, you’ll be able to judge for yourself what you think of the JetBlue Mint Studio on this A321LR. \n\nIn this JetBlue Mint Studio Review, you’ll see how JetBlue redesigned the cabin to create the largest business class seat on a US Carrier, which they call the Mint Studio. You’ll also check out JetBlue’s innovative Mint food. You’ll even see the largest built-in inflight entertainment screen in the US…it’s a whopping 22 inches!\n\nYou’ll also see how much JetBlue’s Mint Studio costs.\n\nIs this First Class on a low cost carrier? You be the judge after this JetBlue Mint Studio Review!\n\n0:00 Introduction\n3:07 JetBlue Mint Studio Tour\n5:26 How to Book JetBlue Mint Studio\n6:17 JetBlue Inflight Entertainment\n8:13 JetBlue Mint Food\n10:45 JetBlue Mint Studio JebScore\n13:07 Landing\n\nGrab your own Bose Headphones:\nhttp://Jeb.Flights/Bose\n\nFull JetBlue Mint Take-off and Landing:\nhttps://youtu.be/DagOsjvbMoU\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: https://greenergrass.com/ \n\nSponsorship Disclosures:\nhttps://greenergrass.com/sponsorship-policy/\n\nMusic:\nNo Time to Criticize (Sting Version) – Victor Olsson\nSunset Drive – Future Joust\nBorrowed Matches – Tape Machines\nI Give My All – JOYSPRING\nThere Is Another Sky – Golden Fern\nVegas – Onda Norte\nLose My Breath (Instrumental Version) - Basixx",
 "source": "youtube",
 "source_id": "41xsJCqXJjY",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-06-08T21:04:34Z"
}