{
 "name": "Qatar Airways Business Class Qsuite A350-1000",
 "description": "Qatar Airways Business Class has been described to me as being so good, you don’t need First Class. In fact, it’s been one of the most requested videos by subscribers to this channel.\n\nIn this video, we’ll highlight all it has to offer on a 12+ hour flight from Dulles to Doha. From the lounge in Washington, DC to the Qatar Airways Business Class Qsuite seat itself, the Qatar Airways Business Class food, the Oryx One Inflight Entertainment, and the Qatar Airways Business Class Service, you’ll see it all!\n\nThis flight is the first episode of our #NewlywedWorldTour! We’re two tremendous aviation enthusiasts, and, in order to celebrate our honeymoon, we strung together several ultimate aviation experiences into one African adventure that took us from the United States to Kenya, the Seychelles, and Egypt. \n\nThis Qatar Airways Business Class flight onboard the A350-1000 will go down in our “logbooks” as one of our favorite flights. And there are a lot of reasons for it, so I hope you’ll enjoy the video from beginning to end!\n\nAnd be sure to let us know what you think in the comments below. We read every one!\n\n0:00 Introduction\n0:53 Dulles – Doha Flight Overview \n2:04 British Airways & Turkish Airlines Lounges at Dulles\n2:36 Qatar Airways Business Class Qsuite Overview\n4:28 Qatar Airways A350-1000 Takeoff\n5:21 Qatar Airways Business Class Dinner\n6:26 Qatar Airways A350-1000 Cabin Walk-through\n8:39 Qatar Airways Business Class Jebscore\n\nFor more trip reports, please subscribe to my channel! \nhttp://www.JebBrooksFlies.com \n\nCheck me out on Instagram: \nhttps://www.Instagram.com/JebBrooksFlies \n\nCheck me out on Twitter, too: \nhttps://twitter.com/jebbrooks \n\nAnd don't forget to take a look at my travel blog: \nhttps://greenergrass.com/\n\nMusic:\nSummer of Strumming - Mica Emory\nMy Shoes Are Worn Out - Mica Emory\nBring Me Closer - Colton Walls\nWe Built This - Mica Emory\nMayweather - warmkeys.\nAnother Sunday - Ealot",
 "source": "youtube",
 "source_id": "AUUd1CPgnUw",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2021-11-13T17:00:11Z"
}