{
 "name": "Getting Around Dallas Love Field - Complete Airport Tour",
 "description": "Thanks for joining me on this tour of Dallas Love Field! Today's tour covers Dallas's smaller and more historic airport, which operates as a headquarters for Southwest Airlines.\n\nDallas Love Field was founded over a century ago, and today, it serves as one of Southwest's primary hubs for domestic flights, as well as their on-site corporate headquarters. It's one of the busiest airports in the country, serving 1400 flights a week to several dozen destinations, acting as a connection and destination for thousands of travelers a day. This compact terminal is inviting and easy to navigate, and the airport fits a lot in a small space!\n\n*NOTE* - The boutique airline JSX also uses Dallas Love, but I didn't cover them, as they're not located in the main terminal. If you're flying JSX, head to their website to get more information regarding arrival, departure, and parking.\n\nI do a lot of original research while preparing these videos, so please leave a comment below if you have questions about the tour or navigating the airport, and I'll do my best to answer them! Or, share your own thoughts and experiences about DAL!\n\nFinally, let me know where you'd like to see next! Stay tuned for new flight and airport videos every two weeks!\n\nPlease travel safely and wear a mask!\n\nThe contents of this video and its production are not endorsed by any entity portrayed therein, and none of the entities provided any input or compensation in the production of this video.\n\nIf you'd like to speak with me directly about the contents of this video or my channel, you can reach me at milesbyfoot at gmail.com.\n\nAnimated thumbnails by my artist wife, Beth!\n\nIG: bethmclain.art\nTwitter: Marshmallowbat\n\n00:00 - Intro\n00:45 - Terminal Map\n01:25 - Non-Southwest Departures (Delta, Alaska)\n02:10 - Southwest Departures \n02:55 - Arriving at Dallas Love\n03:30 - DAL's History\n04:25 - Conclusion\n05:10 - End Screen\n\nThanks again for watching, and keep moving forward!\n\nThumbnail by my wife Beth! \nInstagram at bethmclain.art\n\n\n#dallas #dal #southwestairlines #airport #aviation #dallaslovefield\n\n_______________________________________\n\nEquipment Used\nGoPro Hero 7 Black\nFeiyuTech G6 Gimbal\nNikon D3200\nClip Studio Paint\nAdobe Premiere Pro\nIrfanView\nAudacity\n\nMusic\nHighlander - André Aguado\n\nSources\njfklibrary.org\nnationalmuseum.af.mil\ndelta.com\nsouthwest.com\nalaskaair.com\nwikipedia.com\ndallas-lovefield.com",
 "source": "youtube",
 "source_id": "l6UCNK2otPo",
 "type": "Flight",
 "company": "",
 "stops": [],
 "postdate": "2022-04-02T16:00:31Z"
}